[Killed] BlockStatement
lib/response.js:64:36
  * @public
  */
 
-res.status = function status(code) {
-  // Check if the status code is not an integer
-  if (!Number.isInteger(code)) {
-    throw new TypeError(`Invalid status code: ${JSON.stringify(code)}. Status code must be an integer.`);
-  }
-  // Check if the status code is outside of Node's valid range
-  if (code < 100 || code > 999) {
-    throw new RangeError(`Invalid status code: ${JSON.stringify(code)}. Status code must be greater than 99 and less than 1000.`);
-  }
-
-  this.statusCode = code;
-  return this;
-};
+res.status = function status(code) {};
 
 /**
killedBy: auth GET / should redirect to /login
statusReason: expected 302 "Found", got 200 "OK"

[Killed] ConditionalExpression
lib/response.js:66:7
 
 res.status = function status(code) {
   // Check if the status code is not an integer
-  if (!Number.isInteger(code)) {
+  if (false) {
     throw new TypeError(`Invalid status code: ${JSON.stringify(code)}. Status code must be an integer.`);
   }
killedBy: res .sendStatus(statusCode) should raise error for invalid status code
statusReason: expected body '<!DOCTYPE html>\n' +
  '<html lang="en">\n' +
  '<head>\n' +
  '<meta charset="utf-8">\n' +
  '<title>Error</title>\n' +
  '</head>\n' +
  '<body>\n' +

[Killed] ConditionalExpression
lib/response.js:66:7
 
 res.status = function status(code) {
   // Check if the status code is not an integer
-  if (!Number.isInteger(code)) {
+  if (true) {
     throw new TypeError(`Invalid status code: ${JSON.stringify(code)}. Status code must be an integer.`);
   }
killedBy: auth GET / should redirect to /login
statusReason: expected 302 "Found", got 500 "Internal Server Error"

[Killed] EqualityOperator
lib/response.js:70:21
     throw new TypeError(`Invalid status code: ${JSON.stringify(code)}. Status code must be an integer.`);
   }
   // Check if the status code is outside of Node's valid range
-  if (code < 100 || code > 999) {
+  if (code < 100 || code <= 999) {
     throw new RangeError(`Invalid status code: ${JSON.stringify(code)}. Status code must be greater than 99 and less than 1000.`);
   }
killedBy: auth GET / should redirect to /login
statusReason: expected 302 "Found", got 500 "Internal Server Error"

[Killed] EqualityOperator
lib/response.js:70:7
     throw new TypeError(`Invalid status code: ${JSON.stringify(code)}. Status code must be an integer.`);
   }
   // Check if the status code is outside of Node's valid range
-  if (code < 100 || code > 999) {
+  if (code >= 100 || code > 999) {
     throw new RangeError(`Invalid status code: ${JSON.stringify(code)}. Status code must be greater than 99 and less than 1000.`);
   }
killedBy: auth GET / should redirect to /login
statusReason: expected 302 "Found", got 500 "Internal Server Error"

[Killed] BlockStatement
lib/response.js:93:28
  * @public
  */
 
-res.links = function(links){
-  var link = this.get('Link') || '';
-  if (link) link += ', ';
-  return this.set('Link', link + Object.keys(links).map(function(rel){
-    return '<' + links[rel] + '>; rel="' + rel + '"';
-  }).join(', '));
-};
+res.links = function(links){};
 
 /**
killedBy: res .links(obj) should set Link header field
statusReason: expected "Link" header field

[Killed] ConditionalExpression
lib/response.js:94:14
  */
 
 res.links = function(links){
-  var link = this.get('Link') || '';
+  var link = false;
   if (link) link += ', ';
   return this.set('Link', link + Object.keys(links).map(function(rel){
killedBy: res .links(obj) should set Link header field
statusReason: expected "Link" of "<http://api.example.com/users?page=2>; rel="next", <http://api.example.com/users?page=5>; rel="last"", got "false<http://api.example.com/users?page=2>; rel="next", <http://api.example.com/users?page=5>; rel="last""

[Killed] ConditionalExpression
lib/response.js:94:14
  */
 
 res.links = function(links){
-  var link = this.get('Link') || '';
+  var link = true;
   if (link) link += ', ';
   return this.set('Link', link + Object.keys(links).map(function(rel){
killedBy: res .links(obj) should set Link header field
statusReason: expected "Link" of "<http://api.example.com/users?page=2>; rel="next", <http://api.example.com/users?page=5>; rel="last"", got "true, <http://api.example.com/users?page=2>; rel="next", <http://api.example.com/users?page=5>; rel="last""

[Killed] ConditionalExpression
lib/response.js:95:7
 
 res.links = function(links){
   var link = this.get('Link') || '';
-  if (link) link += ', ';
+  if (false) link += ', ';
   return this.set('Link', link + Object.keys(links).map(function(rel){
     return '<' + links[rel] + '>; rel="' + rel + '"';
killedBy: res .links(obj) should set Link header field for multiple calls

[Killed] ConditionalExpression
lib/response.js:95:7
 
 res.links = function(links){
   var link = this.get('Link') || '';
-  if (link) link += ', ';
+  if (true) link += ', ';
   return this.set('Link', link + Object.keys(links).map(function(rel){
     return '<' + links[rel] + '>; rel="' + rel + '"';
killedBy: res .links(obj) should set Link header field
statusReason: expected "Link" of "<http://api.example.com/users?page=2>; rel="next", <http://api.example.com/users?page=5>; rel="last"", got ", <http://api.example.com/users?page=2>; rel="next", <http://api.example.com/users?page=5>; rel="last""

[Killed] ArithmeticOperator
lib/response.js:96:27
 res.links = function(links){
   var link = this.get('Link') || '';
   if (link) link += ', ';
-  return this.set('Link', link + Object.keys(links).map(function(rel){
-    return '<' + links[rel] + '>; rel="' + rel + '"';
-  }).join(', '));
+  return this.set('Link', link - Object.keys(links).map(function (rel) {
+  return '<' + links[rel] + '>; rel="' + rel + '"';
+}).join(', '));
 };
 
killedBy: res .links(obj) should set Link header field
statusReason: expected "Link" of "<http://api.example.com/users?page=2>; rel="next", <http://api.example.com/users?page=5>; rel="last"", got "NaN"

[Killed] BlockStatement
lib/response.js:96:70
 res.links = function(links){
   var link = this.get('Link') || '';
   if (link) link += ', ';
-  return this.set('Link', link + Object.keys(links).map(function(rel){
-    return '<' + links[rel] + '>; rel="' + rel + '"';
-  }).join(', '));
+  return this.set('Link', link + Object.keys(links).map(function(rel){}).join(', '));
 };
 
killedBy: res .links(obj) should set Link header field
statusReason: expected "Link" of "<http://api.example.com/users?page=2>; rel="next", <http://api.example.com/users?page=5>; rel="last"", got ","

[Killed] StringLiteral
lib/response.js:97:50
   var link = this.get('Link') || '';
   if (link) link += ', ';
   return this.set('Link', link + Object.keys(links).map(function(rel){
-    return '<' + links[rel] + '>; rel="' + rel + '"';
+    return '<' + links[rel] + '>; rel="' + rel + "";
   }).join(', '));
 };
killedBy: res .links(obj) should set Link header field
statusReason: expected "Link" of "<http://api.example.com/users?page=2>; rel="next", <http://api.example.com/users?page=5>; rel="last"", got "<http://api.example.com/users?page=2>; rel="next, <http://api.example.com/users?page=5>; rel="last"

[Killed] StringLiteral
lib/response.js:97:31
   var link = this.get('Link') || '';
   if (link) link += ', ';
   return this.set('Link', link + Object.keys(links).map(function(rel){
-    return '<' + links[rel] + '>; rel="' + rel + '"';
+    return '<' + links[rel] + "" + rel + '"';
   }).join(', '));
 };
killedBy: res .links(obj) should set Link header field
statusReason: expected "Link" of "<http://api.example.com/users?page=2>; rel="next", <http://api.example.com/users?page=5>; rel="last"", got "<http://api.example.com/users?page=2next", <http://api.example.com/users?page=5last""

[Timeout] ConditionalExpression
lib/response.js:125:5
 
   switch (typeof chunk) {
     // string defaulting to html
-    case 'string':
-      if (!this.get('Content-Type')) {
-        this.type('html');
-      }
-      break;
+    // string defaulting to html
+case 'string':
     case 'boolean':
     case 'number':

[Killed] ConditionalExpression
lib/response.js:126:11
   switch (typeof chunk) {
     // string defaulting to html
     case 'string':
-      if (!this.get('Content-Type')) {
+      if (true) {
         this.type('html');
       }
killedBy: error-pages Accept: application/json GET /404 should respond with 404
statusReason: expected { error: 'Not found' } response body, got {}

[Killed] BooleanLiteral
lib/response.js:126:11
   switch (typeof chunk) {
     // string defaulting to html
     case 'string':
-      if (!this.get('Content-Type')) {
+      if (this.get('Content-Type')) {
         this.type('html');
       }
killedBy: ejs GET / should respond with html
statusReason: expected "Content-Type" header field

[Killed] StringLiteral
lib/response.js:127:19
     // string defaulting to html
     case 'string':
       if (!this.get('Content-Type')) {
-        this.type('html');
+        this.type("");
       }
       break;
killedBy: auth GET /login should render login form
statusReason: expected body undefined to match /<form/

[Killed] ConditionalExpression
lib/response.js:132:5
       break;
     case 'boolean':
     case 'number':
-    case 'object':
-      if (chunk === null) {
-        chunk = '';
-      } else if (Buffer.isBuffer(chunk)) {
-        if (!this.get('Content-Type')) {
-          this.type('bin');
-        }
-      } else {
-        return this.json(chunk);
-      }
-      break;
+    case 'object':
   }
 
killedBy: resource GET /users should respond with all users
statusReason: expected body '\x00\x00\x00\x00\x00\x00' to match /^\[{"name":"tj"},{"name":"ciaran"},{"name":"aaron"},{"name":"guillermo"},{"name":"simon"},{"name":"tobi"}\]/

[Killed] StringLiteral
lib/response.js:132:10
       break;
     case 'boolean':
     case 'number':
-    case 'object':
+    case "":
       if (chunk === null) {
         chunk = '';
killedBy: resource GET /users should respond with all users
statusReason: expected body '\x00\x00\x00\x00\x00\x00' to match /^\[{"name":"tj"},{"name":"ciaran"},{"name":"aaron"},{"name":"guillermo"},{"name":"simon"},{"name":"tobi"}\]/

[Killed] EqualityOperator
lib/response.js:133:11
     case 'boolean':
     case 'number':
     case 'object':
-      if (chunk === null) {
+      if (chunk !== null) {
         chunk = '';
       } else if (Buffer.isBuffer(chunk)) {
killedBy: resource GET /users should respond with all users
statusReason: expected body '' to match /^\[{"name":"tj"},{"name":"ciaran"},{"name":"aaron"},{"name":"guillermo"},{"name":"simon"},{"name":"tobi"}\]/

[Killed] ConditionalExpression
lib/response.js:133:11
     case 'boolean':
     case 'number':
     case 'object':
-      if (chunk === null) {
+      if (false) {
         chunk = '';
       } else if (Buffer.isBuffer(chunk)) {
killedBy: resource GET /users/1..3.json should respond with users 2 and 3 as json
statusReason: expected body '[{"name":"ciaran"},{"name":"aaron"},{"name":"guillermo"}]' to match /^\[null,{"name":"aaron"},{"name":"guillermo"}\]/

[Killed] BlockStatement
lib/response.js:135:42
     case 'object':
       if (chunk === null) {
         chunk = '';
-      } else if (Buffer.isBuffer(chunk)) {
-        if (!this.get('Content-Type')) {
-          this.type('bin');
-        }
-      } else {
+      } else if (Buffer.isBuffer(chunk)) {} else {
         return this.json(chunk);
       }
killedBy: res .send(Buffer) should send as octet-stream
statusReason: expected "Content-Type" header field

[Killed] ConditionalExpression
lib/response.js:135:18
     case 'object':
       if (chunk === null) {
         chunk = '';
-      } else if (Buffer.isBuffer(chunk)) {
+      } else if (false) {
         if (!this.get('Content-Type')) {
           this.type('bin');
killedBy: resource GET /users/1..3.json should respond with users 2 and 3 as json
statusReason: expected body '[{"name":"ciaran"},{"name":"aaron"},{"name":"guillermo"}]' to match /^\[null,{"name":"aaron"},{"name":"guillermo"}\]/

[Killed] ConditionalExpression
lib/response.js:136:13
       if (chunk === null) {
         chunk = '';
       } else if (Buffer.isBuffer(chunk)) {
-        if (!this.get('Content-Type')) {
+        if (true) {
           this.type('bin');
         }
killedBy: res .attachment(filename) should set the Content-Type
statusReason: expected "Content-Type" of "image/png", got "application/octet-stream"

[Killed] BooleanLiteral
lib/response.js:136:13
       if (chunk === null) {
         chunk = '';
       } else if (Buffer.isBuffer(chunk)) {
-        if (!this.get('Content-Type')) {
+        if (this.get('Content-Type')) {
           this.type('bin');
         }
killedBy: res .attachment(filename) should set the Content-Type
statusReason: expected "Content-Type" of "image/png", got "application/octet-stream"

[Killed] BlockStatement
lib/response.js:139:14
         if (!this.get('Content-Type')) {
           this.type('bin');
         }
-      } else {
-        return this.json(chunk);
-      }
+      } else {}
       break;
   }
killedBy: resource GET /users should respond with all users
statusReason: expected body '\x00\x00\x00\x00\x00\x00' to match /^\[{"name":"tj"},{"name":"ciaran"},{"name":"aaron"},{"name":"guillermo"},{"name":"simon"},{"name":"tobi"}\]/

[Killed] ConditionalExpression
lib/response.js:146:7
   }
 
   // write strings in utf-8
-  if (typeof chunk === 'string') {
+  if (true) {
     encoding = 'utf8';
     type = this.get('Content-Type');
killedBy: mvc GET /users should display a list of users
statusReason: expected body '<!DOCTYPE html>\n' +
  '<html>\n' +
  '<head>\n' +
  '  <meta charset="utf-8">\n' +
  '  <meta name="viewport" content="width=device-width,initial-scale=1">\n' +
  '  <link rel="stylesheet" href="/style.css">\n' +
  '  <title>Users</title>\n' +
  '</head>\n' +

[Timeout] BlockStatement
lib/response.js:146:34
   }
 
   // write strings in utf-8
-  if (typeof chunk === 'string') {
-    encoding = 'utf8';
-    type = this.get('Content-Type');
-
-    // reflect this in content-type
-    if (typeof type === 'string') {
-      this.set('Content-Type', setCharset(type, 'utf-8'));
-    }
-  }
+  if (typeof chunk === 'string') {}
 
   // determine if ETag should be generated

[Timeout] StringLiteral
lib/response.js:148:21
   // write strings in utf-8
   if (typeof chunk === 'string') {
     encoding = 'utf8';
-    type = this.get('Content-Type');
+    type = this.get("");
 
     // reflect this in content-type

[Killed] EqualityOperator
lib/response.js:151:9
     type = this.get('Content-Type');
 
     // reflect this in content-type
-    if (typeof type === 'string') {
+    if (typeof type !== 'string') {
       this.set('Content-Type', setCharset(type, 'utf-8'));
     }
killedBy: mvc GET /users should display a list of users
statusReason: expected body '<!DOCTYPE html>\n' +
  '<html>\n' +
  '<head>\n' +
  '  <meta charset="utf-8">\n' +
  '  <meta name="viewport" content="width=device-width,initial-scale=1">\n' +
  '  <link rel="stylesheet" href="/style.css">\n' +
  '  <title>Users</title>\n' +
  '</head>\n' +

[Killed] ConditionalExpression
lib/response.js:151:9
     type = this.get('Content-Type');
 
     // reflect this in content-type
-    if (typeof type === 'string') {
+    if (false) {
       this.set('Content-Type', setCharset(type, 'utf-8'));
     }
killedBy: mvc GET /users should display a list of users
statusReason: expected body '<!DOCTYPE html>\n' +
  '<html>\n' +
  '<head>\n' +
  '  <meta charset="utf-8">\n' +
  '  <meta name="viewport" content="width=device-width,initial-scale=1">\n' +
  '  <link rel="stylesheet" href="/style.css">\n' +
  '  <title>Users</title>\n' +
  '</head>\n' +

[Timeout] StringLiteral
lib/response.js:157:24
   }
 
   // determine if ETag should be generated
-  var etagFn = app.get('etag fn')
+  var etagFn = app.get("")
   var generateETag = !this.get('ETag') && typeof etagFn === 'function'
 

[Killed] ConditionalExpression
lib/response.js:158:22
 
   // determine if ETag should be generated
   var etagFn = app.get('etag fn')
-  var generateETag = !this.get('ETag') && typeof etagFn === 'function'
+  var generateETag = true
 
   // populate Content-Length
killedBy: mvc GET /users should display a list of users
statusReason: expected body '<!DOCTYPE html>\n' +
  '<html>\n' +
  '<head>\n' +
  '  <meta charset="utf-8">\n' +
  '  <meta name="viewport" content="width=device-width,initial-scale=1">\n' +
  '  <link rel="stylesheet" href="/style.css">\n' +
  '  <title>Users</title>\n' +
  '</head>\n' +

[Killed] EqualityOperator
lib/response.js:158:43
 
   // determine if ETag should be generated
   var etagFn = app.get('etag fn')
-  var generateETag = !this.get('ETag') && typeof etagFn === 'function'
+  var generateETag = !this.get('ETag') && typeof etagFn !== 'function'
 
   // populate Content-Length
killedBy: mvc GET /users should display a list of users
statusReason: expected body '<!DOCTYPE html>\n' +
  '<html>\n' +
  '<head>\n' +
  '  <meta charset="utf-8">\n' +
  '  <meta name="viewport" content="width=device-width,initial-scale=1">\n' +
  '  <link rel="stylesheet" href="/style.css">\n' +
  '  <title>Users</title>\n' +
  '</head>\n' +

[Killed] ConditionalExpression
lib/response.js:162:7
 
   // populate Content-Length
   var len
-  if (chunk !== undefined) {
+  if (false) {
     if (Buffer.isBuffer(chunk)) {
       // get length of Buffer
killedBy: mvc GET /users should display a list of users
statusReason: expected body '<!DOCTYPE html>\n' +
  '<html>\n' +
  '<head>\n' +
  '  <meta charset="utf-8">\n' +
  '  <meta name="viewport" content="width=device-width,initial-scale=1">\n' +
  '  <link rel="stylesheet" href="/style.css">\n' +
  '  <title>Users</title>\n' +
  '</head>\n' +

[Killed] BlockStatement
lib/response.js:162:28
 
   // populate Content-Length
   var len
-  if (chunk !== undefined) {
-    if (Buffer.isBuffer(chunk)) {
-      // get length of Buffer
-      len = chunk.length
-    } else if (!generateETag && chunk.length < 1000) {
-      // just calculate length when no ETag + small chunk
-      len = Buffer.byteLength(chunk, encoding)
-    } else {
-      // convert chunk to Buffer and calculate
-      chunk = Buffer.from(chunk, encoding)
-      encoding = undefined;
-      len = chunk.length
-    }
-
-    this.set('Content-Length', len);
-  }
+  if (chunk !== undefined) {}
 
   // populate ETag
killedBy: HEAD should output the same headers as GET requests
statusReason: Expected values to be loosely deep-equal:

{
  'content-length': '4',
  'content-type': 'text/html; charset=utf-8',
  'x-powered-by': 'Express',
  connection: 'close'
}

[Killed] ConditionalExpression
lib/response.js:163:9
   // populate Content-Length
   var len
   if (chunk !== undefined) {
-    if (Buffer.isBuffer(chunk)) {
+    if (true) {
       // get length of Buffer
       len = chunk.length
killedBy: mvc GET /users should display a list of users
statusReason: expected body '<!DOCTYPE html>\n' +
  '<html>\n' +
  '<head>\n' +
  '  <meta charset="utf-8">\n' +
  '  <meta name="viewport" content="width=device-width,initial-scale=1">\n' +
  '  <link rel="stylesheet" href="/style.css">\n' +
  '  <title>Users</title>\n' +
  '</head>\n' +

[Timeout] ConditionalExpression
lib/response.js:163:9
   // populate Content-Length
   var len
   if (chunk !== undefined) {
-    if (Buffer.isBuffer(chunk)) {
+    if (false) {
       // get length of Buffer
       len = chunk.length

[Killed] BooleanLiteral
lib/response.js:166:16
     if (Buffer.isBuffer(chunk)) {
       // get length of Buffer
       len = chunk.length
-    } else if (!generateETag && chunk.length < 1000) {
+    } else if (generateETag && chunk.length < 1000) {
       // just calculate length when no ETag + small chunk
       len = Buffer.byteLength(chunk, encoding)
killedBy: mvc GET /users should display a list of users
statusReason: expected body '<!DOCTYPE html>\n' +
  '<html>\n' +
  '<head>\n' +
  '  <meta charset="utf-8">\n' +
  '  <meta name="viewport" content="width=device-width,initial-scale=1">\n' +
  '  <link rel="stylesheet" href="/style.css">\n' +
  '  <title>Users</title>\n' +
  '</head>\n' +

[Killed] BlockStatement
lib/response.js:166:54
     if (Buffer.isBuffer(chunk)) {
       // get length of Buffer
       len = chunk.length
-    } else if (!generateETag && chunk.length < 1000) {
-      // just calculate length when no ETag + small chunk
-      len = Buffer.byteLength(chunk, encoding)
-    } else {
+    } else if (!generateETag && chunk.length < 1000) {} else {
       // convert chunk to Buffer and calculate
       chunk = Buffer.from(chunk, encoding)
killedBy: req .fresh should return false when the resource is modified
statusReason: Parse Error: Invalid character in Content-Length

[Killed] BlockStatement
lib/response.js:169:12
     } else if (!generateETag && chunk.length < 1000) {
       // just calculate length when no ETag + small chunk
       len = Buffer.byteLength(chunk, encoding)
-    } else {
-      // convert chunk to Buffer and calculate
-      chunk = Buffer.from(chunk, encoding)
-      encoding = undefined;
-      len = chunk.length
-    }
+    } else {}
 
     this.set('Content-Length', len);
killedBy: auth GET /login should render login form
statusReason: Parse Error: Invalid character in Content-Length

[Killed] StringLiteral
lib/response.js:176:14
       len = chunk.length
     }
 
-    this.set('Content-Length', len);
+    this.set("", len);
   }
 
killedBy: auth GET /login should render login form
statusReason: Header name must be a valid HTTP token [""]

[Killed] BlockStatement
lib/response.js:181:42
 
   // populate ETag
   var etag;
-  if (generateETag && len !== undefined) {
-    if ((etag = etagFn(chunk, encoding))) {
-      this.set('ETag', etag);
-    }
-  }
+  if (generateETag && len !== undefined) {}
 
   // freshness
killedBy: mvc GET /users should display a list of users
statusReason: expected body '<!DOCTYPE html>\n' +
  '<html>\n' +
  '<head>\n' +
  '  <meta charset="utf-8">\n' +
  '  <meta name="viewport" content="width=device-width,initial-scale=1">\n' +
  '  <link rel="stylesheet" href="/style.css">\n' +
  '  <title>Users</title>\n' +
  '</head>\n' +

[Killed] ConditionalExpression
lib/response.js:181:23
 
   // populate ETag
   var etag;
-  if (generateETag && len !== undefined) {
+  if (generateETag && true) {
     if ((etag = etagFn(chunk, encoding))) {
       this.set('ETag', etag);
killedBy: mvc GET /users should display a list of users
statusReason: expected body '<!DOCTYPE html>\n' +
  '<html>\n' +
  '<head>\n' +
  '  <meta charset="utf-8">\n' +
  '  <meta name="viewport" content="width=device-width,initial-scale=1">\n' +
  '  <link rel="stylesheet" href="/style.css">\n' +
  '  <title>Users</title>\n' +
  '</head>\n' +

[Killed] ConditionalExpression
lib/response.js:182:10
   // populate ETag
   var etag;
   if (generateETag && len !== undefined) {
-    if ((etag = etagFn(chunk, encoding))) {
+    if ((true)) {
       this.set('ETag', etag);
     }
killedBy: mvc GET /users should display a list of users
statusReason: expected body '<!DOCTYPE html>\n' +
  '<html>\n' +
  '<head>\n' +
  '  <meta charset="utf-8">\n' +
  '  <meta name="viewport" content="width=device-width,initial-scale=1">\n' +
  '  <link rel="stylesheet" href="/style.css">\n' +
  '  <title>Users</title>\n' +
  '</head>\n' +

[Killed] BlockStatement
lib/response.js:182:43
   // populate ETag
   var etag;
   if (generateETag && len !== undefined) {
-    if ((etag = etagFn(chunk, encoding))) {
-      this.set('ETag', etag);
-    }
+    if ((etag = etagFn(chunk, encoding))) {}
   }
 
killedBy: mvc GET /users should display a list of users
statusReason: expected body '<!DOCTYPE html>\n' +
  '<html>\n' +
  '<head>\n' +
  '  <meta charset="utf-8">\n' +
  '  <meta name="viewport" content="width=device-width,initial-scale=1">\n' +
  '  <link rel="stylesheet" href="/style.css">\n' +
  '  <title>Users</title>\n' +
  '</head>\n' +

[Killed] ConditionalExpression
lib/response.js:188:7
   }
 
   // freshness
-  if (req.fresh) this.status(304);
+  if (false) this.status(304);
 
   // strip irrelevant headers
killedBy: mvc GET /users should display a list of users
statusReason: expected body '<!DOCTYPE html>\n' +
  '<html>\n' +
  '<head>\n' +
  '  <meta charset="utf-8">\n' +
  '  <meta name="viewport" content="width=device-width,initial-scale=1">\n' +
  '  <link rel="stylesheet" href="/style.css">\n' +
  '  <title>Users</title>\n' +
  '</head>\n' +

[Killed] ConditionalExpression
lib/response.js:188:7
   }
 
   // freshness
-  if (req.fresh) this.status(304);
+  if (true) this.status(304);
 
   // strip irrelevant headers
killedBy: auth GET /login should render login form
statusReason: expected 200 "OK", got 304 "Not Modified"

[Killed] LogicalOperator
lib/response.js:191:7
   if (req.fresh) this.status(304);
 
   // strip irrelevant headers
-  if (204 === this.statusCode || 304 === this.statusCode) {
+  if (204 === this.statusCode && 304 === this.statusCode) {
     this.removeHeader('Content-Type');
     this.removeHeader('Content-Length');
killedBy: app .VERB() should only call an error handling routing callback when an error is propagated
statusReason: aborted

[Killed] ConditionalExpression
lib/response.js:191:7
   if (req.fresh) this.status(304);
 
   // strip irrelevant headers
-  if (204 === this.statusCode || 304 === this.statusCode) {
+  if (false) {
     this.removeHeader('Content-Type');
     this.removeHeader('Content-Length');
killedBy: mvc GET /users should display a list of users
statusReason: expected body '<!DOCTYPE html>\n' +
  '<html>\n' +
  '<head>\n' +
  '  <meta charset="utf-8">\n' +
  '  <meta name="viewport" content="width=device-width,initial-scale=1">\n' +
  '  <link rel="stylesheet" href="/style.css">\n' +
  '  <title>Users</title>\n' +
  '</head>\n' +

[Killed] StringLiteral
lib/response.js:192:23
 
   // strip irrelevant headers
   if (204 === this.statusCode || 304 === this.statusCode) {
-    this.removeHeader('Content-Type');
+    this.removeHeader("");
     this.removeHeader('Content-Length');
     this.removeHeader('Transfer-Encoding');
killedBy: res when .statusCode is 204 should strip Content-* fields, Transfer-Encoding field, and body
statusReason: should not have header Content-Type

[Killed] StringLiteral
lib/response.js:194:23
   if (204 === this.statusCode || 304 === this.statusCode) {
     this.removeHeader('Content-Type');
     this.removeHeader('Content-Length');
-    this.removeHeader('Transfer-Encoding');
+    this.removeHeader("");
     chunk = '';
   }
killedBy: res when .statusCode is 204 should strip Content-* fields, Transfer-Encoding field, and body
statusReason: aborted

[Killed] EqualityOperator
lib/response.js:199:7
   }
 
   // alter headers for 205
-  if (this.statusCode === 205) {
+  if (this.statusCode !== 205) {
     this.set('Content-Length', '0')
     this.removeHeader('Transfer-Encoding')
killedBy: auth GET /login should render login form
statusReason: expected body '' to match /<form/

[Killed] ConditionalExpression
lib/response.js:199:7
   }
 
   // alter headers for 205
-  if (this.statusCode === 205) {
+  if (true) {
     this.set('Content-Length', '0')
     this.removeHeader('Transfer-Encoding')
killedBy: auth GET /login should render login form
statusReason: expected body '' to match /<form/

[Killed] StringLiteral
lib/response.js:200:14
 
   // alter headers for 205
   if (this.statusCode === 205) {
-    this.set('Content-Length', '0')
+    this.set("", '0')
     this.removeHeader('Transfer-Encoding')
     chunk = ''
killedBy: res when .statusCode is 205 should strip Transfer-Encoding field and body, set Content-Length
statusReason: Parse Error: Content-Length can't be present with Transfer-Encoding

[Killed] StringLiteral
lib/response.js:201:23
   // alter headers for 205
   if (this.statusCode === 205) {
     this.set('Content-Length', '0')
-    this.removeHeader('Transfer-Encoding')
+    this.removeHeader("")
     chunk = ''
   }
killedBy: res when .statusCode is 205 should strip Transfer-Encoding field and body, set Content-Length
statusReason: Parse Error: Content-Length can't be present with Transfer-Encoding

[Killed] ConditionalExpression
lib/response.js:205:7
     chunk = ''
   }
 
-  if (req.method === 'HEAD') {
+  if (true) {
     // skip body for HEAD
     this.end();
killedBy: auth GET /login should render login form
statusReason: aborted

[Killed] ConditionalExpression
lib/response.js:205:7
     chunk = ''
   }
 
-  if (req.method === 'HEAD') {
+  if (false) {
     // skip body for HEAD
     this.end();
killedBy: mvc GET /users should display a list of users
statusReason: expected body '<!DOCTYPE html>\n' +
  '<html>\n' +
  '<head>\n' +
  '  <meta charset="utf-8">\n' +
  '  <meta name="viewport" content="width=device-width,initial-scale=1">\n' +
  '  <link rel="stylesheet" href="/style.css">\n' +
  '  <title>Users</title>\n' +
  '</head>\n' +

[Timeout] BlockStatement
lib/response.js:208:10
   if (req.method === 'HEAD') {
     // skip body for HEAD
     this.end();
-  } else {
-    // respond
-    this.end(chunk, encoding);
-  }
+  } else {}
 
   return this;

[Timeout] BlockStatement
lib/response.js:228:31
  * @public
  */
 
-res.json = function json(obj) {
-  // settings
-  var app = this.app;
-  var escape = app.get('json escape')
-  var replacer = app.get('json replacer');
-  var spaces = app.get('json spaces');
-  var body = stringify(obj, replacer, spaces, escape)
-
-  // content-type
-  if (!this.get('Content-Type')) {
-    this.set('Content-Type', 'application/json');
-  }
-
-  return this.send(body);
-};
+res.json = function json(obj) {};
 
 /**
