[Killed] ConditionalExpression
lib/response.js:237:7
   var body = stringify(obj, replacer, spaces, escape)
 
   // content-type
-  if (!this.get('Content-Type')) {
+  if (true) {
     this.set('Content-Type', 'application/json');
   }
killedBy: resource GET /users should respond with all users
statusReason: expected body '[{"name":"tj"},null,{"name":"aaron"},{"name":"guillermo"},{"name":"simon"},{"name":"tobi"}]' to match /^\[{"name":"tj"},{"name":"ciaran"},{"name":"aaron"},{"name":"guillermo"},{"name":"simon"},{"name":"tobi"}\]/

[Killed] BooleanLiteral
lib/response.js:237:7
   var body = stringify(obj, replacer, spaces, escape)
 
   // content-type
-  if (!this.get('Content-Type')) {
+  if (this.get('Content-Type')) {
     this.set('Content-Type', 'application/json');
   }
killedBy: resource GET /users should respond with all users
statusReason: expected body '[{"name":"tj"},null,{"name":"aaron"},{"name":"guillermo"},{"name":"simon"},{"name":"tobi"}]' to match /^\[{"name":"tj"},{"name":"ciaran"},{"name":"aaron"},{"name":"guillermo"},{"name":"simon"},{"name":"tobi"}\]/

[Killed] StringLiteral
lib/response.js:238:30
 
   // content-type
   if (!this.get('Content-Type')) {
-    this.set('Content-Type', 'application/json');
+    this.set('Content-Type', "");
   }
 
killedBy: resource GET /users should respond with all users
statusReason: expected body '[{"name":"tj"},null,{"name":"aaron"},{"name":"guillermo"},{"name":"simon"},{"name":"tobi"}]' to match /^\[{"name":"tj"},{"name":"ciaran"},{"name":"aaron"},{"name":"guillermo"},{"name":"simon"},{"name":"tobi"}\]/

[Killed] StringLiteral
lib/response.js:263:41
   var replacer = app.get('json replacer');
   var spaces = app.get('json spaces');
   var body = stringify(obj, replacer, spaces, escape)
-  var callback = this.req.query[app.get('jsonp callback name')];
+  var callback = this.req.query[app.get("")];
 
   // content-type
killedBy: res .jsonp(object) should respond with jsonp
statusReason: expected "Content-Type" of "text/javascript; charset=utf-8", got "application/json; charset=utf-8"

[Killed] ConditionalExpression
lib/response.js:266:7
   var callback = this.req.query[app.get('jsonp callback name')];
 
   // content-type
-  if (!this.get('Content-Type')) {
+  if (false) {
     this.set('X-Content-Type-Options', 'nosniff');
     this.set('Content-Type', 'application/json');
killedBy: res .jsonp(object) should ignore object callback parameter with jsonp
statusReason: expected "Content-Type" of "application/json; charset=utf-8", got "text/html; charset=utf-8"

[Killed] BlockStatement
lib/response.js:266:34
   var callback = this.req.query[app.get('jsonp callback name')];
 
   // content-type
-  if (!this.get('Content-Type')) {
-    this.set('X-Content-Type-Options', 'nosniff');
-    this.set('Content-Type', 'application/json');
-  }
+  if (!this.get('Content-Type')) {}
 
   // fixup callback
killedBy: res .jsonp(object) should ignore object callback parameter with jsonp
statusReason: expected "Content-Type" of "application/json; charset=utf-8", got "text/html; charset=utf-8"

[Killed] StringLiteral
lib/response.js:267:14
 
   // content-type
   if (!this.get('Content-Type')) {
-    this.set('X-Content-Type-Options', 'nosniff');
+    this.set("", 'nosniff');
     this.set('Content-Type', 'application/json');
   }
killedBy: res .jsonp(object) should respond with jsonp
statusReason: expected "Content-Type" of "text/javascript; charset=utf-8", got "text/html; charset=utf-8"

[Killed] StringLiteral
lib/response.js:268:30
   // content-type
   if (!this.get('Content-Type')) {
     this.set('X-Content-Type-Options', 'nosniff');
-    this.set('Content-Type', 'application/json');
+    this.set('Content-Type', "");
   }
 
killedBy: res .jsonp(object) should ignore object callback parameter with jsonp
statusReason: expected "Content-Type" of "application/json; charset=utf-8", got "text/html; charset=utf-8"

[Killed] BlockStatement
lib/response.js:272:32
   }
 
   // fixup callback
-  if (Array.isArray(callback)) {
-    callback = callback[0];
-  }
+  if (Array.isArray(callback)) {}
 
   // jsonp
killedBy: res .jsonp(object) should use first callback parameter with jsonp
statusReason: expected "Content-Type" of "text/javascript; charset=utf-8", got "application/json; charset=utf-8"

[Killed] ConditionalExpression
lib/response.js:272:7
   }
 
   // fixup callback
-  if (Array.isArray(callback)) {
+  if (false) {
     callback = callback[0];
   }
killedBy: res .jsonp(object) should use first callback parameter with jsonp
statusReason: expected "Content-Type" of "text/javascript; charset=utf-8", got "application/json; charset=utf-8"

[Killed] EqualityOperator
lib/response.js:277:39
   }
 
   // jsonp
-  if (typeof callback === 'string' && callback.length !== 0) {
+  if (typeof callback === 'string' && callback.length === 0) {
     this.set('X-Content-Type-Options', 'nosniff');
     this.set('Content-Type', 'text/javascript');
killedBy: res .jsonp(object) should respond with jsonp
statusReason: expected "Content-Type" of "text/javascript; charset=utf-8", got "application/json; charset=utf-8"

[Killed] BlockStatement
lib/response.js:277:62
   }
 
   // jsonp
-  if (typeof callback === 'string' && callback.length !== 0) {
-    this.set('X-Content-Type-Options', 'nosniff');
-    this.set('Content-Type', 'text/javascript');
-
-    // restrict callback charset
-    callback = callback.replace(/[^\[\]\w$.]/g, '');
-
-    if (body === undefined) {
-      // empty argument
-      body = ''
-    } else if (typeof body === 'string') {
-      // replace chars not allowed in JavaScript that are in JSON
-      body = body
-        .replace(/\u2028/g, '\\u2028')
-        .replace(/\u2029/g, '\\u2029')
-    }
-
-    // the /**/ is a specific security mitigation for "Rosetta Flash JSONP abuse"
-    // the typeof check is just to reduce client error noise
-    body = '/**/ typeof ' + callback + ' === \'function\' && ' + callback + '(' + body + ');';
-  }
+  if (typeof callback === 'string' && callback.length !== 0) {}
 
   return this.send(body);
killedBy: res .jsonp(object) should respond with jsonp
statusReason: expected "Content-Type" of "text/javascript; charset=utf-8", got "application/json; charset=utf-8"

[Killed] StringLiteral
lib/response.js:279:30
   // jsonp
   if (typeof callback === 'string' && callback.length !== 0) {
     this.set('X-Content-Type-Options', 'nosniff');
-    this.set('Content-Type', 'text/javascript');
+    this.set('Content-Type', "");
 
     // restrict callback charset
killedBy: res .jsonp(object) should respond with jsonp
statusReason: expected "Content-Type" of "text/javascript; charset=utf-8", got "text/html; charset=utf-8"

[Killed] Regex
lib/response.js:282:33
     this.set('Content-Type', 'text/javascript');
 
     // restrict callback charset
-    callback = callback.replace(/[^\[\]\w$.]/g, '');
+    callback = callback.replace(/[^\[\]\W$.]/g, '');
 
     if (body === undefined) {
killedBy: res .jsonp(object) should respond with jsonp
statusReason: expected body `/**/ typeof  === 'function' && ({"count":1});` to match /something\(\{"count":1\}\);/

[Killed] BlockStatement
lib/response.js:284:29
     // restrict callback charset
     callback = callback.replace(/[^\[\]\w$.]/g, '');
 
-    if (body === undefined) {
-      // empty argument
-      body = ''
-    } else if (typeof body === 'string') {
+    if (body === undefined) {} else if (typeof body === 'string') {
       // replace chars not allowed in JavaScript that are in JSON
       body = body
killedBy: res .jsonp(object) when given undefined should invoke callback with no arguments
statusReason: expected body "/**/ typeof cb === 'function' && cb(undefined);" to match /cb\(\)/

[Killed] EqualityOperator
lib/response.js:284:9
     // restrict callback charset
     callback = callback.replace(/[^\[\]\w$.]/g, '');
 
-    if (body === undefined) {
+    if (body !== undefined) {
       // empty argument
       body = ''
killedBy: res .jsonp(object) should respond with jsonp
statusReason: expected body "/**/ typeof something === 'function' && something();" to match /something\(\{"count":1\}\);/

[Killed] StringLiteral
lib/response.js:286:14
 
     if (body === undefined) {
       // empty argument
-      body = ''
+      body = "Stryker was here!"
     } else if (typeof body === 'string') {
       // replace chars not allowed in JavaScript that are in JSON
killedBy: res .jsonp(object) when given undefined should invoke callback with no arguments
statusReason: expected body "/**/ typeof cb === 'function' && cb(Stryker was here!);" to match /cb\(\)/

[Killed] EqualityOperator
lib/response.js:287:16
     if (body === undefined) {
       // empty argument
       body = ''
-    } else if (typeof body === 'string') {
+    } else if (typeof body !== 'string') {
       // replace chars not allowed in JavaScript that are in JSON
       body = body
killedBy: res .jsonp(object) should escape utf whitespace
statusReason: expected body `/**/ typeof foo === 'function' && foo({"str":"    woot"});` to match /foo\(\{"str":"\\u2028 \\u2029 woot"\}\);/

[Killed] ConditionalExpression
lib/response.js:287:16
     if (body === undefined) {
       // empty argument
       body = ''
-    } else if (typeof body === 'string') {
+    } else if (false) {
       // replace chars not allowed in JavaScript that are in JSON
       body = body
killedBy: res .jsonp(object) should escape utf whitespace
statusReason: expected body `/**/ typeof foo === 'function' && foo({"str":"    woot"});` to match /foo\(\{"str":"\\u2028 \\u2029 woot"\}\);/

[Killed] StringLiteral
lib/response.js:291:29
       // replace chars not allowed in JavaScript that are in JSON
       body = body
         .replace(/\u2028/g, '\\u2028')
-        .replace(/\u2029/g, '\\u2029')
+        .replace(/\u2029/g, "")
     }
 
killedBy: res .jsonp(object) should escape utf whitespace
statusReason: expected body `/**/ typeof foo === 'function' && foo({"str":"\\u2028  woot"});` to match /foo\(\{"str":"\\u2028 \\u2029 woot"\}\);/

[Killed] StringLiteral
lib/response.js:296:77
 
     // the /**/ is a specific security mitigation for "Rosetta Flash JSONP abuse"
     // the typeof check is just to reduce client error noise
-    body = '/**/ typeof ' + callback + ' === \'function\' && ' + callback + '(' + body + ');';
+    body = '/**/ typeof ' + callback + ' === \'function\' && ' + callback + "" + body + ');';
   }
 
killedBy: res .jsonp(object) should respond with jsonp
statusReason: expected body `/**/ typeof something === 'function' && something{"count":1});` to match /something\(\{"count":1\}\);/

[Timeout] BlockStatement
lib/response.js:317:50
  * @public
  */
 
-res.sendStatus = function sendStatus(statusCode) {
-  var body = statuses.message[statusCode] || String(statusCode)
-
-  this.status(statusCode);
-  this.type('txt');
-
-  return this.send(body);
-};
+res.sendStatus = function sendStatus(statusCode) {};
 
 /**

[Killed] ConditionalExpression
lib/response.js:318:14
  */
 
 res.sendStatus = function sendStatus(statusCode) {
-  var body = statuses.message[statusCode] || String(statusCode)
+  var body = true
 
   this.status(statusCode);
killedBy: express.static() basic operations should not choke on auth-looking URL
statusReason: expected 'Not Found' response body, got 'true'

[Killed] ConditionalExpression
lib/response.js:318:14
  */
 
 res.sendStatus = function sendStatus(statusCode) {
-  var body = statuses.message[statusCode] || String(statusCode)
+  var body = false
 
   this.status(statusCode);
killedBy: express.static() basic operations should not choke on auth-looking URL
statusReason: expected 'Not Found' response body, got 'false'

[Killed] StringLiteral
lib/response.js:321:13
   var body = statuses.message[statusCode] || String(statusCode)
 
   this.status(statusCode);
-  this.type('txt');
+  this.type("");
 
   return this.send(body);
killedBy: express.static() basic operations should not choke on auth-looking URL
statusReason: expected 'Not Found' response body, got undefined

[Killed] LogicalOperator
lib/response.js:372:14
   var req = this.req;
   var res = this;
   var next = req.next;
-  var opts = options || {};
+  var opts = options && {};
 
   if (!path) {
killedBy: downloads GET /files/notes/groceries.txt should have a download header
statusReason: expected "Content-Disposition" header field

[Killed] ConditionalExpression
lib/response.js:372:14
   var req = this.req;
   var res = this;
   var next = req.next;
-  var opts = options || {};
+  var opts = true;
 
   if (!path) {
killedBy: downloads GET /files/notes/groceries.txt should have a download header
statusReason: expected "Content-Disposition" header field

[Killed] BooleanLiteral
lib/response.js:374:7
   var next = req.next;
   var opts = options || {};
 
-  if (!path) {
+  if (path) {
     throw new TypeError('path argument is required to res.sendFile');
   }
killedBy: downloads GET /files/notes/groceries.txt should have a download header
statusReason: expected "Content-Disposition" header field

[Killed] ConditionalExpression
lib/response.js:374:7
   var next = req.next;
   var opts = options || {};
 
-  if (!path) {
+  if (true) {
     throw new TypeError('path argument is required to res.sendFile');
   }
killedBy: downloads GET /files/notes/groceries.txt should have a download header
statusReason: expected "Content-Disposition" header field

[Killed] ConditionalExpression
lib/response.js:378:7
     throw new TypeError('path argument is required to res.sendFile');
   }
 
-  if (typeof path !== 'string') {
+  if (true) {
     throw new TypeError('path must be a string to res.sendFile')
   }
killedBy: downloads GET /files/notes/groceries.txt should have a download header
statusReason: expected "Content-Disposition" header field

[Killed] EqualityOperator
lib/response.js:378:7
     throw new TypeError('path argument is required to res.sendFile');
   }
 
-  if (typeof path !== 'string') {
+  if (typeof path === 'string') {
     throw new TypeError('path must be a string to res.sendFile')
   }
killedBy: downloads GET /files/notes/groceries.txt should have a download header
statusReason: expected "Content-Disposition" header field

[Killed] ConditionalExpression
lib/response.js:383:7
   }
 
   // support function as second arg
-  if (typeof options === 'function') {
+  if (true) {
     done = options;
     opts = {};
killedBy: downloads GET /files/notes/groceries.txt should have a download header
statusReason: expected "Content-Disposition" header field

[Killed] EqualityOperator
lib/response.js:383:7
   }
 
   // support function as second arg
-  if (typeof options === 'function') {
+  if (typeof options !== 'function') {
     done = options;
     opts = {};
killedBy: downloads GET /files/notes/groceries.txt should have a download header
statusReason: expected "Content-Disposition" header field

[Killed] LogicalOperator
lib/response.js:388:7
     opts = {};
   }
 
-  if (!opts.root && !pathIsAbsolute(path)) {
+  if (!opts.root || !pathIsAbsolute(path)) {
     throw new TypeError('path must be absolute or specify root to res.sendFile');
   }
killedBy: downloads GET /files/notes/groceries.txt should have a download header
statusReason: expected "Content-Disposition" header field

[Killed] ConditionalExpression
lib/response.js:388:7
     opts = {};
   }
 
-  if (!opts.root && !pathIsAbsolute(path)) {
+  if (true) {
     throw new TypeError('path must be absolute or specify root to res.sendFile');
   }
killedBy: downloads GET /files/notes/groceries.txt should have a download header
statusReason: expected "Content-Disposition" header field

[NoCoverage] StringLiteral
lib/response.js:389:25
   }
 
   if (!opts.root && !pathIsAbsolute(path)) {
-    throw new TypeError('path must be absolute or specify root to res.sendFile');
+    throw new TypeError("");
   }
 

[Timeout] BlockStatement
lib/response.js:397:44
   var file = send(req, pathname, opts);
 
   // transfer
-  sendfile(res, file, opts, function (err) {
-    if (done) return done(err);
-    if (err && err.code === 'EISDIR') return next();
-
-    // next() all but write errors
-    if (err && err.code !== 'ECONNABORTED' && err.syscall !== 'write') {
-      next(err);
-    }
-  });
+  sendfile(res, file, opts, function (err) {});
 };
 

[Survived] ConditionalExpression
lib/response.js:398:9
 
   // transfer
   sendfile(res, file, opts, function (err) {
-    if (done) return done(err);
+    if (false) return done(err);
     if (err && err.code === 'EISDIR') return next();
 

[Survived] ConditionalExpression
lib/response.js:398:9
 
   // transfer
   sendfile(res, file, opts, function (err) {
-    if (done) return done(err);
+    if (true) return done(err);
     if (err && err.code === 'EISDIR') return next();
 

[NoCoverage] ConditionalExpression
lib/response.js:399:9
   // transfer
   sendfile(res, file, opts, function (err) {
     if (done) return done(err);
-    if (err && err.code === 'EISDIR') return next();
+    if (false) return next();
 
     // next() all but write errors

[NoCoverage] LogicalOperator
lib/response.js:399:9
   // transfer
   sendfile(res, file, opts, function (err) {
     if (done) return done(err);
-    if (err && err.code === 'EISDIR') return next();
+    if (err || err.code === 'EISDIR') return next();
 
     // next() all but write errors

[NoCoverage] LogicalOperator
lib/response.js:402:9
     if (err && err.code === 'EISDIR') return next();
 
     // next() all but write errors
-    if (err && err.code !== 'ECONNABORTED' && err.syscall !== 'write') {
+    if (err && err.code !== 'ECONNABORTED' || err.syscall !== 'write') {
       next(err);
     }

[NoCoverage] ConditionalExpression
lib/response.js:402:47
     if (err && err.code === 'EISDIR') return next();
 
     // next() all but write errors
-    if (err && err.code !== 'ECONNABORTED' && err.syscall !== 'write') {
+    if (err && err.code !== 'ECONNABORTED' && true) {
       next(err);
     }

[Survived] ConditionalExpression
lib/response.js:429:14
 res.download = function download (path, filename, options, callback) {
   var done = callback;
   var name = filename;
-  var opts = options || null
+  var opts = true
 
   // support function as second or third arg

[Survived] LogicalOperator
lib/response.js:429:14
 res.download = function download (path, filename, options, callback) {
   var done = callback;
   var name = filename;
-  var opts = options || null
+  var opts = options && null
 
   // support function as second or third arg

[Killed] ConditionalExpression
lib/response.js:432:7
   var opts = options || null
 
   // support function as second or third arg
-  if (typeof filename === 'function') {
+  if (true) {
     done = filename;
     name = null;
killedBy: downloads GET /files/notes/groceries.txt should have a download header; downloads GET /files/notes/groceries.txt should have a download header
statusReason: done is not a function

[Killed] EqualityOperator
lib/response.js:432:7
   var opts = options || null
 
   // support function as second or third arg
-  if (typeof filename === 'function') {
+  if (typeof filename !== 'function') {
     done = filename;
     name = null;
killedBy: downloads GET /files/notes/groceries.txt should have a download header; downloads GET /files/notes/groceries.txt should have a download header
statusReason: done is not a function

[Survived] ConditionalExpression
lib/response.js:436:14
     done = filename;
     name = null;
     opts = null
-  } else if (typeof options === 'function') {
+  } else if (true) {
     done = options
     opts = null

[Survived] ConditionalExpression
lib/response.js:436:14
     done = filename;
     name = null;
     opts = null
-  } else if (typeof options === 'function') {
+  } else if (false) {
     done = options
     opts = null

[Killed] EqualityOperator
lib/response.js:442:7
   }
 
   // support optional filename, where options may be in it's place
-  if (typeof filename === 'object' &&
+  if (typeof filename !== 'object' &&
     (typeof options === 'function' || options === undefined)) {
     name = null
killedBy: downloads GET /files/notes/groceries.txt should have a download header
statusReason: expected "Content-Disposition" header field

[Killed] ConditionalExpression
lib/response.js:442:7
   }
 
   // support optional filename, where options may be in it's place
-  if (typeof filename === 'object' &&
-    (typeof options === 'function' || options === undefined)) {
+  if (false) {
     name = null
     opts = filename
killedBy: downloads GET /files/notes/groceries.txt should have a download header
statusReason: expected "Content-Disposition" header field

[Killed] LogicalOperator
lib/response.js:443:6
 
   // support optional filename, where options may be in it's place
   if (typeof filename === 'object' &&
-    (typeof options === 'function' || options === undefined)) {
+    (typeof options === 'function' && options === undefined)) {
     name = null
     opts = filename
killedBy: downloads GET /files/notes/groceries.txt should have a download header
statusReason: expected "Content-Disposition" header field

[Killed] EqualityOperator
lib/response.js:443:6
 
   // support optional filename, where options may be in it's place
   if (typeof filename === 'object' &&
-    (typeof options === 'function' || options === undefined)) {
+    (typeof options !== 'function' || options === undefined)) {
     name = null
     opts = filename
killedBy: downloads GET /files/notes/groceries.txt should have a download header
statusReason: expected "Content-Disposition" header field

[Killed] ObjectLiteral
lib/response.js:449:17
   }
 
   // set Content-Disposition when file is sent
-  var headers = {
-    'Content-Disposition': contentDisposition(name || path)
-  };
+  var headers = {};
 
   // merge user-provided headers
killedBy: downloads GET /files/notes/groceries.txt should have a download header
statusReason: expected "Content-Disposition" header field

[Killed] LogicalOperator
lib/response.js:450:47
 
   // set Content-Disposition when file is sent
   var headers = {
-    'Content-Disposition': contentDisposition(name || path)
+    'Content-Disposition': contentDisposition(name && path)
   };
 
killedBy: downloads GET /files/notes/groceries.txt should have a download header
statusReason: expected "Content-Disposition" header field

[Killed] ConditionalExpression
lib/response.js:450:47
 
   // set Content-Disposition when file is sent
   var headers = {
-    'Content-Disposition': contentDisposition(name || path)
+    'Content-Disposition': contentDisposition(false)
   };
 
killedBy: downloads GET /files/notes/groceries.txt should have a download header
statusReason: expected "Content-Disposition" header field

[Killed] LogicalOperator
lib/response.js:454:7
   };
 
   // merge user-provided headers
-  if (opts && opts.headers) {
+  if (opts || opts.headers) {
     var keys = Object.keys(opts.headers)
     for (var i = 0; i < keys.length; i++) {
killedBy: downloads GET /files/notes/groceries.txt should have a download header
statusReason: expected "Content-Disposition" header field

[Killed] ConditionalExpression
lib/response.js:454:7
   };
 
   // merge user-provided headers
-  if (opts && opts.headers) {
+  if (true) {
     var keys = Object.keys(opts.headers)
     for (var i = 0; i < keys.length; i++) {
killedBy: downloads GET /files/notes/groceries.txt should have a download header
statusReason: expected "Content-Disposition" header field

[NoCoverage] EqualityOperator
lib/response.js:456:21
   // merge user-provided headers
   if (opts && opts.headers) {
     var keys = Object.keys(opts.headers)
-    for (var i = 0; i < keys.length; i++) {
+    for (var i = 0; i >= keys.length; i++) {
       var key = keys[i]
       if (key.toLowerCase() !== 'content-disposition') {

[NoCoverage] BlockStatement
lib/response.js:456:43
   // merge user-provided headers
   if (opts && opts.headers) {
     var keys = Object.keys(opts.headers)
-    for (var i = 0; i < keys.length; i++) {
-      var key = keys[i]
-      if (key.toLowerCase() !== 'content-disposition') {
-        headers[key] = opts.headers[key]
-      }
-    }
+    for (var i = 0; i < keys.length; i++) {}
   }
 

[NoCoverage] MethodExpression
lib/response.js:458:11
     var keys = Object.keys(opts.headers)
     for (var i = 0; i < keys.length; i++) {
       var key = keys[i]
-      if (key.toLowerCase() !== 'content-disposition') {
+      if (key.toUpperCase() !== 'content-disposition') {
         headers[key] = opts.headers[key]
       }

[NoCoverage] EqualityOperator
lib/response.js:458:11
     var keys = Object.keys(opts.headers)
     for (var i = 0; i < keys.length; i++) {
       var key = keys[i]
-      if (key.toLowerCase() !== 'content-disposition') {
+      if (key.toLowerCase() === 'content-disposition') {
         headers[key] = opts.headers[key]
       }

[Killed] BooleanLiteral
lib/response.js:469:18
   opts.headers = headers
 
   // Resolve the full path for sendFile
-  var fullPath = !opts.root
+  var fullPath = opts.root
     ? resolve(path)
     : path
killedBy: downloads GET /files/notes/groceries.txt should have a download header
statusReason: expected "Content-Disposition" header field

[Killed] BlockStatement
lib/response.js:497:39
  */
 
 res.contentType =
-res.type = function contentType(type) {
-  var ct = type.indexOf('/') === -1
-    ? (mime.contentType(type) || 'application/octet-stream')
-    : type;
-
-  return this.set('Content-Type', ct);
-};
+res.type = function contentType(type) {};
 
 /**
killedBy: ejs GET / should respond with html
statusReason: expected "Content-Type" header field

[Timeout] ConditionalExpression
lib/response.js:498:12
 
 res.contentType =
 res.type = function contentType(type) {
-  var ct = type.indexOf('/') === -1
+  var ct = false
     ? (mime.contentType(type) || 'application/octet-stream')
     : type;

[Timeout] UnaryOperator
lib/response.js:498:34
 
 res.contentType =
 res.type = function contentType(type) {
-  var ct = type.indexOf('/') === -1
+  var ct = type.indexOf('/') === +1
     ? (mime.contentType(type) || 'application/octet-stream')
     : type;

[Killed] LogicalOperator
lib/response.js:499:8
 res.contentType =
 res.type = function contentType(type) {
   var ct = type.indexOf('/') === -1
-    ? (mime.contentType(type) || 'application/octet-stream')
+    ? (mime.contentType(type) && 'application/octet-stream')
     : type;
 
killedBy: auth GET /login should render login form
statusReason: expected body undefined to match /<form/

[Killed] ConditionalExpression
lib/response.js:499:8
 res.contentType =
 res.type = function contentType(type) {
   var ct = type.indexOf('/') === -1
-    ? (mime.contentType(type) || 'application/octet-stream')
+    ? (false)
     : type;
 
killedBy: ejs GET / should respond with html
statusReason: expected "Content-Type" of "text/html; charset=utf-8", got "false"

[Survived] MethodExpression
lib/response.js:566:14
   var req = this.req;
   var next = req.next;
 
-  var keys = Object.keys(obj)
-    .filter(function (v) { return v !== 'default' })
+  var keys = Object.keys(obj)
 
   var key = keys.length > 0

[Killed] BlockStatement
lib/response.js:567:26
   var next = req.next;
 
   var keys = Object.keys(obj)
-    .filter(function (v) { return v !== 'default' })
+    .filter(function (v) {})
 
   var key = keys.length > 0
killedBy: content-negotiation GET / should default to text/html
statusReason: expected 200 "OK", got 406 "Not Acceptable"

[Killed] ConditionalExpression
lib/response.js:567:35
   var next = req.next;
 
   var keys = Object.keys(obj)
-    .filter(function (v) { return v !== 'default' })
+    .filter(function (v) { return false })
 
   var key = keys.length > 0
killedBy: content-negotiation GET / should default to text/html
statusReason: expected 200 "OK", got 406 "Not Acceptable"

[Killed] ConditionalExpression
lib/response.js:569:13
   var keys = Object.keys(obj)
     .filter(function (v) { return v !== 'default' })
 
-  var key = keys.length > 0
+  var key = false
     ? req.accepts(keys)
     : false;
killedBy: content-negotiation GET / should default to text/html
statusReason: expected 200 "OK", got 406 "Not Acceptable"

[Killed] EqualityOperator
lib/response.js:569:13
   var keys = Object.keys(obj)
     .filter(function (v) { return v !== 'default' })
 
-  var key = keys.length > 0
+  var key = keys.length >= 0
     ? req.accepts(keys)
     : false;
killedBy: res .format(obj) given .default should work when only .default is provided
statusReason: expected 'hey' response body, got '<!DOCTYPE html>\n' +
  '<html lang="en">\n' +
  '<head>\n' +
  '<meta charset="utf-8">\n' +
  '<title>Error</title>\n' +
  '</head>\n' +
  '<body>\n' +

[Killed] BooleanLiteral
lib/response.js:571:7
 
   var key = keys.length > 0
     ? req.accepts(keys)
-    : false;
+    : true;
 
   this.vary("Accept");
killedBy: res .format(obj) given .default should work when only .default is provided
statusReason: expected 'hey' response body, got '<!DOCTYPE html>\n' +
  '<html lang="en">\n' +
  '<head>\n' +
  '<meta charset="utf-8">\n' +
  '<title>Error</title>\n' +
  '</head>\n' +
  '<body>\n' +

[Killed] BlockStatement
lib/response.js:575:12
 
   this.vary("Accept");
 
-  if (key) {
-    this.set('Content-Type', normalizeType(key).value);
-    obj[key](req, this, next);
-  } else if (obj.default) {
+  if (key) {} else if (obj.default) {
     obj.default(req, this, next)
   } else {
killedBy: auth GET / should redirect to /login
statusReason: expected 302 "Found", got 500 "Internal Server Error"

[Killed] ConditionalExpression
lib/response.js:575:7
 
   this.vary("Accept");
 
-  if (key) {
+  if (true) {
     this.set('Content-Type', normalizeType(key).value);
     obj[key](req, this, next);
killedBy: error-pages Accept: text/plain GET /404 should respond with 404
statusReason: expected 404 "Not Found", got 500 "Internal Server Error"
