[Killed] ConditionalExpression
lib/response.js:578:14
   if (key) {
     this.set('Content-Type', normalizeType(key).value);
     obj[key](req, this, next);
-  } else if (obj.default) {
+  } else if (true) {
     obj.default(req, this, next)
   } else {
killedBy: res .format(obj) with canonicalized mime types when no match is made should should respond with 406 not acceptable
statusReason: expected 'Supports: text/plain, text/html, application/json' response body, got '<!DOCTYPE html>\n' +
  '<html lang="en">\n' +
  '<head>\n' +
  '<meta charset="utf-8">\n' +
  '<title>Error</title>\n' +
  '</head>\n' +
  '<body>\n' +

[Killed] ConditionalExpression
lib/response.js:578:14
   if (key) {
     this.set('Content-Type', normalizeType(key).value);
     obj[key](req, this, next);
-  } else if (obj.default) {
+  } else if (false) {
     obj.default(req, this, next)
   } else {
killedBy: error-pages Accept: text/plain GET /404 should respond with 404
statusReason: expected 404 "Not Found", got 406 "Not Acceptable"

[Timeout] BlockStatement
lib/response.js:580:10
     obj[key](req, this, next);
   } else if (obj.default) {
     obj.default(req, this, next)
-  } else {
-    next(createError(406, {
-      types: normalizeTypes(keys).map(function (o) { return o.value })
-    }))
-  }
+  } else {}
 
   return this;

[Killed] ObjectLiteral
lib/response.js:581:27
   } else if (obj.default) {
     obj.default(req, this, next)
   } else {
-    next(createError(406, {
-      types: normalizeTypes(keys).map(function (o) { return o.value })
-    }))
+    next(createError(406, {}))
   }
 
killedBy: res .format(obj) with canonicalized mime types when no match is made should should respond with 406 not acceptable
statusReason: expected 'Supports: text/plain, text/html, application/json' response body, got '<!DOCTYPE html>\n' +
  '<html lang="en">\n' +
  '<head>\n' +
  '<meta charset="utf-8">\n' +
  '<title>Error</title>\n' +
  '</head>\n' +
  '<body>\n' +

[Killed] BlockStatement
lib/response.js:582:52
     obj.default(req, this, next)
   } else {
     next(createError(406, {
-      types: normalizeTypes(keys).map(function (o) { return o.value })
+      types: normalizeTypes(keys).map(function (o) {})
     }))
   }
killedBy: res .format(obj) with canonicalized mime types when no match is made should should respond with 406 not acceptable
statusReason: expected 'Supports: text/plain, text/html, application/json' response body, got 'Supports: , , '

[Killed] BlockStatement
lib/response.js:597:48
  * @public
  */
 
-res.attachment = function attachment(filename) {
-  if (filename) {
-    this.type(extname(filename));
-  }
-
-  this.set('Content-Disposition', contentDisposition(filename));
-
-  return this;
-};
+res.attachment = function attachment(filename) {};
 
 /**
killedBy: res .attachment() should Content-Disposition to attachment
statusReason: expected "Content-Disposition" header field

[Killed] ConditionalExpression
lib/response.js:598:7
  */
 
 res.attachment = function attachment(filename) {
-  if (filename) {
+  if (true) {
     this.type(extname(filename));
   }
killedBy: res .attachment() should Content-Disposition to attachment
statusReason: expected "Content-Disposition" header field

[Killed] ConditionalExpression
lib/response.js:598:7
  */
 
 res.attachment = function attachment(filename) {
-  if (filename) {
+  if (false) {
     this.type(extname(filename));
   }
killedBy: res .attachment(filename) should set the Content-Type
statusReason: expected "Content-Type" of "image/png", got "application/octet-stream"

[Killed] BlockStatement
lib/response.js:622:42
  * @public
  */
 
-res.append = function append(field, val) {
-  var prev = this.get(field);
-  var value = val;
-
-  if (prev) {
-    // concat the new and prev vals
-    value = Array.isArray(prev) ? prev.concat(val)
-      : Array.isArray(val) ? [prev].concat(val)
-        : [prev, val]
-  }
-
-  return this.set(field, value);
-};
+res.append = function append(field, val) {};
 
 /**
killedBy: cookies GET / should respond to cookie
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
lib/response.js:626:7
   var prev = this.get(field);
   var value = val;
 
-  if (prev) {
+  if (true) {
     // concat the new and prev vals
     value = Array.isArray(prev) ? prev.concat(val)
killedBy: cookies GET / should respond to cookie
statusReason: expected body '<form method="post"><p>Check to <label><input type="checkbox" name="remember"/> remember me</label> <input type="submit" value="Submit"/>.</p></form>' to match /Remembered/

[Killed] BlockStatement
lib/response.js:626:13
   var prev = this.get(field);
   var value = val;
 
-  if (prev) {
-    // concat the new and prev vals
-    value = Array.isArray(prev) ? prev.concat(val)
-      : Array.isArray(val) ? [prev].concat(val)
-        : [prev, val]
-  }
+  if (prev) {}
 
   return this.set(field, value);
killedBy: res .append(field, val) should append multiple headers
statusReason: should have 2 occurances of "Set-Cookie"

[Killed] BlockStatement
lib/response.js:658:42
  */
 
 res.set =
-res.header = function header(field, val) {
-  if (arguments.length === 2) {
-    var value = Array.isArray(val)
-      ? val.map(String)
-      : String(val);
-
-    // add charset to content-type
-    if (field.toLowerCase() === 'content-type') {
-      if (Array.isArray(value)) {
-        throw new TypeError('Content-Type cannot be set to an Array');
-      }
-      value = mime.contentType(value)
-    }
-
-    this.setHeader(field, value);
-  } else {
-    for (var key in field) {
-      this.set(key, field[key]);
-    }
-  }
-  return this;
-};
+res.header = function header(field, val) {};
 
 /**
killedBy: auth GET / should redirect to /login
statusReason: expected "Location" header field

[Killed] ConditionalExpression
lib/response.js:659:7
 
 res.set =
 res.header = function header(field, val) {
-  if (arguments.length === 2) {
+  if (false) {
     var value = Array.isArray(val)
       ? val.map(String)
killedBy: auth GET / should redirect to /login
statusReason: expected "Location" header field

[Killed] EqualityOperator
lib/response.js:659:7
 
 res.set =
 res.header = function header(field, val) {
-  if (arguments.length === 2) {
+  if (arguments.length !== 2) {
     var value = Array.isArray(val)
       ? val.map(String)
killedBy: auth GET / should redirect to /login
statusReason: expected "Location" header field

[Killed] EqualityOperator
lib/response.js:665:9
       : String(val);
 
     // add charset to content-type
-    if (field.toLowerCase() === 'content-type') {
+    if (field.toLowerCase() !== 'content-type') {
       if (Array.isArray(value)) {
         throw new TypeError('Content-Type cannot be set to an Array');
killedBy: auth GET / should redirect to /login
statusReason: Parse Error: Invalid character in Content-Length

[Killed] ConditionalExpression
lib/response.js:665:9
       : String(val);
 
     // add charset to content-type
-    if (field.toLowerCase() === 'content-type') {
+    if (true) {
       if (Array.isArray(value)) {
         throw new TypeError('Content-Type cannot be set to an Array');
killedBy: auth GET / should redirect to /login
statusReason: Parse Error: Invalid character in Content-Length

[Killed] BlockStatement
lib/response.js:666:33
 
     // add charset to content-type
     if (field.toLowerCase() === 'content-type') {
-      if (Array.isArray(value)) {
-        throw new TypeError('Content-Type cannot be set to an Array');
-      }
+      if (Array.isArray(value)) {}
       value = mime.contentType(value)
     }
killedBy: res .set(field, values) should throw when Content-Type is an array
statusReason: expected 500 "Internal Server Error", got 200 "OK"

[Killed] ConditionalExpression
lib/response.js:666:11
 
     // add charset to content-type
     if (field.toLowerCase() === 'content-type') {
-      if (Array.isArray(value)) {
+      if (true) {
         throw new TypeError('Content-Type cannot be set to an Array');
       }
killedBy: auth GET / should redirect to /login
statusReason: expected 302 "Found", got 500 "Internal Server Error"

[Killed] BlockStatement
lib/response.js:673:10
     }
 
     this.setHeader(field, value);
-  } else {
-    for (var key in field) {
-      this.set(key, field[key]);
-    }
-  }
+  } else {}
   return this;
 };
killedBy: res .set(object) should set multiple fields
statusReason: expected "X-Foo" header field

[Killed] BlockStatement
lib/response.js:674:28
 
     this.setHeader(field, value);
   } else {
-    for (var key in field) {
-      this.set(key, field[key]);
-    }
+    for (var key in field) {}
   }
   return this;
killedBy: res .set(object) should set multiple fields
statusReason: expected "X-Foo" header field

[Killed] BlockStatement
lib/response.js:689:26
  * @public
  */
 
-res.get = function(field){
-  return this.getHeader(field);
-};
+res.get = function(field){};
 
 /**
killedBy: error-pages Accept: application/json GET /404 should respond with 404
statusReason: expected { error: 'Not found' } response body, got {}

[Killed] BlockStatement
lib/response.js:702:55
  * @public
  */
 
-res.clearCookie = function clearCookie(name, options) {
-  // Force cookie expiration by setting expires to the past
-  const opts = { path: '/', ...options, expires: new Date(1)};
-  // ensure maxAge is not passed
-  delete opts.maxAge
-
-  return this.cookie(name, '', opts);
-};
+res.clearCookie = function clearCookie(name, options) {};
 
 /**
killedBy: cookies GET /forget should clear cookie
statusReason: expected "Set-Cookie" header field

[Killed] ConditionalExpression
lib/response.js:740:7
   var secret = this.req.secret;
   var signed = opts.signed;
 
-  if (signed && !secret) {
+  if (false) {
     throw new Error('cookieParser("secret") required for signed cookies');
   }
killedBy: res .cookie(name, string, options) signed without secret should throw an error
statusReason: expected body '<!DOCTYPE html>\n' +
  '<html lang="en">\n' +
  '<head>\n' +
  '<meta charset="utf-8">\n' +
  '<title>Error</title>\n' +
  '</head>\n' +
  '<body>\n' +

[Killed] ConditionalExpression
lib/response.js:740:7
   var secret = this.req.secret;
   var signed = opts.signed;
 
-  if (signed && !secret) {
+  if (true) {
     throw new Error('cookieParser("secret") required for signed cookies');
   }
killedBy: cookies GET / should respond to cookie
statusReason: expected 302 "Found", got 500 "Internal Server Error"

[Killed] StringLiteral
lib/response.js:741:21
   var signed = opts.signed;
 
   if (signed && !secret) {
-    throw new Error('cookieParser("secret") required for signed cookies');
+    throw new Error("");
   }
 
killedBy: res .cookie(name, string, options) signed without secret should throw an error
statusReason: expected body '<!DOCTYPE html>\n' +
  '<html lang="en">\n' +
  '<head>\n' +
  '<meta charset="utf-8">\n' +
  '<title>Error</title>\n' +
  '</head>\n' +
  '<body>\n' +

[Killed] ConditionalExpression
lib/response.js:744:13
     throw new Error('cookieParser("secret") required for signed cookies');
   }
 
-  var val = typeof value === 'object'
+  var val = false
     ? 'j:' + JSON.stringify(value)
     : String(value);
killedBy: req .signedCookies should return a signed JSON cookie
statusReason: expected { obj: { foo: 'bar' } } response body, got { obj: '[object Object]' }

[Killed] ConditionalExpression
lib/response.js:744:13
     throw new Error('cookieParser("secret") required for signed cookies');
   }
 
-  var val = typeof value === 'object'
+  var val = true
     ? 'j:' + JSON.stringify(value)
     : String(value);
killedBy: cookies GET /forget should clear cookie
statusReason: expected "Set-Cookie" matching /remember=;/, got "remember=j%3A%22%22; Path=/; Expires=Thu, 01 Jan 1970 00:00:00 GMT"

[Killed] BlockStatement
lib/response.js:748:15
     ? 'j:' + JSON.stringify(value)
     : String(value);
 
-  if (signed) {
-    val = 's:' + sign(val, secret);
-  }
+  if (signed) {}
 
   if (opts.maxAge != null) {
killedBy: req .signedCookies should return a signed JSON cookie
statusReason: expected { obj: { foo: 'bar' } } response body, got {}

[Killed] ConditionalExpression
lib/response.js:748:7
     ? 'j:' + JSON.stringify(value)
     : String(value);
 
-  if (signed) {
+  if (false) {
     val = 's:' + sign(val, secret);
   }
killedBy: req .signedCookies should return a signed JSON cookie
statusReason: expected { obj: { foo: 'bar' } } response body, got {}

[Killed] EqualityOperator
lib/response.js:752:7
     val = 's:' + sign(val, secret);
   }
 
-  if (opts.maxAge != null) {
+  if (opts.maxAge == null) {
     var maxAge = opts.maxAge - 0
 
killedBy: res .cookie(name, string, options) maxAge should set relative expires
statusReason: expected "Set-Cookie" matching /name=tobi; Max-Age=1; Path=\/; Expires=/, got "name=tobi; Max-Age=1000; Path=/"

[Killed] ConditionalExpression
lib/response.js:752:7
     val = 's:' + sign(val, secret);
   }
 
-  if (opts.maxAge != null) {
+  if (true) {
     var maxAge = opts.maxAge - 0
 
killedBy: res .cookie(name, string, options) maxAge should not throw on null
statusReason: expected "Set-Cookie" of "name=tobi; Path=/", got "name=tobi; Max-Age=0; Path=/; Expires=Mon, 21 Oct 2024 20:35:29 GMT"

[Survived] ArithmeticOperator
lib/response.js:753:18
   }
 
   if (opts.maxAge != null) {
-    var maxAge = opts.maxAge - 0
+    var maxAge = opts.maxAge + 0
 
     if (!isNaN(maxAge)) {

[Killed] BooleanLiteral
lib/response.js:755:9
   if (opts.maxAge != null) {
     var maxAge = opts.maxAge - 0
 
-    if (!isNaN(maxAge)) {
+    if (isNaN(maxAge)) {
       opts.expires = new Date(Date.now() + maxAge)
       opts.maxAge = Math.floor(maxAge / 1000)
killedBy: res .cookie(name, string, options) maxAge should set relative expires
statusReason: expected "Set-Cookie" matching /name=tobi; Max-Age=1; Path=\/; Expires=/, got "name=tobi; Max-Age=1000; Path=/"

[Killed] BlockStatement
lib/response.js:755:25
   if (opts.maxAge != null) {
     var maxAge = opts.maxAge - 0
 
-    if (!isNaN(maxAge)) {
-      opts.expires = new Date(Date.now() + maxAge)
-      opts.maxAge = Math.floor(maxAge / 1000)
-    }
+    if (!isNaN(maxAge)) {}
   }
 
killedBy: res .cookie(name, string, options) maxAge should set relative expires
statusReason: expected "Set-Cookie" matching /name=tobi; Max-Age=1; Path=\/; Expires=/, got "name=tobi; Max-Age=1000; Path=/"

[Survived] ArithmeticOperator
lib/response.js:756:31
     var maxAge = opts.maxAge - 0
 
     if (!isNaN(maxAge)) {
-      opts.expires = new Date(Date.now() + maxAge)
+      opts.expires = new Date(Date.now() - maxAge)
       opts.maxAge = Math.floor(maxAge / 1000)
     }

[Killed] ArithmeticOperator
lib/response.js:757:32
 
     if (!isNaN(maxAge)) {
       opts.expires = new Date(Date.now() + maxAge)
-      opts.maxAge = Math.floor(maxAge / 1000)
+      opts.maxAge = Math.floor(maxAge * 1000)
     }
   }
killedBy: res .cookie(name, string, options) maxAge should set relative expires
statusReason: expected "Set-Cookie" matching /name=tobi; Max-Age=1; Path=\/; Expires=/, got "name=tobi; Max-Age=1000000; Path=/; Expires=Mon, 21 Oct 2024 20:35:32 GMT"

[Killed] ConditionalExpression
lib/response.js:761:7
     }
   }
 
-  if (opts.path == null) {
+  if (true) {
     opts.path = '/';
   }
killedBy: res .clearCookie(name, options) should set the given params
statusReason: expected "Set-Cookie" of "sid=; Path=/admin; Expires=Thu, 01 Jan 1970 00:00:00 GMT", got "sid=; Path=/; Expires=Thu, 01 Jan 1970 00:00:00 GMT"

[Killed] BlockStatement
lib/response.js:761:26
     }
   }
 
-  if (opts.path == null) {
-    opts.path = '/';
-  }
+  if (opts.path == null) {}
 
   this.append('Set-Cookie', cookie.serialize(name, String(val), opts));
killedBy: res .append(field, val) should work together with res.cookie
statusReason: Expected values to be strictly equal:
+ actual - expected

+ 'foo=bar'
- 'foo=bar; Path=/'
          ^

[Killed] BlockStatement
lib/response.js:787:39
  * @public
  */
 
-res.location = function location(url) {
-  return this.set('Location', encodeUrl(url));
-};
+res.location = function location(url) {};
 
 /**
killedBy: auth GET / should redirect to /login
statusReason: expected "Location" header field

[Killed] StringLiteral
lib/response.js:788:19
  */
 
 res.location = function location(url) {
-  return this.set('Location', encodeUrl(url));
+  return this.set("", encodeUrl(url));
 };
 
killedBy: auth GET / should redirect to /login
statusReason: expected "Location" header field

[Killed] EqualityOperator
lib/response.js:811:7
   var status = 302;
 
   // allow status / url
-  if (arguments.length === 2) {
+  if (arguments.length !== 2) {
     status = arguments[0]
     address = arguments[1]
killedBy: auth GET / should redirect to /login
statusReason: expected "Location" of "/login", got "undefined"

[Killed] ConditionalExpression
lib/response.js:811:7
   var status = 302;
 
   // allow status / url
-  if (arguments.length === 2) {
+  if (false) {
     status = arguments[0]
     address = arguments[1]
killedBy: res .redirect(status, url) should set the response status
statusReason: expected "Location" of "http://google.com", got "303"

[Killed] StringLiteral
lib/response.js:817:40
   }
 
   // Set location header
-  address = this.location(address).get('Location');
+  address = this.location(address).get("");
 
   // Support text/{plain,html} by default
killedBy: vhost foo.example.com GET / should redirect to /foo
statusReason: expected body 'Found. Redirecting to undefined' to match /Redirecting to http:\/\/example.com:3000\/foo/

[Killed] BlockStatement
lib/response.js:821:21
 
   // Support text/{plain,html} by default
   this.format({
-    text: function(){
-      body = statuses.message[status] + '. Redirecting to ' + address
-    },
+    text: function(){},
 
     html: function(){
killedBy: auth GET / should redirect to /login
statusReason: expected 302 "Found", got 500 "Internal Server Error"

[Killed] BlockStatement
lib/response.js:825:21
       body = statuses.message[status] + '. Redirecting to ' + address
     },
 
-    html: function(){
-      var u = escapeHtml(address);
-      body = '<p>' + statuses.message[status] + '. Redirecting to ' + u + '</p>'
-    },
+    html: function(){},
 
     default: function(){
killedBy: res when accepting html should respond with html
statusReason: expected 302 "Found", got 500 "Internal Server Error"

[Killed] StringLiteral
lib/response.js:827:14
 
     html: function(){
       var u = escapeHtml(address);
-      body = '<p>' + statuses.message[status] + '. Redirecting to ' + u + '</p>'
+      body = "" + statuses.message[status] + '. Redirecting to ' + u + '</p>'
     },
 
killedBy: res when accepting html should respond with html
statusReason: expected '<p>Found. Redirecting to http://google.com</p>' response body, got 'Found. Redirecting to http://google.com</p>'

[Killed] BlockStatement
lib/response.js:830:24
       body = '<p>' + statuses.message[status] + '. Redirecting to ' + u + '</p>'
     },
 
-    default: function(){
-      body = '';
-    }
+    default: function(){}
   });
 
killedBy: res when accepting neither text or html should respond with an empty body
statusReason: expected 302 "Found", got 500 "Internal Server Error"

[Killed] ConditionalExpression
lib/response.js:839:7
   this.status(status);
   this.set('Content-Length', Buffer.byteLength(body));
 
-  if (this.req.method === 'HEAD') {
+  if (true) {
     this.end();
   } else {
killedBy: auth GET / should redirect to /login
statusReason: aborted

[Killed] EqualityOperator
lib/response.js:839:7
   this.status(status);
   this.set('Content-Length', Buffer.byteLength(body));
 
-  if (this.req.method === 'HEAD') {
+  if (this.req.method !== 'HEAD') {
     this.end();
   } else {
killedBy: auth GET / should redirect to /login
statusReason: aborted

[Timeout] BlockStatement
lib/response.js:841:10
 
   if (this.req.method === 'HEAD') {
     this.end();
-  } else {
-    this.end(body);
-  }
+  } else {}
 };
 

[Killed] BlockStatement
lib/response.js:855:27
  * @public
  */
 
-res.vary = function(field){
-  vary(this, field);
-
-  return this;
-};
+res.vary = function(field){};
 
 /**
killedBy: res .format(obj) with canonicalized mime types should Vary: Accept
statusReason: expected "Vary" header field

[Timeout] BlockStatement
lib/response.js:874:55
  * @public
  */
 
-res.render = function render(view, options, callback) {
-  var app = this.req.app;
-  var done = callback;
-  var opts = options || {};
-  var req = this.req;
-  var self = this;
-
-  // support callback function as second arg
-  if (typeof options === 'function') {
-    done = options;
-    opts = {};
-  }
-
-  // merge res.locals
-  opts._locals = self.locals;
-
-  // default callback to respond
-  done = done || function (err, str) {
-    if (err) return req.next(err);
-    self.send(str);
-  };
-
-  // render
-  app.render(view, opts, done);
-};
+res.render = function render(view, options, callback) {};
 
 // pipe the send file stream

[Killed] LogicalOperator
lib/response.js:877:14
 res.render = function render(view, options, callback) {
   var app = this.req.app;
   var done = callback;
-  var opts = options || {};
+  var opts = options && {};
   var req = this.req;
   var self = this;
killedBy: auth GET /login should render login form
statusReason: expected 200 "OK", got 500 "Internal Server Error"

[Killed] ConditionalExpression
lib/response.js:877:14
 res.render = function render(view, options, callback) {
   var app = this.req.app;
   var done = callback;
-  var opts = options || {};
+  var opts = false;
   var req = this.req;
   var self = this;
killedBy: auth GET /login should render login form
statusReason: expected 200 "OK", got 500 "Internal Server Error"

[Killed] ConditionalExpression
lib/response.js:882:7
   var self = this;
 
   // support callback function as second arg
-  if (typeof options === 'function') {
+  if (true) {
     done = options;
     opts = {};
killedBy: ejs GET / should respond with html
statusReason: callback.apply is not a function

[Killed] BlockStatement
lib/response.js:882:38
   var self = this;
 
   // support callback function as second arg
-  if (typeof options === 'function') {
-    done = options;
-    opts = {};
-  }
+  if (typeof options === 'function') {}
 
   // merge res.locals
killedBy: res .render(name, fn) should pass the resulting string
statusReason: expected '<p>loki</p>' response body, got '<p>$user.name</p>'

[Killed] ConditionalExpression
lib/response.js:891:10
   opts._locals = self.locals;
 
   // default callback to respond
-  done = done || function (err, str) {
-    if (err) return req.next(err);
-    self.send(str);
-  };
+  done = false;
 
   // render
killedBy: auth GET /login should render login form
statusReason: callback.apply is not a function

[Killed] LogicalOperator
lib/response.js:891:10
   opts._locals = self.locals;
 
   // default callback to respond
-  done = done || function (err, str) {
-    if (err) return req.next(err);
-    self.send(str);
-  };
+  done = done && function (err, str) {
+  if (err) return req.next(err);
+  self.send(str);
+};
 
   // render
killedBy: auth GET /login should render login form
statusReason: Cannot read properties of undefined (reading 'apply')

[Killed] ConditionalExpression
lib/response.js:892:9
 
   // default callback to respond
   done = done || function (err, str) {
-    if (err) return req.next(err);
+    if (true) return req.next(err);
     self.send(str);
   };
killedBy: auth GET /login should render login form
statusReason: expected 200 "OK", got 404 "Not Found"

[Killed] ConditionalExpression
lib/response.js:892:9
 
   // default callback to respond
   done = done || function (err, str) {
-    if (err) return req.next(err);
+    if (false) return req.next(err);
     self.send(str);
   };
killedBy: markdown GET /fail should respond with an error
statusReason: expected 500 "Internal Server Error", got 200 "OK"

[Timeout] BooleanLiteral
lib/response.js:902:14
 
 // pipe the send file stream
 function sendfile(res, file, options, callback) {
-  var done = false;
+  var done = true;
   var streaming;
 

[NoCoverage] BlockStatement
lib/response.js:906:24
   var streaming;
 
   // request aborted
-  function onaborted() {
-    if (done) return;
-    done = true;
-
-    var err = new Error('Request aborted');
-    err.code = 'ECONNABORTED';
-    callback(err);
-  }
+  function onaborted() {}
 
   // directory

[NoCoverage] ConditionalExpression
lib/response.js:907:9
 
   // request aborted
   function onaborted() {
-    if (done) return;
+    if (true) return;
     done = true;
 

[NoCoverage] ConditionalExpression
lib/response.js:907:9
 
   // request aborted
   function onaborted() {
-    if (done) return;
+    if (false) return;
     done = true;
 

[NoCoverage] BooleanLiteral
lib/response.js:908:12
   // request aborted
   function onaborted() {
     if (done) return;
-    done = true;
+    done = false;
 
     var err = new Error('Request aborted');

[NoCoverage] StringLiteral
lib/response.js:911:16
     done = true;
 
     var err = new Error('Request aborted');
-    err.code = 'ECONNABORTED';
+    err.code = "";
     callback(err);
   }

[NoCoverage] BlockStatement
lib/response.js:916:26
   }
 
   // directory
-  function ondirectory() {
-    if (done) return;
-    done = true;
-
-    var err = new Error('EISDIR, read');
-    err.code = 'EISDIR';
-    callback(err);
-  }
+  function ondirectory() {}
 
   // errors

[NoCoverage] ConditionalExpression
lib/response.js:917:9
 
   // directory
   function ondirectory() {
-    if (done) return;
+    if (false) return;
     done = true;
 

[NoCoverage] ConditionalExpression
lib/response.js:917:9
 
   // directory
   function ondirectory() {
-    if (done) return;
+    if (true) return;
     done = true;
 

[NoCoverage] StringLiteral
lib/response.js:920:25
     if (done) return;
     done = true;
 
-    var err = new Error('EISDIR, read');
+    var err = new Error("");
     err.code = 'EISDIR';
     callback(err);

[Timeout] BlockStatement
lib/response.js:926:25
   }
 
   // errors
-  function onerror(err) {
-    if (done) return;
-    done = true;
-    callback(err);
-  }
+  function onerror(err) {}
 
   // ended

[Survived] ConditionalExpression
lib/response.js:927:9
 
   // errors
   function onerror(err) {
-    if (done) return;
+    if (false) return;
     done = true;
     callback(err);

[Timeout] ConditionalExpression
lib/response.js:927:9
 
   // errors
   function onerror(err) {
-    if (done) return;
+    if (true) return;
     done = true;
     callback(err);

[Timeout] BlockStatement
lib/response.js:933:20
   }
 
   // ended
-  function onend() {
-    if (done) return;
-    done = true;
-    callback();
-  }
+  function onend() {}
 
   // file

[Timeout] ConditionalExpression
lib/response.js:934:9
 
   // ended
   function onend() {
-    if (done) return;
+    if (false) return;
     done = true;
     callback();

[Timeout] ConditionalExpression
lib/response.js:934:9
 
   // ended
   function onend() {
-    if (done) return;
+    if (true) return;
     done = true;
     callback();

[Timeout] BlockStatement
lib/response.js:940:21
   }
 
   // file
-  function onfile() {
-    streaming = false;
-  }
+  function onfile() {}
 
   // finished

[Timeout] BooleanLiteral
lib/response.js:941:17
 
   // file
   function onfile() {
-    streaming = false;
+    streaming = true;
   }
 

[Timeout] BlockStatement
lib/response.js:945:26
   }
 
   // finished
-  function onfinish(err) {
-    if (err && err.code === 'ECONNRESET') return onaborted();
-    if (err) return onerror(err);
-    if (done) return;
-
-    setImmediate(function () {
-      if (streaming !== false && !done) {
-        onaborted();
-        return;
-      }
-
-      if (done) return;
-      done = true;
-      callback();
-    });
-  }
+  function onfinish(err) {}
 
   // streaming

[Killed] LogicalOperator
lib/response.js:946:9
 
   // finished
   function onfinish(err) {
-    if (err && err.code === 'ECONNRESET') return onaborted();
+    if (err || err.code === 'ECONNRESET') return onaborted();
     if (err) return onerror(err);
     if (done) return;
killedBy: downloads GET /files/notes/groceries.txt should have a download header; downloads GET /files/notes/groceries.txt should have a download header
statusReason: Cannot read properties of null (reading 'code')

[Survived] ConditionalExpression
lib/response.js:946:9
 
   // finished
   function onfinish(err) {
-    if (err && err.code === 'ECONNRESET') return onaborted();
+    if (false) return onaborted();
     if (err) return onerror(err);
     if (done) return;

[Survived] ConditionalExpression
lib/response.js:947:9
   // finished
   function onfinish(err) {
     if (err && err.code === 'ECONNRESET') return onaborted();
-    if (err) return onerror(err);
+    if (false) return onerror(err);
     if (done) return;
 

[Survived] ConditionalExpression
lib/response.js:947:9
   // finished
   function onfinish(err) {
     if (err && err.code === 'ECONNRESET') return onaborted();
-    if (err) return onerror(err);
+    if (true) return onerror(err);
     if (done) return;
 

[Survived] ConditionalExpression
lib/response.js:948:9
   function onfinish(err) {
     if (err && err.code === 'ECONNRESET') return onaborted();
     if (err) return onerror(err);
-    if (done) return;
+    if (false) return;
 
     setImmediate(function () {

[Survived] ConditionalExpression
lib/response.js:948:9
   function onfinish(err) {
     if (err && err.code === 'ECONNRESET') return onaborted();
     if (err) return onerror(err);
-    if (done) return;
+    if (true) return;
 
     setImmediate(function () {
