[NoCoverage] BlockStatement
lib/response.js:950:30
     if (err) return onerror(err);
     if (done) return;
 
-    setImmediate(function () {
-      if (streaming !== false && !done) {
-        onaborted();
-        return;
-      }
-
-      if (done) return;
-      done = true;
-      callback();
-    });
+    setImmediate(function () {});
   }
 

[NoCoverage] ConditionalExpression
lib/response.js:951:11
     if (done) return;
 
     setImmediate(function () {
-      if (streaming !== false && !done) {
+      if (true) {
         onaborted();
         return;

[NoCoverage] ConditionalExpression
lib/response.js:951:11
     if (done) return;
 
     setImmediate(function () {
-      if (streaming !== false && !done) {
+      if (true && !done) {
         onaborted();
         return;

[NoCoverage] ConditionalExpression
lib/response.js:956:11
         return;
       }
 
-      if (done) return;
+      if (true) return;
       done = true;
       callback();

[NoCoverage] ConditionalExpression
lib/response.js:956:11
         return;
       }
 
-      if (done) return;
+      if (false) return;
       done = true;
       callback();

[Survived] BlockStatement
lib/response.js:963:23
   }
 
   // streaming
-  function onstream() {
-    streaming = true;
-  }
+  function onstream() {}
 
   file.on('directory', ondirectory);

[Survived] BooleanLiteral
lib/response.js:964:17
 
   // streaming
   function onstream() {
-    streaming = true;
+    streaming = false;
   }
 

[Killed] BlockStatement
lib/response.js:974:24
   file.on('stream', onstream);
   onFinished(res, onfinish);
 
-  if (options.headers) {
-    // set headers on successful transfer
-    file.on('headers', function headers(res) {
-      var obj = options.headers;
-      var keys = Object.keys(obj);
-
-      for (var i = 0; i < keys.length; i++) {
-        var k = keys[i];
-        res.setHeader(k, obj[k]);
-      }
-    });
-  }
+  if (options.headers) {}
 
   // pipe
killedBy: downloads GET /files/notes/groceries.txt should have a download header
statusReason: expected "Content-Disposition" header field

[Killed] ConditionalExpression
lib/response.js:974:7
   file.on('stream', onstream);
   onFinished(res, onfinish);
 
-  if (options.headers) {
+  if (false) {
     // set headers on successful transfer
     file.on('headers', function headers(res) {
killedBy: downloads GET /files/notes/groceries.txt should have a download header
statusReason: expected "Content-Disposition" header field

[Killed] BlockStatement
lib/response.js:976:46
 
   if (options.headers) {
     // set headers on successful transfer
-    file.on('headers', function headers(res) {
-      var obj = options.headers;
-      var keys = Object.keys(obj);
-
-      for (var i = 0; i < keys.length; i++) {
-        var k = keys[i];
-        res.setHeader(k, obj[k]);
-      }
-    });
+    file.on('headers', function headers(res) {});
   }
 
killedBy: downloads GET /files/notes/groceries.txt should have a download header
statusReason: expected "Content-Disposition" header field

[Killed] EqualityOperator
lib/response.js:980:23
       var obj = options.headers;
       var keys = Object.keys(obj);
 
-      for (var i = 0; i < keys.length; i++) {
+      for (var i = 0; i <= keys.length; i++) {
         var k = keys[i];
         res.setHeader(k, obj[k]);
killedBy: downloads GET /files/notes/groceries.txt should have a download header
statusReason: Header name must be a valid HTTP token ["undefined"]

[Killed] BlockStatement
lib/response.js:980:45
       var obj = options.headers;
       var keys = Object.keys(obj);
 
-      for (var i = 0; i < keys.length; i++) {
-        var k = keys[i];
-        res.setHeader(k, obj[k]);
-      }
+      for (var i = 0; i < keys.length; i++) {}
     });
   }
killedBy: downloads GET /files/notes/groceries.txt should have a download header
statusReason: expected "Content-Disposition" header field

[Timeout] BlockStatement
lib/response.js:1003:54
  * @private
  */
 
-function stringify (value, replacer, spaces, escape) {
-  // v8 checks arguments.length for optimizing simple call
-  // https://bugs.chromium.org/p/v8/issues/detail?id=4730
-  var json = replacer || spaces
-    ? JSON.stringify(value, replacer, spaces)
-    : JSON.stringify(value);
-
-  if (escape && typeof json === 'string') {
-    json = json.replace(/[<>&]/g, function (c) {
-      switch (c.charCodeAt(0)) {
-        case 0x3c:
-          return '\\u003c'
-        case 0x3e:
-          return '\\u003e'
-        case 0x26:
-          return '\\u0026'
-        /* istanbul ignore next: unreachable default */
-        default:
-          return c
-      }
-    })
-  }
-
-  return json
-}
+function stringify (value, replacer, spaces, escape) {}
 

[Killed] LogicalOperator
lib/response.js:1006:14
 function stringify (value, replacer, spaces, escape) {
   // v8 checks arguments.length for optimizing simple call
   // https://bugs.chromium.org/p/v8/issues/detail?id=4730
-  var json = replacer || spaces
+  var json = replacer && spaces
     ? JSON.stringify(value, replacer, spaces)
     : JSON.stringify(value);
killedBy: resource GET /users/1..3.json should respond with users 2 and 3 as json
statusReason: expected body '[{"name":"ciaran"},{"name":"aaron"},{"name":"guillermo"}]' to match /^\[null,{"name":"aaron"},{"name":"guillermo"}\]/

[Killed] ConditionalExpression
lib/response.js:1006:14
 function stringify (value, replacer, spaces, escape) {
   // v8 checks arguments.length for optimizing simple call
   // https://bugs.chromium.org/p/v8/issues/detail?id=4730
-  var json = replacer || spaces
+  var json = false
     ? JSON.stringify(value, replacer, spaces)
     : JSON.stringify(value);
killedBy: resource GET /users/1..3.json should respond with users 2 and 3 as json
statusReason: expected body '[{"name":"ciaran"},{"name":"aaron"},{"name":"guillermo"}]' to match /^\[null,{"name":"aaron"},{"name":"guillermo"}\]/

[Killed] ConditionalExpression
lib/response.js:1010:7
     ? JSON.stringify(value, replacer, spaces)
     : JSON.stringify(value);
 
-  if (escape && typeof json === 'string') {
+  if (true) {
     json = json.replace(/[<>&]/g, function (c) {
       switch (c.charCodeAt(0)) {
killedBy: resource GET /users/1..3.json should respond with users 2 and 3 as json
statusReason: expected body '[{"name":"ciaran"},{"name":"aaron"},{"name":"guillermo"}]' to match /^\[null,{"name":"aaron"},{"name":"guillermo"}\]/

[Killed] EqualityOperator
lib/response.js:1010:17
     ? JSON.stringify(value, replacer, spaces)
     : JSON.stringify(value);
 
-  if (escape && typeof json === 'string') {
+  if (escape && typeof json !== 'string') {
     json = json.replace(/[<>&]/g, function (c) {
       switch (c.charCodeAt(0)) {
killedBy: res .json(object) "json escape" setting should unicode escape HTML-sniffing characters
statusReason: expected '{"\\u0026":"\\u003cscript\\u003e"}' response body, got '{"&":"<script>"}'

[Killed] BlockStatement
lib/response.js:1011:48
     : JSON.stringify(value);
 
   if (escape && typeof json === 'string') {
-    json = json.replace(/[<>&]/g, function (c) {
-      switch (c.charCodeAt(0)) {
-        case 0x3c:
-          return '\\u003c'
-        case 0x3e:
-          return '\\u003e'
-        case 0x26:
-          return '\\u0026'
-        /* istanbul ignore next: unreachable default */
-        default:
-          return c
-      }
-    })
+    json = json.replace(/[<>&]/g, function (c) {})
   }
 
killedBy: res .json(object) "json escape" setting should unicode escape HTML-sniffing characters
statusReason: expected '{"\\u0026":"\\u003cscript\\u003e"}' response body, got '{"undefined":"undefinedscriptundefined"}'

[Killed] ConditionalExpression
lib/response.js:1013:9
   if (escape && typeof json === 'string') {
     json = json.replace(/[<>&]/g, function (c) {
       switch (c.charCodeAt(0)) {
-        case 0x3c:
-          return '\\u003c'
+        case 0x3c:
         case 0x3e:
           return '\\u003e'
killedBy: res .json(object) "json escape" setting should unicode escape HTML-sniffing characters
statusReason: expected '{"\\u0026":"\\u003cscript\\u003e"}' response body, got '{"\\u0026":"\\u003escript\\u003e"}'

[Killed] ConditionalExpression
lib/response.js:1015:9
       switch (c.charCodeAt(0)) {
         case 0x3c:
           return '\\u003c'
-        case 0x3e:
-          return '\\u003e'
+        case 0x3e:
         case 0x26:
           return '\\u0026'
killedBy: res .json(object) "json escape" setting should unicode escape HTML-sniffing characters
statusReason: expected '{"\\u0026":"\\u003cscript\\u003e"}' response body, got '{"\\u0026":"\\u003cscript\\u0026"}'

[Killed] ConditionalExpression
lib/response.js:1017:9
           return '\\u003c'
         case 0x3e:
           return '\\u003e'
-        case 0x26:
-          return '\\u0026'
+        case 0x26:
+/* istanbul ignore next: unreachable default */
         /* istanbul ignore next: unreachable default */
         default:
killedBy: res .json(object) "json escape" setting should unicode escape HTML-sniffing characters
statusReason: expected '{"\\u0026":"\\u003cscript\\u003e"}' response body, got '{"&":"\\u003cscript\\u003e"}'

[NoCoverage] ConditionalExpression
lib/response.js:1020:9
         case 0x26:
           return '\\u0026'
         /* istanbul ignore next: unreachable default */
-        default:
-          return c
+        /* istanbul ignore next: unreachable default */
+default:
       }
     })
