[Timeout] BooleanLiteral
lib/utils.js:32:44
  * @api private
  */
 
-exports.etag = createETagGenerator({ weak: false })
+exports.etag = createETagGenerator({ weak: true })
 
 /**

[Timeout] BooleanLiteral
lib/utils.js:43:45
  * @api private
  */
 
-exports.wetag = createETagGenerator({ weak: true })
+exports.wetag = createETagGenerator({ weak: false })
 
 /**

[Killed] BlockStatement
lib/utils.js:53:39
  * @api private
  */
 
-exports.normalizeType = function(type){
-  return ~type.indexOf('/')
-    ? acceptParams(type)
-    : { value: (mime.lookup(type) || 'application/octet-stream'), params: {} }
-};
+exports.normalizeType = function(type){};
 
 /**
killedBy: auth GET / should redirect to /login
statusReason: expected 302 "Found", got 500 "Internal Server Error"

[Killed] UnaryOperator
lib/utils.js:54:10
  */
 
 exports.normalizeType = function(type){
-  return ~type.indexOf('/')
+  return type.indexOf('/')
     ? acceptParams(type)
     : { value: (mime.lookup(type) || 'application/octet-stream'), params: {} }
killedBy: res .format(obj) with extnames when no match is made should should respond with 406 not acceptable
statusReason: expected 'Supports: text/plain, text/html, application/json' response body, got 'Supports: text, html, json'

[Timeout] StringLiteral
lib/utils.js:54:24
  */
 
 exports.normalizeType = function(type){
-  return ~type.indexOf('/')
+  return ~type.indexOf("")
     ? acceptParams(type)
     : { value: (mime.lookup(type) || 'application/octet-stream'), params: {} }

[Timeout] ConditionalExpression
lib/utils.js:56:17
 exports.normalizeType = function(type){
   return ~type.indexOf('/')
     ? acceptParams(type)
-    : { value: (mime.lookup(type) || 'application/octet-stream'), params: {} }
+    : { value: (true), params: {} }
 };
 

[Timeout] ConditionalExpression
lib/utils.js:56:17
 exports.normalizeType = function(type){
   return ~type.indexOf('/')
     ? acceptParams(type)
-    : { value: (mime.lookup(type) || 'application/octet-stream'), params: {} }
+    : { value: (false), params: {} }
 };
 

[Timeout] BlockStatement
lib/utils.js:67:41
  * @api private
  */
 
-exports.normalizeTypes = function(types){
-  var ret = [];
-
-  for (var i = 0; i < types.length; ++i) {
-    ret.push(exports.normalizeType(types[i]));
-  }
-
-  return ret;
-};
+exports.normalizeTypes = function(types){};
 
 /**

[Killed] BlockStatement
lib/utils.js:70:42
 exports.normalizeTypes = function(types){
   var ret = [];
 
-  for (var i = 0; i < types.length; ++i) {
-    ret.push(exports.normalizeType(types[i]));
-  }
+  for (var i = 0; i < types.length; ++i) {}
 
   return ret;
killedBy: res .format(obj) with canonicalized mime types when no match is made should should respond with 406 not acceptable
statusReason: expected 'Supports: text/plain, text/html, application/json' response body, got 'Supports: '

[Killed] EqualityOperator
lib/utils.js:70:19
 exports.normalizeTypes = function(types){
   var ret = [];
 
-  for (var i = 0; i < types.length; ++i) {
+  for (var i = 0; i <= types.length; ++i) {
     ret.push(exports.normalizeType(types[i]));
   }
killedBy: res .format(obj) with canonicalized mime types when no match is made should should respond with 406 not acceptable
statusReason: expected 'Supports: text/plain, text/html, application/json' response body, got '<!DOCTYPE html>\n' +
  '<html lang="en">\n' +
  '<head>\n' +
  '<meta charset="utf-8">\n' +
  '<title>Error</title>\n' +
  '</head>\n' +
  '<body>\n' +

[Killed] BlockStatement
lib/utils.js:86:29
  * @api private
  */
 
-function acceptParams (str) {
-  var parts = str.split(/ *; */);
-  var ret = { value: parts[0], quality: 1, params: {} }
-
-  for (var i = 1; i < parts.length; ++i) {
-    var pms = parts[i].split(/ *= */);
-    if ('q' === pms[0]) {
-      ret.quality = parseFloat(pms[1]);
-    } else {
-      ret.params[pms[0]] = pms[1];
-    }
-  }
-
-  return ret;
-}
+function acceptParams (str) {}
 
 /**
killedBy: res .format(obj) with canonicalized mime types should utilize qvalues in negotiation
statusReason: expected { message: 'hey' } response body, got {}

[Killed] EqualityOperator
lib/utils.js:90:19
   var parts = str.split(/ *; */);
   var ret = { value: parts[0], quality: 1, params: {} }
 
-  for (var i = 1; i < parts.length; ++i) {
+  for (var i = 1; i <= parts.length; ++i) {
     var pms = parts[i].split(/ *= */);
     if ('q' === pms[0]) {
killedBy: res .format(obj) with canonicalized mime types should utilize qvalues in negotiation
statusReason: expected { message: 'hey' } response body, got {}

[Killed] UpdateOperator
lib/utils.js:90:37
   var parts = str.split(/ *; */);
   var ret = { value: parts[0], quality: 1, params: {} }
 
-  for (var i = 1; i < parts.length; ++i) {
+  for (var i = 1; i < parts.length; --i) {
     var pms = parts[i].split(/ *= */);
     if ('q' === pms[0]) {
killedBy: res .format(obj) with parameters should utilize qvalues in negotiation
statusReason: expected { message: 'hey' } response body, got {}

[Survived] Regex
lib/utils.js:91:30
   var ret = { value: parts[0], quality: 1, params: {} }
 
   for (var i = 1; i < parts.length; ++i) {
-    var pms = parts[i].split(/ *= */);
+    var pms = parts[i].split(/ *= /);
     if ('q' === pms[0]) {
       ret.quality = parseFloat(pms[1]);

[Survived] ConditionalExpression
lib/utils.js:92:9
 
   for (var i = 1; i < parts.length; ++i) {
     var pms = parts[i].split(/ *= */);
-    if ('q' === pms[0]) {
+    if (false) {
       ret.quality = parseFloat(pms[1]);
     } else {

[Survived] ConditionalExpression
lib/utils.js:92:9
 
   for (var i = 1; i < parts.length; ++i) {
     var pms = parts[i].split(/ *= */);
-    if ('q' === pms[0]) {
+    if (true) {
       ret.quality = parseFloat(pms[1]);
     } else {

[Survived] BlockStatement
lib/utils.js:94:12
     var pms = parts[i].split(/ *= */);
     if ('q' === pms[0]) {
       ret.quality = parseFloat(pms[1]);
-    } else {
-      ret.params[pms[0]] = pms[1];
-    }
+    } else {}
   }
 

[Timeout] BlockStatement
lib/utils.js:110:37
  * @api private
  */
 
-exports.compileETag = function(val) {
-  var fn;
-
-  if (typeof val === 'function') {
-    return val;
-  }
-
-  switch (val) {
-    case true:
-    case 'weak':
-      fn = exports.wetag;
-      break;
-    case false:
-      break;
-    case 'strong':
-      fn = exports.etag;
-      break;
-    default:
-      throw new TypeError('unknown value for etag function: ' + val);
-  }
-
-  return fn;
-}
+exports.compileETag = function(val) {}
 
 /**

[Killed] BlockStatement
lib/utils.js:113:34
 exports.compileETag = function(val) {
   var fn;
 
-  if (typeof val === 'function') {
-    return val;
-  }
+  if (typeof val === 'function') {}
 
   switch (val) {
killedBy: config .set() "etag" should set "etag fn"
statusReason: unknown value for etag function: function fn() {}

[Timeout] ConditionalExpression
lib/utils.js:113:7
 exports.compileETag = function(val) {
   var fn;
 
-  if (typeof val === 'function') {
+  if (false) {
     return val;
   }

[Timeout] BooleanLiteral
lib/utils.js:118:10
   }
 
   switch (val) {
-    case true:
+    case false:
     case 'weak':
       fn = exports.wetag;

[Timeout] ConditionalExpression
lib/utils.js:119:5
 
   switch (val) {
     case true:
-    case 'weak':
-      fn = exports.wetag;
-      break;
+    case 'weak':
     case false:
       break;

[Killed] BooleanLiteral
lib/utils.js:122:10
     case 'weak':
       fn = exports.wetag;
       break;
-    case false:
+    case true:
       break;
     case 'strong':
killedBy: res "etag" setting when disabled should send no ETag
statusReason: unknown value for etag function: false

[Killed] ConditionalExpression
lib/utils.js:122:5
     case 'weak':
       fn = exports.wetag;
       break;
-    case false:
-      break;
+    case false:
     case 'strong':
       fn = exports.etag;
killedBy: res "etag" setting when disabled should send no ETag
statusReason: should not have header ETag

[Killed] ConditionalExpression
lib/utils.js:124:5
       break;
     case false:
       break;
-    case 'strong':
-      fn = exports.etag;
-      break;
+    case 'strong':
     default:
       throw new TypeError('unknown value for etag function: ' + val);
killedBy: res "etag" setting when "strong" should send strong ETag
statusReason: unknown value for etag function: strong

[Killed] StringLiteral
lib/utils.js:124:10
       break;
     case false:
       break;
-    case 'strong':
+    case "":
       fn = exports.etag;
       break;
killedBy: res "etag" setting when "strong" should send strong ETag
statusReason: unknown value for etag function: strong

[Killed] ConditionalExpression
lib/utils.js:127:5
     case 'strong':
       fn = exports.etag;
       break;
-    default:
-      throw new TypeError('unknown value for etag function: ' + val);
+    default:
   }
 
killedBy: config .set() "etag" should throw on bad value
statusReason: Missing expected exception.

[Killed] StringLiteral
lib/utils.js:128:27
       fn = exports.etag;
       break;
     default:
-      throw new TypeError('unknown value for etag function: ' + val);
+      throw new TypeError("" + val);
   }
 
killedBy: config .set() "etag" should throw on bad value
statusReason: The input did not match the regular expression /unknown value/. Input:

'TypeError: 42'

[Killed] BlockStatement
lib/utils.js:142:63
  * @api private
  */
 
-exports.compileQueryParser = function compileQueryParser(val) {
-  var fn;
-
-  if (typeof val === 'function') {
-    return val;
-  }
-
-  switch (val) {
-    case true:
-    case 'simple':
-      fn = querystring.parse;
-      break;
-    case false:
-      break;
-    case 'extended':
-      fn = parseExtendedQueryString;
-      break;
-    default:
-      throw new TypeError('unknown value for query parser function: ' + val);
-  }
-
-  return fn;
-}
+exports.compileQueryParser = function compileQueryParser(val) {}
 
 /**
killedBy: web-service GET /api/users with an invalid api key should respond with 401 unauthorized
statusReason: expected 401 "Unauthorized", got 400 "Bad Request"

[Killed] ConditionalExpression
lib/utils.js:145:7
 exports.compileQueryParser = function compileQueryParser(val) {
   var fn;
 
-  if (typeof val === 'function') {
+  if (true) {
     return val;
   }
killedBy: web-service GET /api/users without an api key should respond with 400 bad request
statusReason: expected 400 "Bad Request", got 500 "Internal Server Error"

[Killed] ConditionalExpression
lib/utils.js:151:5
 
   switch (val) {
     case true:
-    case 'simple':
-      fn = querystring.parse;
-      break;
+    case 'simple':
     case false:
       break;
killedBy: web-service GET /api/users with an invalid api key should respond with 401 unauthorized
statusReason: expected 401 "Unauthorized", got 400 "Bad Request"

[Killed] ConditionalExpression
lib/utils.js:156:5
       break;
     case false:
       break;
-    case 'extended':
-      fn = parseExtendedQueryString;
-      break;
+    case 'extended':
     default:
       throw new TypeError('unknown value for query parser function: ' + val);
killedBy: req .query when "query parser" is extended should parse complex keys
statusReason: unknown value for query parser function: extended

[Killed] ConditionalExpression
lib/utils.js:159:5
     case 'extended':
       fn = parseExtendedQueryString;
       break;
-    default:
-      throw new TypeError('unknown value for query parser function: ' + val);
+    default:
   }
 
killedBy: req .query when "query parser" an unknown value should throw
statusReason: Missing expected exception.

[Killed] BlockStatement
lib/utils.js:174:38
  * @api private
  */
 
-exports.compileTrust = function(val) {
-  if (typeof val === 'function') return val;
-
-  if (val === true) {
-    // Support plain true/false
-    return function(){ return true };
-  }
-
-  if (typeof val === 'number') {
-    // Support trusting hop count
-    return function(a, i){ return i < val };
-  }
-
-  if (typeof val === 'string') {
-    // Support comma-separated values
-    val = val.split(',')
-      .map(function (v) { return v.trim() })
-  }
-
-  return proxyaddr.compile(val || []);
-}
+exports.compileTrust = function(val) {}
 
 /**
killedBy: cookie-sessions GET / should set a session cookie
statusReason: expected "Set-Cookie" header field

[Killed] ConditionalExpression
lib/utils.js:175:7
  */
 
 exports.compileTrust = function(val) {
-  if (typeof val === 'function') return val;
+  if (true) return val;
 
   if (val === true) {
killedBy: cookie-sessions GET / should set a session cookie
statusReason: expected "Set-Cookie" header field

[Killed] EqualityOperator
lib/utils.js:175:7
  */
 
 exports.compileTrust = function(val) {
-  if (typeof val === 'function') return val;
+  if (typeof val !== 'function') return val;
 
   if (val === true) {
killedBy: cookie-sessions GET / should set a session cookie
statusReason: expected "Set-Cookie" header field

[Killed] BlockStatement
lib/utils.js:177:21
 exports.compileTrust = function(val) {
   if (typeof val === 'function') return val;
 
-  if (val === true) {
-    // Support plain true/false
-    return function(){ return true };
-  }
+  if (val === true) {}
 
   if (typeof val === 'number') {
killedBy: req .host when "trust proxy" is enabled should respect X-Forwarded-Host
statusReason: unsupported trust argument

[Timeout] ConditionalExpression
lib/utils.js:177:7
 exports.compileTrust = function(val) {
   if (typeof val === 'function') return val;
 
-  if (val === true) {
+  if (true) {
     // Support plain true/false
     return function(){ return true };

[Killed] BlockStatement
lib/utils.js:179:22
 
   if (val === true) {
     // Support plain true/false
-    return function(){ return true };
+    return function(){};
   }
 
killedBy: req .host when "trust proxy" is enabled should respect X-Forwarded-Host
statusReason: expected 'example.com' response body, got 'localhost'

[Killed] BooleanLiteral
lib/utils.js:179:31
 
   if (val === true) {
     // Support plain true/false
-    return function(){ return true };
+    return function(){ return false };
   }
 
killedBy: req .host when "trust proxy" is enabled should respect X-Forwarded-Host
statusReason: expected 'example.com' response body, got 'localhost'

[Killed] BlockStatement
lib/utils.js:182:32
     return function(){ return true };
   }
 
-  if (typeof val === 'number') {
-    // Support trusting hop count
-    return function(a, i){ return i < val };
-  }
+  if (typeof val === 'number') {}
 
   if (typeof val === 'string') {
killedBy: req .host when "trust proxy" is enabled when trusting hop count should respect X-Forwarded-Host
statusReason: unsupported trust argument

[Timeout] EqualityOperator
lib/utils.js:182:7
     return function(){ return true };
   }
 
-  if (typeof val === 'number') {
+  if (typeof val !== 'number') {
     // Support trusting hop count
     return function(a, i){ return i < val };

[Killed] BlockStatement
lib/utils.js:184:26
 
   if (typeof val === 'number') {
     // Support trusting hop count
-    return function(a, i){ return i < val };
+    return function(a, i){};
   }
 
killedBy: req .host when "trust proxy" is enabled when trusting hop count should respect X-Forwarded-Host
statusReason: expected 'example.com' response body, got 'localhost'

[Killed] ConditionalExpression
lib/utils.js:184:35
 
   if (typeof val === 'number') {
     // Support trusting hop count
-    return function(a, i){ return i < val };
+    return function(a, i){ return false };
   }
 
killedBy: req .host when "trust proxy" is enabled when trusting hop count should respect X-Forwarded-Host
statusReason: expected 'example.com' response body, got 'localhost'

[Killed] BlockStatement
lib/utils.js:187:32
     return function(a, i){ return i < val };
   }
 
-  if (typeof val === 'string') {
-    // Support comma-separated values
-    val = val.split(',')
-      .map(function (v) { return v.trim() })
-  }
+  if (typeof val === 'string') {}
 
   return proxyaddr.compile(val || []);
killedBy: req .ip when X-Forwarded-For is present when "trust proxy" is enabled should return the addr after trusted proxy based on list
statusReason: invalid IP address: 10.0.0.1, 10.0.0.2, 127.0.0.1, ::1

[Timeout] ConditionalExpression
lib/utils.js:187:7
     return function(a, i){ return i < val };
   }
 
-  if (typeof val === 'string') {
+  if (false) {
     // Support comma-separated values
     val = val.split(',')

[Killed] StringLiteral
lib/utils.js:189:21
 
   if (typeof val === 'string') {
     // Support comma-separated values
-    val = val.split(',')
+    val = val.split("")
       .map(function (v) { return v.trim() })
   }
killedBy: req .host when "trust proxy" is enabled should ignore X-Forwarded-Host if socket addr not trusted
statusReason: invalid IP address: .

[Killed] BlockStatement
lib/utils.js:190:25
   if (typeof val === 'string') {
     // Support comma-separated values
     val = val.split(',')
-      .map(function (v) { return v.trim() })
+      .map(function (v) {})
   }
 
killedBy: req .host when "trust proxy" is enabled should ignore X-Forwarded-Host if socket addr not trusted
statusReason: Cannot read properties of undefined (reading 'lastIndexOf')

[Killed] MethodExpression
lib/utils.js:190:34
   if (typeof val === 'string') {
     // Support comma-separated values
     val = val.split(',')
-      .map(function (v) { return v.trim() })
+      .map(function (v) { return v })
   }
 
killedBy: req .ip when X-Forwarded-For is present when "trust proxy" is enabled should return the addr after trusted proxy based on list
statusReason: invalid IP address:  10.0.0.2

[Killed] BlockStatement
lib/utils.js:205:57
  * @api private
  */
 
-exports.setCharset = function setCharset(type, charset) {
-  if (!type || !charset) {
-    return type;
-  }
-
-  // parse type
-  var parsed = contentType.parse(type);
-
-  // set charset
-  parsed.parameters.charset = charset;
-
-  // format type
-  return contentType.format(parsed);
-};
+exports.setCharset = function setCharset(type, charset) {};
 
 /**
killedBy: ejs GET / should respond with html
statusReason: expected "Content-Type" of "text/html; charset=utf-8", got "false"

[Killed] BooleanLiteral
lib/utils.js:206:16
  */
 
 exports.setCharset = function setCharset(type, charset) {
-  if (!type || !charset) {
+  if (!type || charset) {
     return type;
   }
killedBy: mvc GET /users should display a list of users
statusReason: expected body '<!DOCTYPE html>\n' +
  '<html>\n' +
  '<head>\n' +
  '  <meta charset="utf-8">\n' +
  '  <meta name="viewport" content="width=device-width,initial-scale=1">\n' +
  '  <link rel="stylesheet" href="/style.css">\n' +
  '  <title>Users</title>\n' +
  '</head>\n' +

[Killed] BlockStatement
lib/utils.js:206:26
  */
 
 exports.setCharset = function setCharset(type, charset) {
-  if (!type || !charset) {
-    return type;
-  }
+  if (!type || !charset) {}
 
   // parse type
killedBy: utils.setCharset(type, charset) should do anything without type
statusReason: argument string is required

[Timeout] BlockStatement
lib/utils.js:229:40
  * @private
  */
 
-function createETagGenerator (options) {
-  return function generateETag (body, encoding) {
-    var buf = !Buffer.isBuffer(body)
-      ? Buffer.from(body, encoding)
-      : body
-
-    return etag(buf, options)
-  }
-}
+function createETagGenerator (options) {}
 
 /**

[Killed] BlockStatement
lib/utils.js:230:49
  */
 
 function createETagGenerator (options) {
-  return function generateETag (body, encoding) {
-    var buf = !Buffer.isBuffer(body)
-      ? Buffer.from(body, encoding)
-      : body
-
-    return etag(buf, options)
-  }
+  return function generateETag (body, encoding) {}
 }
 
killedBy: mvc GET /users should display a list of users
statusReason: expected body '<!DOCTYPE html>\n' +
  '<html>\n' +
  '<head>\n' +
  '  <meta charset="utf-8">\n' +
  '  <meta name="viewport" content="width=device-width,initial-scale=1">\n' +
  '  <link rel="stylesheet" href="/style.css">\n' +
  '  <title>Users</title>\n' +
  '</head>\n' +

[Killed] BooleanLiteral
lib/utils.js:231:15
 
 function createETagGenerator (options) {
   return function generateETag (body, encoding) {
-    var buf = !Buffer.isBuffer(body)
+    var buf = Buffer.isBuffer(body)
       ? Buffer.from(body, encoding)
       : body
killedBy: mvc GET /users should display a list of users
statusReason: expected body '<!DOCTYPE html>\n' +
  '<html>\n' +
  '<head>\n' +
  '  <meta charset="utf-8">\n' +
  '  <meta name="viewport" content="width=device-width,initial-scale=1">\n' +
  '  <link rel="stylesheet" href="/style.css">\n' +
  '  <title>Users</title>\n' +
  '</head>\n' +

[Timeout] BlockStatement
lib/utils.js:247:40
  * @private
  */
 
-function parseExtendedQueryString(str) {
-  return qs.parse(str, {
-    allowPrototypes: true
-  });
-}
+function parseExtendedQueryString(str) {}
 

[Survived] BooleanLiteral
lib/utils.js:249:22
 
 function parseExtendedQueryString(str) {
   return qs.parse(str, {
-    allowPrototypes: true
+    allowPrototypes: false
   });
 }
