[Timeout] BooleanLiteral
lib/application.js:72:19
 
   // Setup getting to lazily add base router
   Object.defineProperty(this, 'router', {
-    configurable: true,
+    configurable: false,
     enumerable: true,
     get: function getrouter() {

[Timeout] BooleanLiteral
lib/application.js:73:17
   // Setup getting to lazily add base router
   Object.defineProperty(this, 'router', {
     configurable: true,
-    enumerable: true,
+    enumerable: false,
     get: function getrouter() {
       if (router === null) {

[Killed] ConditionalExpression
lib/application.js:75:11
     configurable: true,
     enumerable: true,
     get: function getrouter() {
-      if (router === null) {
+      if (true) {
         router = new Router({
           caseSensitive: this.enabled('case sensitive routing'),
killedBy: auth GET / should redirect to /login
statusReason: expected "Location" header field

[Killed] ObjectLiteral
lib/application.js:76:29
     enumerable: true,
     get: function getrouter() {
       if (router === null) {
-        router = new Router({
-          caseSensitive: this.enabled('case sensitive routing'),
-          strict: this.enabled('strict routing')
-        });
+        router = new Router({});
       }
 
killedBy: app.router case sensitivity when "case sensitive routing" is enabled should not match otherwise
statusReason: expected 404 "Not Found", got 200 "OK"

[Killed] StringLiteral
lib/application.js:77:39
     get: function getrouter() {
       if (router === null) {
         router = new Router({
-          caseSensitive: this.enabled('case sensitive routing'),
+          caseSensitive: this.enabled(""),
           strict: this.enabled('strict routing')
         });
killedBy: app.router case sensitivity when "case sensitive routing" is enabled should not match otherwise
statusReason: expected 404 "Not Found", got 200 "OK"

[Killed] StringLiteral
lib/application.js:78:32
       if (router === null) {
         router = new Router({
           caseSensitive: this.enabled('case sensitive routing'),
-          strict: this.enabled('strict routing')
+          strict: this.enabled("")
         });
       }
killedBy: app.router trailing slashes when "strict routing" is enabled should fail when omitting the trailing slash
statusReason: expected 404 "Not Found", got 200 "OK"

[Killed] LogicalOperator
lib/application.js:93:13
  */
 
 app.defaultConfiguration = function defaultConfiguration() {
-  var env = process.env.NODE_ENV || 'development';
+  var env = process.env.NODE_ENV && 'development';
 
   // default settings
killedBy: in production should enable "view cache"
statusReason: The expression evaluated to a falsy value:

  it('should disable "view cache"', function(){
   var app = express();
   assert.ok(!app.enabled('view cache'))
  })

[Killed] ConditionalExpression
lib/application.js:93:13
  */
 
 app.defaultConfiguration = function defaultConfiguration() {
-  var env = process.env.NODE_ENV || 'development';
+  var env = false;
 
   // default settings
killedBy: in production should enable "view cache"
statusReason: The expression evaluated to a falsy value:

  it('should disable "view cache"', function(){
   var app = express();
   assert.ok(!app.enabled('view cache'))
  })

[Killed] StringLiteral
lib/application.js:98:12
   // default settings
   this.enable('x-powered-by');
   this.set('etag', 'weak');
-  this.set('env', env);
+  this.set("", env);
   this.set('query parser', 'simple')
   this.set('subdomain offset', 2);
killedBy: without NODE_ENV should default to development
statusReason: Expected values to be strictly equal:
+ actual - expected

+ undefined
- 'development'

[Killed] StringLiteral
lib/application.js:99:12
   this.enable('x-powered-by');
   this.set('etag', 'weak');
   this.set('env', env);
-  this.set('query parser', 'simple')
+  this.set("", 'simple')
   this.set('subdomain offset', 2);
   this.set('trust proxy', false);
killedBy: web-service GET /api/users with an invalid api key should respond with 401 unauthorized
statusReason: expected 401 "Unauthorized", got 400 "Bad Request"

[Timeout] StringLiteral
lib/application.js:100:12
   this.set('etag', 'weak');
   this.set('env', env);
   this.set('query parser', 'simple')
-  this.set('subdomain offset', 2);
+  this.set("", 2);
   this.set('trust proxy', false);
 

[Timeout] BooleanLiteral
lib/application.js:101:27
   this.set('env', env);
   this.set('query parser', 'simple')
   this.set('subdomain offset', 2);
-  this.set('trust proxy', false);
+  this.set('trust proxy', true);
 
   // trust proxy inherit back-compat

[Killed] ObjectLiteral
lib/application.js:104:65
   this.set('trust proxy', false);
 
   // trust proxy inherit back-compat
-  Object.defineProperty(this.settings, trustProxyDefaultSymbol, {
-    configurable: true,
-    value: true
-  });
+  Object.defineProperty(this.settings, trustProxyDefaultSymbol, {});
 
   debug('booting in %s mode', env);
killedBy: config .get() when mounted should inherit "trust proxy" setting
statusReason: false == [Function: fn]

[Killed] BooleanLiteral
lib/application.js:105:19
 
   // trust proxy inherit back-compat
   Object.defineProperty(this.settings, trustProxyDefaultSymbol, {
-    configurable: true,
+    configurable: false,
     value: true
   });
killedBy: config .set() "trust proxy" should set "trust proxy fn"
statusReason: Cannot redefine property: @@symbol:trust_proxy_default

[Killed] BooleanLiteral
lib/application.js:106:12
   // trust proxy inherit back-compat
   Object.defineProperty(this.settings, trustProxyDefaultSymbol, {
     configurable: true,
-    value: true
+    value: false
   });
 
killedBy: config .get() when mounted should inherit "trust proxy" setting
statusReason: false == [Function: fn]

[Killed] BlockStatement
lib/application.js:111:45
 
   debug('booting in %s mode', env);
 
-  this.on('mount', function onmount(parent) {
-    // inherit trust proxy
-    if (this.settings[trustProxyDefaultSymbol] === true
-      && typeof parent.settings['trust proxy fn'] === 'function') {
-      delete this.settings['trust proxy'];
-      delete this.settings['trust proxy fn'];
-    }
-
-    // inherit protos
-    setPrototypeOf(this.request, parent.request)
-    setPrototypeOf(this.response, parent.response)
-    setPrototypeOf(this.engines, parent.engines)
-    setPrototypeOf(this.settings, parent.settings)
-  });
+  this.on('mount', function onmount(parent) {});
 
   // setup locals
killedBy: mvc PUT /pet/2 should update the pet
statusReason: expected 302 "Found", got 500 "Internal Server Error"

[Killed] ConditionalExpression
lib/application.js:113:9
 
   this.on('mount', function onmount(parent) {
     // inherit trust proxy
-    if (this.settings[trustProxyDefaultSymbol] === true
-      && typeof parent.settings['trust proxy fn'] === 'function') {
+    if (false) {
       delete this.settings['trust proxy'];
       delete this.settings['trust proxy fn'];
killedBy: config .get() when mounted should inherit "trust proxy" setting
statusReason: false == [Function: fn]

[Killed] ConditionalExpression
lib/application.js:113:9
 
   this.on('mount', function onmount(parent) {
     // inherit trust proxy
-    if (this.settings[trustProxyDefaultSymbol] === true
-      && typeof parent.settings['trust proxy fn'] === 'function') {
+    if (true) {
       delete this.settings['trust proxy'];
       delete this.settings['trust proxy fn'];
killedBy: config .get() when mounted should prefer child "trust proxy" setting
statusReason: [Function: fn1] == [Function: fn2]

[Timeout] EqualityOperator
lib/application.js:114:10
   this.on('mount', function onmount(parent) {
     // inherit trust proxy
     if (this.settings[trustProxyDefaultSymbol] === true
-      && typeof parent.settings['trust proxy fn'] === 'function') {
+      && typeof parent.settings['trust proxy fn'] !== 'function') {
       delete this.settings['trust proxy'];
       delete this.settings['trust proxy fn'];

[Timeout] ConditionalExpression
lib/application.js:114:10
   this.on('mount', function onmount(parent) {
     // inherit trust proxy
     if (this.settings[trustProxyDefaultSymbol] === true
-      && typeof parent.settings['trust proxy fn'] === 'function') {
+      && true) {
       delete this.settings['trust proxy'];
       delete this.settings['trust proxy fn'];

[Timeout] StringLiteral
lib/application.js:115:28
     // inherit trust proxy
     if (this.settings[trustProxyDefaultSymbol] === true
       && typeof parent.settings['trust proxy fn'] === 'function') {
-      delete this.settings['trust proxy'];
+      delete this.settings[""];
       delete this.settings['trust proxy fn'];
     }

[Killed] EqualityOperator
lib/application.js:140:7
   this.set('views', resolve('views'));
   this.set('jsonp callback name', 'callback');
 
-  if (env === 'production') {
+  if (env !== 'production') {
     this.enable('view cache');
   }
killedBy: in development should disable "view cache"
statusReason: The expression evaluated to a falsy value:

  assert.strictEqual(blogAdmin.path(), '/blog/admin')

[Killed] ConditionalExpression
lib/application.js:140:7
   this.set('views', resolve('views'));
   this.set('jsonp callback name', 'callback');
 
-  if (env === 'production') {
+  if (true) {
     this.enable('view cache');
   }
killedBy: in development should disable "view cache"
statusReason: The expression evaluated to a falsy value:

  assert.strictEqual(blogAdmin.path(), '/blog/admin')

[Timeout] StringLiteral
lib/application.js:141:17
   this.set('jsonp callback name', 'callback');
 
   if (env === 'production') {
-    this.enable('view cache');
+    this.enable("");
   }
 };

[Killed] LogicalOperator
lib/application.js:156:14
 
 app.handle = function handle(req, res, callback) {
   // final handler
-  var done = callback || finalhandler(req, res, {
-    env: this.get('env'),
-    onerror: logerror.bind(this)
-  });
+  var done = callback && finalhandler(req, res, {
+  env: this.get('env'),
+  onerror: logerror.bind(this)
+});
 
   // set powered by header
killedBy: auth GET / should redirect to /login
statusReason: argument callback is required

[Killed] ConditionalExpression
lib/application.js:156:14
 
 app.handle = function handle(req, res, callback) {
   // final handler
-  var done = callback || finalhandler(req, res, {
-    env: this.get('env'),
-    onerror: logerror.bind(this)
-  });
+  var done = false;
 
   // set powered by header
killedBy: auth GET / should redirect to /login
statusReason: argument callback is required

[Timeout] StringLiteral
lib/application.js:157:19
 app.handle = function handle(req, res, callback) {
   // final handler
   var done = callback || finalhandler(req, res, {
-    env: this.get('env'),
+    env: this.get(""),
     onerror: logerror.bind(this)
   });

[Timeout] ConditionalExpression
lib/application.js:162:7
   });
 
   // set powered by header
-  if (this.enabled('x-powered-by')) {
+  if (false) {
     res.setHeader('X-Powered-By', 'Express');
   }

[Timeout] BlockStatement
lib/application.js:162:37
   });
 
   // set powered by header
-  if (this.enabled('x-powered-by')) {
-    res.setHeader('X-Powered-By', 'Express');
-  }
+  if (this.enabled('x-powered-by')) {}
 
   // set circular references

[Killed] StringLiteral
lib/application.js:163:19
 
   // set powered by header
   if (this.enabled('x-powered-by')) {
-    res.setHeader('X-Powered-By', 'Express');
+    res.setHeader("", 'Express');
   }
 
killedBy: auth GET / should redirect to /login
statusReason: Header name must be a valid HTTP token [""]

[Killed] ConditionalExpression
lib/application.js:175:7
   setPrototypeOf(res, this.response)
 
   // setup locals
-  if (!res.locals) {
+  if (true) {
     res.locals = Object.create(null);
   }
killedBy: mvc GET /users should display a list of users
statusReason: expected body '<!DOCTYPE html>\n' +
  '<html>\n' +
  '<head>\n' +
  '  <meta charset="utf-8">\n' +
  '  <meta name="viewport" content="width=device-width,initial-scale=1">\n' +
  '  <link rel="stylesheet" href="/style.css">\n' +
  '  <title>Users</title>\n' +
  '</head>\n' +

[Killed] BooleanLiteral
lib/application.js:175:7
   setPrototypeOf(res, this.response)
 
   // setup locals
-  if (!res.locals) {
+  if (res.locals) {
     res.locals = Object.create(null);
   }
killedBy: auth GET / should redirect to /login
statusReason: expected "Location" header field

[Killed] StringLiteral
lib/application.js:194:14
 
 app.use = function use(fn) {
   var offset = 0;
-  var path = '/';
+  var path = "";
 
   // default path to '/'
killedBy: app.mountpath should return the mounted path
statusReason: Expected values to be strictly equal:

'' !== '/'

[Timeout] ConditionalExpression
lib/application.js:198:7
 
   // default path to '/'
   // disambiguate app.use([fn])
-  if (typeof fn !== 'function') {
+  if (true) {
     var arg = fn;
 

[Killed] EqualityOperator
lib/application.js:201:34
   if (typeof fn !== 'function') {
     var arg = fn;
 
-    while (Array.isArray(arg) && arg.length !== 0) {
+    while (Array.isArray(arg) && arg.length === 0) {
       arg = arg[0];
     }
killedBy: app .use(middleware) should accept array of middleware
statusReason: app.use() requires a middleware function

[Timeout] ConditionalExpression
lib/application.js:201:12
   if (typeof fn !== 'function') {
     var arg = fn;
 
-    while (Array.isArray(arg) && arg.length !== 0) {
+    while (false) {
       arg = arg[0];
     }

[Timeout] ConditionalExpression
lib/application.js:206:9
     }
 
     // first arg is the path
-    if (typeof arg !== 'function') {
+    if (true) {
       offset = 1;
       path = fn;

[Killed] BlockStatement
lib/application.js:214:25
 
   var fns = flatten.call(slice.call(arguments, offset), Infinity);
 
-  if (fns.length === 0) {
-    throw new TypeError('app.use() requires a middleware function')
-  }
+  if (fns.length === 0) {}
 
   // get router
killedBy: app .use(path, middleware) should require middleware
statusReason: Missing expected exception: TypeError: app.use() requires a middleware function

[Timeout] ConditionalExpression
lib/application.js:214:7
 
   var fns = flatten.call(slice.call(arguments, offset), Infinity);
 
-  if (fns.length === 0) {
+  if (false) {
     throw new TypeError('app.use() requires a middleware function')
   }

[Killed] BlockStatement
lib/application.js:221:29
   // get router
   var router = this.router;
 
-  fns.forEach(function (fn) {
-    // non-express app
-    if (!fn || !fn.handle || !fn.set) {
-      return router.use(path, fn);
-    }
-
-    debug('.use app under %s', path);
-    fn.mountpath = path;
-    fn.parent = this;
-
-    // restore .app property on req and res
-    router.use(path, function mounted_app(req, res, next) {
-      var orig = req.app;
-      fn.handle(req, res, function (err) {
-        setPrototypeOf(req, orig.request)
-        setPrototypeOf(res, orig.response)
-        next(err);
-      });
-    });
-
-    // mounted an app
-    fn.emit('mount', this);
-  }, this);
+  fns.forEach(function (fn) {}, this);
 
   return this;
killedBy: auth GET /login should render login form
statusReason: expected 200 "OK", got 500 "Internal Server Error"

[Killed] BooleanLiteral
lib/application.js:223:9
 
   fns.forEach(function (fn) {
     // non-express app
-    if (!fn || !fn.handle || !fn.set) {
+    if (fn || !fn.handle || !fn.set) {
       return router.use(path, fn);
     }
killedBy: mvc PUT /pet/2 should update the pet
statusReason: expected 302 "Found", got 500 "Internal Server Error"

[Killed] ConditionalExpression
lib/application.js:223:9
 
   fns.forEach(function (fn) {
     // non-express app
-    if (!fn || !fn.handle || !fn.set) {
+    if (true) {
       return router.use(path, fn);
     }
killedBy: mvc PUT /pet/2 should update the pet
statusReason: expected 302 "Found", got 500 "Internal Server Error"

[Timeout] BlockStatement
lib/application.js:232:59
     fn.parent = this;
 
     // restore .app property on req and res
-    router.use(path, function mounted_app(req, res, next) {
-      var orig = req.app;
-      fn.handle(req, res, function (err) {
-        setPrototypeOf(req, orig.request)
-        setPrototypeOf(res, orig.response)
-        next(err);
-      });
-    });
+    router.use(path, function mounted_app(req, res, next) {});
 
     // mounted an app

[Timeout] BlockStatement
lib/application.js:234:42
     // restore .app property on req and res
     router.use(path, function mounted_app(req, res, next) {
       var orig = req.app;
-      fn.handle(req, res, function (err) {
-        setPrototypeOf(req, orig.request)
-        setPrototypeOf(res, orig.response)
-        next(err);
-      });
+      fn.handle(req, res, function (err) {});
     });
 

[Killed] BlockStatement
lib/application.js:296:39
  * @public
  */
 
-app.engine = function engine(ext, fn) {
-  if (typeof fn !== 'function') {
-    throw new Error('callback function required');
-  }
-
-  // get file extension
-  var extension = ext[0] !== '.'
-    ? '.' + ext
-    : ext;
-
-  // store engine
-  this.engines[extension] = fn;
-
-  return this;
-};
+app.engine = function engine(ext, fn) {};
 
 /**
killedBy: ejs GET / should respond with html
statusReason: expected body '<!DOCTYPE html>\n' +
  '<html lang="en">\n' +
  '<head>\n' +
  '<meta charset="utf-8">\n' +
  '<title>Error</title>\n' +
  '</head>\n' +
  '<body>\n' +

[Killed] BlockStatement
lib/application.js:297:33
  */
 
 app.engine = function engine(ext, fn) {
-  if (typeof fn !== 'function') {
-    throw new Error('callback function required');
-  }
+  if (typeof fn !== 'function') {}
 
   // get file extension
killedBy: app .engine(ext, fn) should throw when the callback is missing
statusReason: Missing expected exception.

[Timeout] ConditionalExpression
lib/application.js:297:7
  */
 
 app.engine = function engine(ext, fn) {
-  if (typeof fn !== 'function') {
+  if (false) {
     throw new Error('callback function required');
   }

[Killed] StringLiteral
lib/application.js:298:21
 
 app.engine = function engine(ext, fn) {
   if (typeof fn !== 'function') {
-    throw new Error('callback function required');
+    throw new Error("");
   }
 
killedBy: app .engine(ext, fn) should throw when the callback is missing
statusReason: The input did not match the regular expression /callback function required/. Input:

'Error'

[Killed] EqualityOperator
lib/application.js:302:19
   }
 
   // get file extension
-  var extension = ext[0] !== '.'
+  var extension = ext[0] === '.'
     ? '.' + ext
     : ext;
killedBy: ejs GET / should respond with html
statusReason: expected body '<!DOCTYPE html>\n' +
  '<html lang="en">\n' +
  '<head>\n' +
  '<meta charset="utf-8">\n' +
  '<title>Error</title>\n' +
  '</head>\n' +
  '<body>\n' +

[Killed] ConditionalExpression
lib/application.js:302:19
   }
 
   // get file extension
-  var extension = ext[0] !== '.'
+  var extension = false
     ? '.' + ext
     : ext;
killedBy: markdown GET / should respond with html
statusReason: expected body '<!DOCTYPE html>\n' +
  '<html lang="en">\n' +
  '<head>\n' +
  '<meta charset="utf-8">\n' +
  '<title>Error</title>\n' +
  '</head>\n' +
  '<body>\n' +

[Killed] BlockStatement
lib/application.js:324:38
  * @public
  */
 
-app.param = function param(name, fn) {
-  if (Array.isArray(name)) {
-    for (var i = 0; i < name.length; i++) {
-      this.param(name[i], fn);
-    }
-
-    return this;
-  }
-
-  this.router.param(name, fn);
-
-  return this;
-};
+app.param = function param(name, fn) {};
 
 /**
killedBy: params GET /user/0 should respond with a user
statusReason: expected body '<!DOCTYPE html>\n' +
  '<html lang="en">\n' +
  '<head>\n' +
  '<meta charset="utf-8">\n' +
  '<title>Error</title>\n' +
  '</head>\n' +
  '<body>\n' +

[Killed] BlockStatement
lib/application.js:326:43
 
 app.param = function param(name, fn) {
   if (Array.isArray(name)) {
-    for (var i = 0; i < name.length; i++) {
-      this.param(name[i], fn);
-    }
+    for (var i = 0; i < name.length; i++) {}
 
     return this;
killedBy: params GET /users/foo-bar should fail integer parsing
statusReason: expected 400 "Bad Request", got 200 "OK"

[Killed] ConditionalExpression
lib/application.js:326:21
 
 app.param = function param(name, fn) {
   if (Array.isArray(name)) {
-    for (var i = 0; i < name.length; i++) {
+    for (var i = 0; false; i++) {
       this.param(name[i], fn);
     }
killedBy: params GET /users/foo-bar should fail integer parsing
statusReason: expected 400 "Bad Request", got 200 "OK"

[Killed] EqualityOperator
lib/application.js:354:7
  */
 
 app.set = function set(setting, val) {
-  if (arguments.length === 1) {
+  if (arguments.length !== 1) {
     // app.get(setting)
     return this.settings[setting];
killedBy: auth GET /login should render login form
statusReason: expected 200 "OK", got 500 "Internal Server Error"

[Killed] ConditionalExpression
lib/application.js:354:7
  */
 
 app.set = function set(setting, val) {
-  if (arguments.length === 1) {
+  if (false) {
     // app.get(setting)
     return this.settings[setting];
killedBy: auth GET /login should render login form
statusReason: expected 200 "OK", got 500 "Internal Server Error"

[Timeout] StringLiteral
lib/application.js:359:9
     return this.settings[setting];
   }
 
-  debug('set "%s" to %o', setting, val);
+  debug("", setting, val);
 
   // set value

[Killed] StringLiteral
lib/application.js:370:16
       this.set('etag fn', compileETag(val));
       break;
     case 'query parser':
-      this.set('query parser fn', compileQueryParser(val));
+      this.set("", compileQueryParser(val));
       break;
     case 'trust proxy':
killedBy: web-service GET /api/users with an invalid api key should respond with 401 unauthorized
statusReason: expected 401 "Unauthorized", got 400 "Bad Request"

[Killed] ConditionalExpression
lib/application.js:372:5
     case 'query parser':
       this.set('query parser fn', compileQueryParser(val));
       break;
-    case 'trust proxy':
-      this.set('trust proxy fn', compileTrust(val));
-
-      // trust proxy inherit back-compat
-      Object.defineProperty(this.settings, trustProxyDefaultSymbol, {
-        configurable: true,
-        value: false
-      });
-
-      break;
+    case 'trust proxy':
   }
 
killedBy: cookie-sessions GET / should set a session cookie
statusReason: expected "Set-Cookie" header field

[Timeout] BooleanLiteral
lib/application.js:378:16
       // trust proxy inherit back-compat
       Object.defineProperty(this.settings, trustProxyDefaultSymbol, {
         configurable: true,
-        value: false
+        value: true
       });
 

[Killed] BlockStatement
lib/application.js:401:28
  * @private
  */
 
-app.path = function path() {
-  return this.parent
-    ? this.parent.path() + this.mountpath
-    : '';
-};
+app.path = function path() {};
 
 /**
killedBy: app.path() should return the canonical
statusReason: Expected values to be strictly equal:

undefined !== ''

[Killed] ArithmeticOperator
lib/application.js:403:7
 
 app.path = function path() {
   return this.parent
-    ? this.parent.path() + this.mountpath
+    ? this.parent.path() - this.mountpath
     : '';
 };
killedBy: app.path() should return the canonical
statusReason: Expected values to be strictly equal:

NaN !== '/blog'

[Killed] BlockStatement
lib/application.js:422:41
  * @public
  */
 
-app.enabled = function enabled(setting) {
-  return Boolean(this.set(setting));
-};
+app.enabled = function enabled(setting) {};
 
 /**
killedBy: in production should enable "view cache"
statusReason: The expression evaluated to a falsy value:

  it('should disable "view cache"', function(){
   var app = express();
   assert.ok(!app.enabled('view cache'))
  })

[Killed] BlockStatement
lib/application.js:441:43
  * @public
  */
 
-app.disabled = function disabled(setting) {
-  return !this.set(setting);
-};
+app.disabled = function disabled(setting) {};
 
 /**
killedBy: config .disabled() should default to true
statusReason: Expected values to be strictly equal:
+ actual - expected

+ undefined
- true

[Killed] BooleanLiteral
lib/application.js:442:10
  */
 
 app.disabled = function disabled(setting) {
-  return !this.set(setting);
+  return this.set(setting);
 };
 
killedBy: config .disabled() should default to true
statusReason: Expected values to be strictly equal:
+ actual - expected

+ undefined
- true

[Killed] BlockStatement
lib/application.js:453:39
  * @public
  */
 
-app.enable = function enable(setting) {
-  return this.set(setting, true);
-};
+app.enable = function enable(setting) {};
 
 /**
killedBy: in production should enable "view cache"
statusReason: The expression evaluated to a falsy value:

  it('should disable "view cache"', function(){
   var app = express();
   assert.ok(!app.enabled('view cache'))
  })

[Killed] BooleanLiteral
lib/application.js:454:28
  */
 
 app.enable = function enable(setting) {
-  return this.set(setting, true);
+  return this.set(setting, false);
 };
 
killedBy: in production should enable "view cache"
statusReason: The expression evaluated to a falsy value:

  it('should disable "view cache"', function(){
   var app = express();
   assert.ok(!app.enabled('view cache'))
  })

[Killed] BlockStatement
lib/application.js:465:41
  * @public
  */
 
-app.disable = function disable(setting) {
-  return this.set(setting, false);
-};
+app.disable = function disable(setting) {};
 
 /**
killedBy: config .disable() should set the value to false
statusReason: undefined == <ref *1> [Function: app] {
    'm-search': [Function (anonymous)],
    _events: [Object: null prototype] {
    mount: [Function: onmount]
  },
    _eventsCount: 1,
    _maxListeners: undefined,
    acl: [Function (anonymous)],

[Killed] BooleanLiteral
lib/application.js:466:28
  */
 
 app.disable = function disable(setting) {
-  return this.set(setting, false);
+  return this.set(setting, true);
 };
 
killedBy: config .disable() should set the value to false
statusReason: Expected values to be strictly equal:

true !== false

[Killed] BlockStatement
lib/application.js:474:31
  */
 
 methods.forEach(function(method){
-  app[method] = function(path){
-    if (method === 'get' && arguments.length === 1) {
-      // app.get(setting)
-      return this.set(path);
-    }
-
-    var route = this.route(path);
-    route[method].apply(route, slice.call(arguments, 1));
-    return this;
-  };
+  app[method] = function(path){};
 });
 
killedBy: auth GET / should redirect to /login
statusReason: expected "Location" header field

[Killed] ConditionalExpression
lib/application.js:475:9
 
 methods.forEach(function(method){
   app[method] = function(path){
-    if (method === 'get' && arguments.length === 1) {
+    if (true) {
       // app.get(setting)
       return this.set(path);
killedBy: auth GET / should redirect to /login
statusReason: expected "Location" header field

[Killed] LogicalOperator
lib/application.js:475:9
 
 methods.forEach(function(method){
   app[method] = function(path){
-    if (method === 'get' && arguments.length === 1) {
+    if (method === 'get' || arguments.length === 1) {
       // app.get(setting)
       return this.set(path);
killedBy: auth GET / should redirect to /login
statusReason: expected "Location" header field

[Killed] BlockStatement
lib/application.js:496:30
  * @public
  */
 
-app.all = function all(path) {
-  var route = this.route(path);
-  var args = slice.call(arguments, 1);
-
-  for (var i = 0; i < methods.length; i++) {
-    route[methods[i]].apply(route, args);
-  }
-
-  return this;
-};
+app.all = function all(path) {};
 
 /**
killedBy: route-separation GET /user/:id should get a user
statusReason: expected 200 "OK", got 500 "Internal Server Error"

[Killed] ConditionalExpression
lib/application.js:500:19
   var route = this.route(path);
   var args = slice.call(arguments, 1);
 
-  for (var i = 0; i < methods.length; i++) {
+  for (var i = 0; false; i++) {
     route[methods[i]].apply(route, args);
   }
killedBy: route-separation GET /user/:id should get a user
statusReason: expected 200 "OK", got 500 "Internal Server Error"

[Killed] BlockStatement
lib/application.js:500:44
   var route = this.route(path);
   var args = slice.call(arguments, 1);
 
-  for (var i = 0; i < methods.length; i++) {
-    route[methods[i]].apply(route, args);
-  }
+  for (var i = 0; i < methods.length; i++) {}
 
   return this;
killedBy: route-separation GET /user/:id should get a user
statusReason: expected 200 "OK", got 500 "Internal Server Error"

[Killed] EqualityOperator
lib/application.js:533:7
   var view;
 
   // support callback function as second arg
-  if (typeof options === 'function') {
+  if (typeof options !== 'function') {
     done = options;
     opts = {};
killedBy: auth GET /login should render login form
statusReason: callback.apply is not a function

[Killed] ConditionalExpression
lib/application.js:533:7
   var view;
 
   // support callback function as second arg
-  if (typeof options === 'function') {
+  if (false) {
     done = options;
     opts = {};
killedBy: app .engine(ext, fn) should map a template engine
statusReason: Cannot read properties of undefined (reading 'apply')

[Killed] BlockStatement
lib/application.js:542:21
   merge(renderOptions, this.locals);
 
   // merge options._locals
-  if (opts._locals) {
-    merge(renderOptions, opts._locals);
-  }
+  if (opts._locals) {}
 
   // merge options
killedBy: auth GET /login should render login form
statusReason: expected 200 "OK", got 500 "Internal Server Error"

[Killed] ConditionalExpression
lib/application.js:542:7
   merge(renderOptions, this.locals);
 
   // merge options._locals
-  if (opts._locals) {
+  if (false) {
     merge(renderOptions, opts._locals);
   }
killedBy: auth GET /login should render login form
statusReason: expected 200 "OK", got 500 "Internal Server Error"
