[Killed] ConditionalExpression
lib/application.js:550:7
   merge(renderOptions, opts);
 
   // set .cache unless explicitly provided
-  if (renderOptions.cache == null) {
+  if (true) {
     renderOptions.cache = this.enabled('view cache');
   }
killedBy: mvc GET /users should display a list of users
statusReason: expected body '<!DOCTYPE html>\n' +
  '<html>\n' +
  '<head>\n' +
  '  <meta charset="utf-8">\n' +
  '  <meta name="viewport" content="width=device-width,initial-scale=1">\n' +
  '  <link rel="stylesheet" href="/style.css">\n' +
  '  <title>Users</title>\n' +
  '</head>\n' +

[Killed] ConditionalExpression
lib/application.js:550:7
   merge(renderOptions, opts);
 
   // set .cache unless explicitly provided
-  if (renderOptions.cache == null) {
+  if (false) {
     renderOptions.cache = this.enabled('view cache');
   }
killedBy: mvc GET /users should display a list of users
statusReason: expected body '<!DOCTYPE html>\n' +
  '<html>\n' +
  '<head>\n' +
  '  <meta charset="utf-8">\n' +
  '  <meta name="viewport" content="width=device-width,initial-scale=1">\n' +
  '  <link rel="stylesheet" href="/style.css">\n' +
  '  <title>Users</title>\n' +
  '</head>\n' +

[Killed] ConditionalExpression
lib/application.js:555:7
   }
 
   // primed cache
-  if (renderOptions.cache) {
+  if (false) {
     view = cache[name];
   }
killedBy: mvc GET /users should display a list of users
statusReason: expected body '<!DOCTYPE html>\n' +
  '<html>\n' +
  '<head>\n' +
  '  <meta charset="utf-8">\n' +
  '  <meta name="viewport" content="width=device-width,initial-scale=1">\n' +
  '  <link rel="stylesheet" href="/style.css">\n' +
  '  <title>Users</title>\n' +
  '</head>\n' +

[Killed] ConditionalExpression
lib/application.js:555:7
   }
 
   // primed cache
-  if (renderOptions.cache) {
+  if (true) {
     view = cache[name];
   }
killedBy: mvc GET /users should display a list of users
statusReason: expected body '<!DOCTYPE html>\n' +
  '<html>\n' +
  '<head>\n' +
  '  <meta charset="utf-8">\n' +
  '  <meta name="viewport" content="width=device-width,initial-scale=1">\n' +
  '  <link rel="stylesheet" href="/style.css">\n' +
  '  <title>Users</title>\n' +
  '</head>\n' +

[Killed] BlockStatement
lib/application.js:560:14
   }
 
   // view
-  if (!view) {
-    var View = this.get('view');
-
-    view = new View(name, {
-      defaultEngine: this.get('view engine'),
-      root: this.get('views'),
-      engines: engines
-    });
-
-    if (!view.path) {
-      var dirs = Array.isArray(view.root) && view.root.length > 1
-        ? 'directories "' + view.root.slice(0, -1).join('", "') + '" or "' + view.root[view.root.length - 1] + '"'
-        : 'directory "' + view.root + '"'
-      var err = new Error('Failed to lookup view "' + name + '" in views ' + dirs);
-      err.view = view;
-      return done(err);
-    }
-
-    // prime the cache
-    if (renderOptions.cache) {
-      cache[name] = view;
-    }
-  }
+  if (!view) {}
 
   // render
killedBy: auth GET /login should render login form
statusReason: expected 200 "OK", got 500 "Internal Server Error"

[Killed] ConditionalExpression
lib/application.js:560:7
   }
 
   // view
-  if (!view) {
+  if (true) {
     var View = this.get('view');
 
killedBy: mvc GET /users should display a list of users
statusReason: expected body '<!DOCTYPE html>\n' +
  '<html>\n' +
  '<head>\n' +
  '  <meta charset="utf-8">\n' +
  '  <meta name="viewport" content="width=device-width,initial-scale=1">\n' +
  '  <link rel="stylesheet" href="/style.css">\n' +
  '  <title>Users</title>\n' +
  '</head>\n' +

[Killed] StringLiteral
lib/application.js:561:25
 
   // view
   if (!view) {
-    var View = this.get('view');
+    var View = this.get("");
 
     view = new View(name, {
killedBy: auth GET /login should render login form
statusReason: expected 200 "OK", got 500 "Internal Server Error"

[Killed] BlockStatement
lib/application.js:569:21
       engines: engines
     });
 
-    if (!view.path) {
-      var dirs = Array.isArray(view.root) && view.root.length > 1
-        ? 'directories "' + view.root.slice(0, -1).join('", "') + '" or "' + view.root[view.root.length - 1] + '"'
-        : 'directory "' + view.root + '"'
-      var err = new Error('Failed to lookup view "' + name + '" in views ' + dirs);
-      err.view = view;
-      return done(err);
-    }
+    if (!view.path) {}
 
     // prime the cache
killedBy: app .render(name, fn) when the file does not exist should provide a helpful error
statusReason: 'The "path" argument must be of type string or an instance of Buffer or URL. Received undefined' == 'Failed to lookup view "rawr.tmpl" in views directory "C:\\Users\\teeya\\Documents\\school\\CMPT473\\ex3\\cmpt473-ex3-express\\.stryker-tmp\\sandbox9898099\\test\\fixtures"'

[Killed] ConditionalExpression
lib/application.js:569:9
       engines: engines
     });
 
-    if (!view.path) {
+    if (false) {
       var dirs = Array.isArray(view.root) && view.root.length > 1
         ? 'directories "' + view.root.slice(0, -1).join('", "') + '" or "' + view.root[view.root.length - 1] + '"'
killedBy: mvc GET /users should display a list of users
statusReason: expected body '<!DOCTYPE html>\n' +
  '<html>\n' +
  '<head>\n' +
  '  <meta charset="utf-8">\n' +
  '  <meta name="viewport" content="width=device-width,initial-scale=1">\n' +
  '  <link rel="stylesheet" href="/style.css">\n' +
  '  <title>Users</title>\n' +
  '</head>\n' +

[Killed] ConditionalExpression
lib/application.js:570:18
     });
 
     if (!view.path) {
-      var dirs = Array.isArray(view.root) && view.root.length > 1
+      var dirs = true
         ? 'directories "' + view.root.slice(0, -1).join('", "') + '" or "' + view.root[view.root.length - 1] + '"'
         : 'directory "' + view.root + '"'
killedBy: app .render(name, fn) when the file does not exist should provide a helpful error
statusReason: view.root.slice(...).join is not a function

[Killed] ConditionalExpression
lib/application.js:570:18
     });
 
     if (!view.path) {
-      var dirs = Array.isArray(view.root) && view.root.length > 1
+      var dirs = false
         ? 'directories "' + view.root.slice(0, -1).join('", "') + '" or "' + view.root[view.root.length - 1] + '"'
         : 'directory "' + view.root + '"'
killedBy: app .render(name, fn) when "views" is given when array of paths should error if file does not exist

[Killed] ArithmeticOperator
lib/application.js:571:88
 
     if (!view.path) {
       var dirs = Array.isArray(view.root) && view.root.length > 1
-        ? 'directories "' + view.root.slice(0, -1).join('", "') + '" or "' + view.root[view.root.length - 1] + '"'
+        ? 'directories "' + view.root.slice(0, -1).join('", "') + '" or "' + view.root[view.root.length + 1] + '"'
         : 'directory "' + view.root + '"'
       var err = new Error('Failed to lookup view "' + name + '" in views ' + dirs);
killedBy: app .render(name, fn) when "views" is given when array of paths should error if file does not exist

[Killed] MethodExpression
lib/application.js:571:29
 
     if (!view.path) {
       var dirs = Array.isArray(view.root) && view.root.length > 1
-        ? 'directories "' + view.root.slice(0, -1).join('", "') + '" or "' + view.root[view.root.length - 1] + '"'
+        ? 'directories "' + view.root.join('", "') + '" or "' + view.root[view.root.length - 1] + '"'
         : 'directory "' + view.root + '"'
       var err = new Error('Failed to lookup view "' + name + '" in views ' + dirs);
killedBy: app .render(name, fn) when "views" is given when array of paths should error if file does not exist

[Killed] StringLiteral
lib/application.js:573:62
       var dirs = Array.isArray(view.root) && view.root.length > 1
         ? 'directories "' + view.root.slice(0, -1).join('", "') + '" or "' + view.root[view.root.length - 1] + '"'
         : 'directory "' + view.root + '"'
-      var err = new Error('Failed to lookup view "' + name + '" in views ' + dirs);
+      var err = new Error('Failed to lookup view "' + name + "" + dirs);
       err.view = view;
       return done(err);
killedBy: app .render(name, fn) when the file does not exist should provide a helpful error

[Killed] ConditionalExpression
lib/application.js:579:9
     }
 
     // prime the cache
-    if (renderOptions.cache) {
+    if (true) {
       cache[name] = view;
     }
killedBy: mvc GET /users should display a list of users
statusReason: expected body '<!DOCTYPE html>\n' +
  '<html>\n' +
  '<head>\n' +
  '  <meta charset="utf-8">\n' +
  '  <meta name="viewport" content="width=device-width,initial-scale=1">\n' +
  '  <link rel="stylesheet" href="/style.css">\n' +
  '  <title>Users</title>\n' +
  '</head>\n' +

[Killed] ConditionalExpression
lib/application.js:579:9
     }
 
     // prime the cache
-    if (renderOptions.cache) {
+    if (false) {
       cache[name] = view;
     }
killedBy: mvc GET /users should display a list of users
statusReason: expected body '<!DOCTYPE html>\n' +
  '<html>\n' +
  '<head>\n' +
  '  <meta charset="utf-8">\n' +
  '  <meta name="viewport" content="width=device-width,initial-scale=1">\n' +
  '  <link rel="stylesheet" href="/style.css">\n' +
  '  <title>Users</title>\n' +
  '</head>\n' +

[Timeout] BlockStatement
lib/application.js:609:33
  * @public
  */
 
-app.listen = function listen () {
-  var server = http.createServer(this)
-  var args = Array.prototype.slice.call(arguments)
-  if (typeof args[args.length - 1] === 'function') {
-    var done = args[args.length - 1] = once(args[args.length - 1])
-    server.once('error', done)
-  }
-  return server.listen.apply(server, args)
-}
+app.listen = function listen () {}
 
 /**

[Killed] BlockStatement
lib/application.js:612:52
 app.listen = function listen () {
   var server = http.createServer(this)
   var args = Array.prototype.slice.call(arguments)
-  if (typeof args[args.length - 1] === 'function') {
-    var done = args[args.length - 1] = once(args[args.length - 1])
-    server.once('error', done)
-  }
+  if (typeof args[args.length - 1] === 'function') {}
   return server.listen.apply(server, args)
 }
killedBy: app.listen() should callback on HTTP server errors
statusReason: listen EADDRINUSE: address already in use :::63526

[Killed] ArithmeticOperator
lib/application.js:612:19
 app.listen = function listen () {
   var server = http.createServer(this)
   var args = Array.prototype.slice.call(arguments)
-  if (typeof args[args.length - 1] === 'function') {
+  if (typeof args[args.length + 1] === 'function') {
     var done = args[args.length - 1] = once(args[args.length - 1])
     server.once('error', done)
killedBy: app.listen() should callback on HTTP server errors
statusReason: listen EADDRINUSE: address already in use :::63522

[Killed] ArithmeticOperator
lib/application.js:613:50
   var server = http.createServer(this)
   var args = Array.prototype.slice.call(arguments)
   if (typeof args[args.length - 1] === 'function') {
-    var done = args[args.length - 1] = once(args[args.length - 1])
+    var done = args[args.length - 1] = once(args[args.length + 1])
     server.once('error', done)
   }
killedBy: app.listen() should wrap with an HTTP server
statusReason: Cannot convert undefined or null to object

[Survived] ArithmeticOperator
lib/application.js:613:21
   var server = http.createServer(this)
   var args = Array.prototype.slice.call(arguments)
   if (typeof args[args.length - 1] === 'function') {
-    var done = args[args.length - 1] = once(args[args.length - 1])
+    var done = args[args.length + 1] = once(args[args.length - 1])
     server.once('error', done)
   }

[Killed] StringLiteral
lib/application.js:614:17
   var args = Array.prototype.slice.call(arguments)
   if (typeof args[args.length - 1] === 'function') {
     var done = args[args.length - 1] = once(args[args.length - 1])
-    server.once('error', done)
+    server.once("", done)
   }
   return server.listen.apply(server, args)
killedBy: app.listen() should callback on HTTP server errors
statusReason: listen EADDRINUSE: address already in use :::63530

[Survived] BlockStatement
lib/application.js:626:24
  * @private
  */
 
-function logerror(err) {
-  /* istanbul ignore next */
-  if (this.get('env') !== 'test') console.error(err.stack || err.toString());
-}
+function logerror(err) {}
 
 /**

[Survived] EqualityOperator
lib/application.js:628:7
 
 function logerror(err) {
   /* istanbul ignore next */
-  if (this.get('env') !== 'test') console.error(err.stack || err.toString());
+  if (this.get('env') === 'test') console.error(err.stack || err.toString());
 }
 

[Timeout] ConditionalExpression
lib/application.js:628:49
 
 function logerror(err) {
   /* istanbul ignore next */
-  if (this.get('env') !== 'test') console.error(err.stack || err.toString());
+  if (this.get('env') !== 'test') console.error(false);
 }
 

[Timeout] BlockStatement
lib/application.js:636:45
  * @private
  */
 
-function tryRender(view, options, callback) {
-  try {
-    view.render(options, callback);
-  } catch (err) {
-    callback(err);
-  }
-}
+function tryRender(view, options, callback) {}
 

[Timeout] BlockStatement
lib/application.js:637:7
  */
 
 function tryRender(view, options, callback) {
-  try {
-    view.render(options, callback);
-  } catch (err) {
+  try {} catch (err) {
     callback(err);
   }

[Timeout] BlockStatement
lib/application.js:639:17
 function tryRender(view, options, callback) {
   try {
     view.render(options, callback);
-  } catch (err) {
-    callback(err);
-  }
+  } catch (err) {}
 }
 
