[Timeout] BlockStatement
lib/request.js:64:36
  */
 
 req.get =
-req.header = function header(name) {
-  if (!name) {
-    throw new TypeError('name argument is required to req.get');
-  }
-
-  if (typeof name !== 'string') {
-    throw new TypeError('name must be a string to req.get');
-  }
-
-  var lc = name.toLowerCase();
-
-  switch (lc) {
-    case 'referer':
-    case 'referrer':
-      return this.headers.referrer
-        || this.headers.referer;
-    default:
-      return this.headers[lc];
-  }
-};
+req.header = function header(name) {};
 
 /**

[Timeout] BooleanLiteral
lib/request.js:65:7
 
 req.get =
 req.header = function header(name) {
-  if (!name) {
+  if (name) {
     throw new TypeError('name argument is required to req.get');
   }

[Timeout] ConditionalExpression
lib/request.js:65:7
 
 req.get =
 req.header = function header(name) {
-  if (!name) {
+  if (true) {
     throw new TypeError('name argument is required to req.get');
   }

[Timeout] BlockStatement
lib/request.js:69:33
     throw new TypeError('name argument is required to req.get');
   }
 
-  if (typeof name !== 'string') {
-    throw new TypeError('name must be a string to req.get');
-  }
+  if (typeof name !== 'string') {}
 
   var lc = name.toLowerCase();

[Timeout] ConditionalExpression
lib/request.js:69:7
     throw new TypeError('name argument is required to req.get');
   }
 
-  if (typeof name !== 'string') {
+  if (true) {
     throw new TypeError('name must be a string to req.get');
   }

[Timeout] MethodExpression
lib/request.js:73:12
     throw new TypeError('name must be a string to req.get');
   }
 
-  var lc = name.toLowerCase();
+  var lc = name.toUpperCase();
 
   switch (lc) {

[Timeout] StringLiteral
lib/request.js:76:10
   var lc = name.toLowerCase();
 
   switch (lc) {
-    case 'referer':
+    case "":
     case 'referrer':
       return this.headers.referrer

[Timeout] ConditionalExpression
lib/request.js:77:5
 
   switch (lc) {
     case 'referer':
-    case 'referrer':
-      return this.headers.referrer
-        || this.headers.referer;
+    case 'referrer':
     default:
       return this.headers[lc];

[Timeout] StringLiteral
lib/request.js:77:10
 
   switch (lc) {
     case 'referer':
-    case 'referrer':
+    case "":
       return this.headers.referrer
         || this.headers.referer;

[Timeout] ConditionalExpression
lib/request.js:78:14
   switch (lc) {
     case 'referer':
     case 'referrer':
-      return this.headers.referrer
-        || this.headers.referer;
+      return false;
     default:
       return this.headers[lc];

[Timeout] ConditionalExpression
lib/request.js:78:14
   switch (lc) {
     case 'referer':
     case 'referrer':
-      return this.headers.referrer
-        || this.headers.referer;
+      return true;
     default:
       return this.headers[lc];

[Timeout] ConditionalExpression
lib/request.js:80:5
     case 'referrer':
       return this.headers.referrer
         || this.headers.referer;
-    default:
-      return this.headers[lc];
+    default:
   }
 };

[Timeout] BlockStatement
lib/request.js:131:25
  * @public
  */
 
-req.accepts = function(){
-  var accept = accepts(this);
-  return accept.types.apply(accept, arguments);
-};
+req.accepts = function(){};
 
 /**

[Timeout] BlockStatement
lib/request.js:144:34
  * @public
  */
 
-req.acceptsEncodings = function(){
-  var accept = accepts(this);
-  return accept.encodings.apply(accept, arguments);
-};
+req.acceptsEncodings = function(){};
 
 /**

[Timeout] BlockStatement
lib/request.js:158:33
  * @public
  */
 
-req.acceptsCharsets = function(){
-  var accept = accepts(this);
-  return accept.charsets.apply(accept, arguments);
-};
+req.acceptsCharsets = function(){};
 
 /**

[Timeout] BlockStatement
lib/request.js:172:34
  * @public
  */
 
-req.acceptsLanguages = function(){
-  var accept = accepts(this);
-  return accept.languages.apply(accept, arguments);
-};
+req.acceptsLanguages = function(){};
 
 /**

[Timeout] BlockStatement
lib/request.js:202:43
  * @public
  */
 
-req.range = function range(size, options) {
-  var range = this.get('Range');
-  if (!range) return;
-  return parseRange(size, range, options);
-};
+req.range = function range(size, options) {};
 
 /**

[Timeout] StringLiteral
lib/request.js:203:24
  */
 
 req.range = function range(size, options) {
-  var range = this.get('Range');
+  var range = this.get("");
   if (!range) return;
   return parseRange(size, range, options);

[Timeout] ConditionalExpression
lib/request.js:204:7
 
 req.range = function range(size, options) {
   var range = this.get('Range');
-  if (!range) return;
+  if (true) return;
   return parseRange(size, range, options);
 };

[Timeout] BooleanLiteral
lib/request.js:204:7
 
 req.range = function range(size, options) {
   var range = this.get('Range');
-  if (!range) return;
+  if (range) return;
   return parseRange(size, range, options);
 };

[Timeout] BlockStatement
lib/request.js:218:44
  * @api public
  */
 
-defineGetter(req, 'query', function query(){
-  var queryparse = this.app.get('query parser fn');
-
-  if (!queryparse) {
-    // parsing is disabled
-    return Object.create(null);
-  }
-
-  var querystring = parse(this).query;
-
-  return queryparse(querystring);
-});
+defineGetter(req, 'query', function query(){});
 
 /**

[Timeout] BooleanLiteral
lib/request.js:221:7
 defineGetter(req, 'query', function query(){
   var queryparse = this.app.get('query parser fn');
 
-  if (!queryparse) {
+  if (queryparse) {
     // parsing is disabled
     return Object.create(null);

[Timeout] BlockStatement
lib/request.js:221:20
 defineGetter(req, 'query', function query(){
   var queryparse = this.app.get('query parser fn');
 
-  if (!queryparse) {
-    // parsing is disabled
-    return Object.create(null);
-  }
+  if (!queryparse) {}
 
   var querystring = parse(this).query;

[Timeout] BlockStatement
lib/request.js:257:29
  * @public
  */
 
-req.is = function is(types) {
-  var arr = types;
-
-  // support flattened arguments
-  if (!Array.isArray(types)) {
-    arr = new Array(arguments.length);
-    for (var i = 0; i < arr.length; i++) {
-      arr[i] = arguments[i];
-    }
-  }
-
-  return typeis(this, arr);
-};
+req.is = function is(types) {};
 
 /**

[Timeout] ConditionalExpression
lib/request.js:261:7
   var arr = types;
 
   // support flattened arguments
-  if (!Array.isArray(types)) {
+  if (false) {
     arr = new Array(arguments.length);
     for (var i = 0; i < arr.length; i++) {

[Timeout] BlockStatement
lib/request.js:261:30
   var arr = types;
 
   // support flattened arguments
-  if (!Array.isArray(types)) {
-    arr = new Array(arguments.length);
-    for (var i = 0; i < arr.length; i++) {
-      arr[i] = arguments[i];
-    }
-  }
+  if (!Array.isArray(types)) {}
 
   return typeis(this, arr);

[Timeout] EqualityOperator
lib/request.js:263:21
   // support flattened arguments
   if (!Array.isArray(types)) {
     arr = new Array(arguments.length);
-    for (var i = 0; i < arr.length; i++) {
+    for (var i = 0; i <= arr.length; i++) {
       arr[i] = arguments[i];
     }

[Timeout] BlockStatement
lib/request.js:263:42
   // support flattened arguments
   if (!Array.isArray(types)) {
     arr = new Array(arguments.length);
-    for (var i = 0; i < arr.length; i++) {
-      arr[i] = arguments[i];
-    }
+    for (var i = 0; i < arr.length; i++) {}
   }
 

[Timeout] BlockStatement
lib/request.js:285:50
  * @public
  */
 
-defineGetter(req, 'protocol', function protocol(){
-  var proto = this.connection.encrypted
-    ? 'https'
-    : 'http';
-  var trust = this.app.get('trust proxy fn');
-
-  if (!trust(this.connection.remoteAddress, 0)) {
-    return proto;
-  }
-
-  // Note: X-Forwarded-Proto is normally only ever a
-  //       single value, but this is to be safe.
-  var header = this.get('X-Forwarded-Proto') || proto
-  var index = header.indexOf(',')
-
-  return index !== -1
-    ? header.substring(0, index).trim()
-    : header.trim()
-});
+defineGetter(req, 'protocol', function protocol(){});
 
 /**

[Timeout] StringLiteral
lib/request.js:285:19
  * @public
  */
 
-defineGetter(req, 'protocol', function protocol(){
+defineGetter(req, "", function protocol(){
   var proto = this.connection.encrypted
     ? 'https'

[Timeout] StringLiteral
lib/request.js:287:7
 
 defineGetter(req, 'protocol', function protocol(){
   var proto = this.connection.encrypted
-    ? 'https'
+    ? ""
     : 'http';
   var trust = this.app.get('trust proxy fn');

[Timeout] ConditionalExpression
lib/request.js:291:7
     : 'http';
   var trust = this.app.get('trust proxy fn');
 
-  if (!trust(this.connection.remoteAddress, 0)) {
+  if (false) {
     return proto;
   }

[Timeout] BlockStatement
lib/request.js:291:49
     : 'http';
   var trust = this.app.get('trust proxy fn');
 
-  if (!trust(this.connection.remoteAddress, 0)) {
-    return proto;
-  }
+  if (!trust(this.connection.remoteAddress, 0)) {}
 
   // Note: X-Forwarded-Proto is normally only ever a

[Timeout] ConditionalExpression
lib/request.js:297:16
 
   // Note: X-Forwarded-Proto is normally only ever a
   //       single value, but this is to be safe.
-  var header = this.get('X-Forwarded-Proto') || proto
+  var header = true
   var index = header.indexOf(',')
 

[Timeout] ConditionalExpression
lib/request.js:297:16
 
   // Note: X-Forwarded-Proto is normally only ever a
   //       single value, but this is to be safe.
-  var header = this.get('X-Forwarded-Proto') || proto
+  var header = false
   var index = header.indexOf(',')
 

[Timeout] StringLiteral
lib/request.js:298:30
   // Note: X-Forwarded-Proto is normally only ever a
   //       single value, but this is to be safe.
   var header = this.get('X-Forwarded-Proto') || proto
-  var index = header.indexOf(',')
+  var index = header.indexOf("")
 
   return index !== -1

[Timeout] ConditionalExpression
lib/request.js:300:10
   var header = this.get('X-Forwarded-Proto') || proto
   var index = header.indexOf(',')
 
-  return index !== -1
+  return true
     ? header.substring(0, index).trim()
     : header.trim()

[Timeout] ConditionalExpression
lib/request.js:300:10
   var header = this.get('X-Forwarded-Proto') || proto
   var index = header.indexOf(',')
 
-  return index !== -1
+  return false
     ? header.substring(0, index).trim()
     : header.trim()

[Timeout] MethodExpression
lib/request.js:301:7
   var index = header.indexOf(',')
 
   return index !== -1
-    ? header.substring(0, index).trim()
+    ? header.trim()
     : header.trim()
 });

[Timeout] MethodExpression
lib/request.js:301:7
   var index = header.indexOf(',')
 
   return index !== -1
-    ? header.substring(0, index).trim()
+    ? header.substring(0, index)
     : header.trim()
 });

[Timeout] MethodExpression
lib/request.js:302:7
 
   return index !== -1
     ? header.substring(0, index).trim()
-    : header.trim()
+    : header
 });
 

[Timeout] BlockStatement
lib/request.js:314:46
  * @public
  */
 
-defineGetter(req, 'secure', function secure(){
-  return this.protocol === 'https';
-});
+defineGetter(req, 'secure', function secure(){});
 
 /**

[Timeout] EqualityOperator
lib/request.js:315:10
  */
 
 defineGetter(req, 'secure', function secure(){
-  return this.protocol === 'https';
+  return this.protocol !== 'https';
 });
 

[Timeout] ConditionalExpression
lib/request.js:315:10
  */
 
 defineGetter(req, 'secure', function secure(){
-  return this.protocol === 'https';
+  return true;
 });
 

[Timeout] BlockStatement
lib/request.js:328:38
  * @public
  */
 
-defineGetter(req, 'ip', function ip(){
-  var trust = this.app.get('trust proxy fn');
-  return proxyaddr(this, trust);
-});
+defineGetter(req, 'ip', function ip(){});
 
 /**

[Timeout] StringLiteral
lib/request.js:328:19
  * @public
  */
 
-defineGetter(req, 'ip', function ip(){
+defineGetter(req, "", function ip(){
   var trust = this.app.get('trust proxy fn');
   return proxyaddr(this, trust);

[Timeout] BlockStatement
lib/request.js:345:41
  * @public
  */
 
-defineGetter(req, 'ips', function ips() {
-  var trust = this.app.get('trust proxy fn');
-  var addrs = proxyaddr.all(this, trust);
-
-  // reverse the order (to farthest -> closest)
-  // and remove socket address
-  addrs.reverse().pop()
-
-  return addrs
-});
+defineGetter(req, 'ips', function ips() {});
 
 /**

[Timeout] MethodExpression
lib/request.js:351:3
 
   // reverse the order (to farthest -> closest)
   // and remove socket address
-  addrs.reverse().pop()
+  addrs.pop()
 
   return addrs

[Timeout] BlockStatement
lib/request.js:371:55
  * @public
  */
 
-defineGetter(req, 'subdomains', function subdomains() {
-  var hostname = this.hostname;
-
-  if (!hostname) return [];
-
-  var offset = this.app.get('subdomain offset');
-  var subdomains = !isIP(hostname)
-    ? hostname.split('.').reverse()
-    : [hostname];
-
-  return subdomains.slice(offset);
-});
+defineGetter(req, 'subdomains', function subdomains() {});
 
 /**

[Timeout] ConditionalExpression
lib/request.js:374:7
 defineGetter(req, 'subdomains', function subdomains() {
   var hostname = this.hostname;
 
-  if (!hostname) return [];
+  if (false) return [];
 
   var offset = this.app.get('subdomain offset');

[Timeout] BooleanLiteral
lib/request.js:374:7
 defineGetter(req, 'subdomains', function subdomains() {
   var hostname = this.hostname;
 
-  if (!hostname) return [];
+  if (hostname) return [];
 
   var offset = this.app.get('subdomain offset');

[Timeout] StringLiteral
lib/request.js:376:29
 
   if (!hostname) return [];
 
-  var offset = this.app.get('subdomain offset');
+  var offset = this.app.get("");
   var subdomains = !isIP(hostname)
     ? hostname.split('.').reverse()

[Timeout] BooleanLiteral
lib/request.js:377:20
   if (!hostname) return [];
 
   var offset = this.app.get('subdomain offset');
-  var subdomains = !isIP(hostname)
+  var subdomains = isIP(hostname)
     ? hostname.split('.').reverse()
     : [hostname];

[Timeout] MethodExpression
lib/request.js:378:7
 
   var offset = this.app.get('subdomain offset');
   var subdomains = !isIP(hostname)
-    ? hostname.split('.').reverse()
+    ? hostname.split('.')
     : [hostname];
 

[Timeout] MethodExpression
lib/request.js:381:10
     ? hostname.split('.').reverse()
     : [hostname];
 
-  return subdomains.slice(offset);
+  return subdomains;
 });
 

[Timeout] BlockStatement
lib/request.js:391:43
  * @public
  */
 
-defineGetter(req, 'path', function path() {
-  return parse(this).pathname;
-});
+defineGetter(req, 'path', function path() {});
 
 /**

[Timeout] BlockStatement
lib/request.js:406:42
  * @public
  */
 
-defineGetter(req, 'host', function host(){
-  var trust = this.app.get('trust proxy fn');
-  var val = this.get('X-Forwarded-Host');
-
-  if (!val || !trust(this.connection.remoteAddress, 0)) {
-    val = this.get('Host');
-  } else if (val.indexOf(',') !== -1) {
-    // Note: X-Forwarded-Host is normally only ever a
-    //       single value, but this is to be safe.
-    val = val.substring(0, val.indexOf(',')).trimRight()
-  }
-
-  return val || undefined;
-});
+defineGetter(req, 'host', function host(){});
 
 /**

[Timeout] StringLiteral
lib/request.js:406:19
  * @public
  */
 
-defineGetter(req, 'host', function host(){
+defineGetter(req, "", function host(){
   var trust = this.app.get('trust proxy fn');
   var val = this.get('X-Forwarded-Host');

[Timeout] StringLiteral
lib/request.js:408:22
 
 defineGetter(req, 'host', function host(){
   var trust = this.app.get('trust proxy fn');
-  var val = this.get('X-Forwarded-Host');
+  var val = this.get("");
 
   if (!val || !trust(this.connection.remoteAddress, 0)) {

[Timeout] BlockStatement
lib/request.js:410:57
   var trust = this.app.get('trust proxy fn');
   var val = this.get('X-Forwarded-Host');
 
-  if (!val || !trust(this.connection.remoteAddress, 0)) {
-    val = this.get('Host');
-  } else if (val.indexOf(',') !== -1) {
+  if (!val || !trust(this.connection.remoteAddress, 0)) {} else if (val.indexOf(',') !== -1) {
     // Note: X-Forwarded-Host is normally only ever a
     //       single value, but this is to be safe.

[Timeout] BooleanLiteral
lib/request.js:410:7
   var trust = this.app.get('trust proxy fn');
   var val = this.get('X-Forwarded-Host');
 
-  if (!val || !trust(this.connection.remoteAddress, 0)) {
+  if (val || !trust(this.connection.remoteAddress, 0)) {
     val = this.get('Host');
   } else if (val.indexOf(',') !== -1) {

[Timeout] StringLiteral
lib/request.js:411:20
   var val = this.get('X-Forwarded-Host');
 
   if (!val || !trust(this.connection.remoteAddress, 0)) {
-    val = this.get('Host');
+    val = this.get("");
   } else if (val.indexOf(',') !== -1) {
     // Note: X-Forwarded-Host is normally only ever a

[Timeout] UnaryOperator
lib/request.js:412:35
 
   if (!val || !trust(this.connection.remoteAddress, 0)) {
     val = this.get('Host');
-  } else if (val.indexOf(',') !== -1) {
+  } else if (val.indexOf(',') !== +1) {
     // Note: X-Forwarded-Host is normally only ever a
     //       single value, but this is to be safe.

[Timeout] EqualityOperator
lib/request.js:412:14
 
   if (!val || !trust(this.connection.remoteAddress, 0)) {
     val = this.get('Host');
-  } else if (val.indexOf(',') !== -1) {
+  } else if (val.indexOf(',') === -1) {
     // Note: X-Forwarded-Host is normally only ever a
     //       single value, but this is to be safe.

[Timeout] MethodExpression
lib/request.js:415:11
   } else if (val.indexOf(',') !== -1) {
     // Note: X-Forwarded-Host is normally only ever a
     //       single value, but this is to be safe.
-    val = val.substring(0, val.indexOf(',')).trimRight()
+    val = val.trimRight()
   }
 

[Timeout] LogicalOperator
lib/request.js:418:10
     val = val.substring(0, val.indexOf(',')).trimRight()
   }
 
-  return val || undefined;
+  return val && undefined;
 });
 

[Timeout] ConditionalExpression
lib/request.js:418:10
     val = val.substring(0, val.indexOf(',')).trimRight()
   }
 
-  return val || undefined;
+  return false;
 });
 

[Timeout] BlockStatement
lib/request.js:432:50
  * @api public
  */
 
-defineGetter(req, 'hostname', function hostname(){
-  var host = this.host;
-
-  if (!host) return;
-
-  // IPv6 literal support
-  var offset = host[0] === '['
-    ? host.indexOf(']') + 1
-    : 0;
-  var index = host.indexOf(':', offset);
-
-  return index !== -1
-    ? host.substring(0, index)
-    : host;
-});
+defineGetter(req, 'hostname', function hostname(){});
 
 /**

[Timeout] ConditionalExpression
lib/request.js:435:7
 defineGetter(req, 'hostname', function hostname(){
   var host = this.host;
 
-  if (!host) return;
+  if (false) return;
 
   // IPv6 literal support

[Timeout] BooleanLiteral
lib/request.js:435:7
 defineGetter(req, 'hostname', function hostname(){
   var host = this.host;
 
-  if (!host) return;
+  if (host) return;
 
   // IPv6 literal support

[Timeout] ConditionalExpression
lib/request.js:438:16
   if (!host) return;
 
   // IPv6 literal support
-  var offset = host[0] === '['
+  var offset = true
     ? host.indexOf(']') + 1
     : 0;

[Timeout] EqualityOperator
lib/request.js:438:16
   if (!host) return;
 
   // IPv6 literal support
-  var offset = host[0] === '['
+  var offset = host[0] !== '['
     ? host.indexOf(']') + 1
     : 0;

[Timeout] ArithmeticOperator
lib/request.js:439:7
 
   // IPv6 literal support
   var offset = host[0] === '['
-    ? host.indexOf(']') + 1
+    ? host.indexOf(']') - 1
     : 0;
   var index = host.indexOf(':', offset);

[Timeout] UnaryOperator
lib/request.js:443:20
     : 0;
   var index = host.indexOf(':', offset);
 
-  return index !== -1
+  return index !== +1
     ? host.substring(0, index)
     : host;

[Timeout] MethodExpression
lib/request.js:444:7
   var index = host.indexOf(':', offset);
 
   return index !== -1
-    ? host.substring(0, index)
+    ? host
     : host;
 });

[Timeout] BlockStatement
lib/request.js:457:38
  * @public
  */
 
-defineGetter(req, 'fresh', function(){
-  var method = this.method;
-  var res = this.res
-  var status = res.statusCode
-
-  // GET or HEAD for weak freshness validation only
-  if ('GET' !== method && 'HEAD' !== method) return false;
-
-  // 2xx or 304 as per rfc2616 14.26
-  if ((status >= 200 && status < 300) || 304 === status) {
-    return fresh(this.headers, {
-      'etag': res.get('ETag'),
-      'last-modified': res.get('Last-Modified')
-    })
-  }
-
-  return false;
-});
+defineGetter(req, 'fresh', function(){});
 
 /**

[Killed] BooleanLiteral
lib/request.js:463:53
   var status = res.statusCode
 
   // GET or HEAD for weak freshness validation only
-  if ('GET' !== method && 'HEAD' !== method) return false;
+  if ('GET' !== method && 'HEAD' !== method) return true;
 
   // 2xx or 304 as per rfc2616 14.26
killedBy: mvc PUT /user/:id should 500 on error
statusReason: expected 500 "Internal Server Error", got 304 "Not Modified"

[Timeout] ConditionalExpression
lib/request.js:463:7
   var status = res.statusCode
 
   // GET or HEAD for weak freshness validation only
-  if ('GET' !== method && 'HEAD' !== method) return false;
+  if (true) return false;
 
   // 2xx or 304 as per rfc2616 14.26

[Killed] ConditionalExpression
lib/request.js:466:7
   if ('GET' !== method && 'HEAD' !== method) return false;
 
   // 2xx or 304 as per rfc2616 14.26
-  if ((status >= 200 && status < 300) || 304 === status) {
+  if (false) {
     return fresh(this.headers, {
       'etag': res.get('ETag'),
killedBy: resource GET /users/1..3.json should respond with users 2 and 3 as json
statusReason: expected body '[{"name":"ciaran"},{"name":"aaron"},{"name":"guillermo"}]' to match /^\[null,{"name":"aaron"},{"name":"guillermo"}\]/

[Killed] BlockStatement
lib/request.js:466:58
   if ('GET' !== method && 'HEAD' !== method) return false;
 
   // 2xx or 304 as per rfc2616 14.26
-  if ((status >= 200 && status < 300) || 304 === status) {
-    return fresh(this.headers, {
-      'etag': res.get('ETag'),
-      'last-modified': res.get('Last-Modified')
-    })
-  }
+  if ((status >= 200 && status < 300) || 304 === status) {}
 
   return false;
killedBy: mvc GET /users should display a list of users
statusReason: expected body '<!DOCTYPE html>\n' +
  '<html>\n' +
  '<head>\n' +
  '  <meta charset="utf-8">\n' +
  '  <meta name="viewport" content="width=device-width,initial-scale=1">\n' +
  '  <link rel="stylesheet" href="/style.css">\n' +
  '  <title>Users</title>\n' +
  '</head>\n' +

[Timeout] ObjectLiteral
lib/request.js:467:32
 
   // 2xx or 304 as per rfc2616 14.26
   if ((status >= 200 && status < 300) || 304 === status) {
-    return fresh(this.headers, {
-      'etag': res.get('ETag'),
-      'last-modified': res.get('Last-Modified')
-    })
+    return fresh(this.headers, {})
   }
 

[Killed] BlockStatement
lib/request.js:485:44
  * @public
  */
 
-defineGetter(req, 'stale', function stale(){
-  return !this.fresh;
-});
+defineGetter(req, 'stale', function stale(){});
 
 /**
killedBy: req .stale should return true when the resource is modified
statusReason: expected 'true' response body, got ''

[Killed] BooleanLiteral
lib/request.js:486:10
  */
 
 defineGetter(req, 'stale', function stale(){
-  return !this.fresh;
+  return this.fresh;
 });
 
killedBy: req .stale should return true when the resource is modified
statusReason: expected 'true' response body, got 'false'

[Killed] BlockStatement
lib/request.js:496:40
  * @public
  */
 
-defineGetter(req, 'xhr', function xhr(){
-  var val = this.get('X-Requested-With') || '';
-  return val.toLowerCase() === 'xmlhttprequest';
-});
+defineGetter(req, 'xhr', function xhr(){});
 
 /**
killedBy: req .xhr should return true when X-Requested-With is xmlhttprequest
statusReason: expected 'true' response body, got ''

[Killed] ConditionalExpression
lib/request.js:497:13
  */
 
 defineGetter(req, 'xhr', function xhr(){
-  var val = this.get('X-Requested-With') || '';
+  var val = true;
   return val.toLowerCase() === 'xmlhttprequest';
 });
killedBy: req .xhr should return true when X-Requested-With is xmlhttprequest
statusReason: expected 200 "OK", got 500 "Internal Server Error"

[Killed] ConditionalExpression
lib/request.js:497:13
  */
 
 defineGetter(req, 'xhr', function xhr(){
-  var val = this.get('X-Requested-With') || '';
+  var val = false;
   return val.toLowerCase() === 'xmlhttprequest';
 });
killedBy: req .xhr should return true when X-Requested-With is xmlhttprequest
statusReason: expected 200 "OK", got 500 "Internal Server Error"

[Killed] EqualityOperator
lib/request.js:498:10
 
 defineGetter(req, 'xhr', function xhr(){
   var val = this.get('X-Requested-With') || '';
-  return val.toLowerCase() === 'xmlhttprequest';
+  return val.toLowerCase() !== 'xmlhttprequest';
 });
 
killedBy: req .xhr should return true when X-Requested-With is xmlhttprequest
statusReason: expected 'true' response body, got 'false'

[Killed] ConditionalExpression
lib/request.js:498:10
 
 defineGetter(req, 'xhr', function xhr(){
   var val = this.get('X-Requested-With') || '';
-  return val.toLowerCase() === 'xmlhttprequest';
+  return false;
 });
 
killedBy: req .xhr should return true when X-Requested-With is xmlhttprequest
statusReason: expected 'true' response body, got 'false'

[Killed] BlockStatement
lib/request.js:509:42
  * @param {Function} getter
  * @private
  */
-function defineGetter(obj, name, getter) {
-  Object.defineProperty(obj, name, {
-    configurable: true,
-    enumerable: true,
-    get: getter
-  });
-}
+function defineGetter(obj, name, getter) {}
 
killedBy: web-service GET /api/users without an api key should respond with 400 bad request
statusReason: expected 400 "Bad Request", got 500 "Internal Server Error"

[Timeout] BooleanLiteral
lib/request.js:511:19
  */
 function defineGetter(obj, name, getter) {
   Object.defineProperty(obj, name, {
-    configurable: true,
+    configurable: false,
     enumerable: true,
     get: getter
