[Timeout] BlockStatement
lib/express.js:37:38
  */
 
 function createApplication() {
-  var app = function(req, res, next) {
-    app.handle(req, res, next);
-  };
+  var app = function(req, res, next) {};
 
   mixin(app, EventEmitter.prototype, false);

[Timeout] BooleanLiteral
lib/express.js:41:38
     app.handle(req, res, next);
   };
 
-  mixin(app, EventEmitter.prototype, false);
+  mixin(app, EventEmitter.prototype, true);
   mixin(app, proto, false);
 

[Timeout] BooleanLiteral
lib/express.js:42:21
   };
 
   mixin(app, EventEmitter.prototype, false);
-  mixin(app, proto, false);
+  mixin(app, proto, true);
 
   // expose the prototype that will get set on requests

[Killed] ObjectLiteral
lib/express.js:45:36
   mixin(app, proto, false);
 
   // expose the prototype that will get set on requests
-  app.request = Object.create(req, {
-    app: { configurable: true, enumerable: true, writable: true, value: app }
-  })
+  app.request = Object.create(req, {})
 
   // expose the prototype that will get set on responses
killedBy: auth GET /login should render login form
statusReason: expected 200 "OK", got 500 "Internal Server Error"

[Timeout] BooleanLiteral
lib/express.js:46:44
 
   // expose the prototype that will get set on requests
   app.request = Object.create(req, {
-    app: { configurable: true, enumerable: true, writable: true, value: app }
+    app: { configurable: true, enumerable: false, writable: true, value: app }
   })
 

[Timeout] BooleanLiteral
lib/express.js:46:26
 
   // expose the prototype that will get set on requests
   app.request = Object.create(req, {
-    app: { configurable: true, enumerable: true, writable: true, value: app }
+    app: { configurable: false, enumerable: true, writable: true, value: app }
   })
 

[Killed] ObjectLiteral
lib/express.js:50:37
   })
 
   // expose the prototype that will get set on responses
-  app.response = Object.create(res, {
-    app: { configurable: true, enumerable: true, writable: true, value: app }
-  })
+  app.response = Object.create(res, {})
 
   app.init();
killedBy: auth GET /login should render login form
statusReason: Cannot read properties of undefined (reading 'get')

[Timeout] BooleanLiteral
lib/express.js:51:44
 
   // expose the prototype that will get set on responses
   app.response = Object.create(res, {
-    app: { configurable: true, enumerable: true, writable: true, value: app }
+    app: { configurable: true, enumerable: false, writable: true, value: app }
   })
 

[Timeout] BooleanLiteral
lib/express.js:51:26
 
   // expose the prototype that will get set on responses
   app.response = Object.create(res, {
-    app: { configurable: true, enumerable: true, writable: true, value: app }
+    app: { configurable: false, enumerable: true, writable: true, value: app }
   })
 
