[Killed] ConditionalExpression
lib/view.js:53:14
  */
 
 function View(name, options) {
-  var opts = options || {};
+  var opts = true;
 
   this.defaultEngine = opts.defaultEngine;
killedBy: auth GET /login should render login form
statusReason: expected 200 "OK", got 500 "Internal Server Error"

[Killed] LogicalOperator
lib/view.js:53:14
  */
 
 function View(name, options) {
-  var opts = options || {};
+  var opts = options && {};
 
   this.defaultEngine = opts.defaultEngine;
killedBy: auth GET /login should render login form
statusReason: expected 200 "OK", got 500 "Internal Server Error"

[Killed] ConditionalExpression
lib/view.js:60:7
   this.name = name;
   this.root = opts.root;
 
-  if (!this.ext && !this.defaultEngine) {
+  if (false) {
     throw new Error('No default engine was specified and no extension was provided.');
   }
killedBy: mvc GET /users should display a list of users
statusReason: expected body '<!DOCTYPE html>\n' +
  '<html>\n' +
  '<head>\n' +
  '  <meta charset="utf-8">\n' +
  '  <meta name="viewport" content="width=device-width,initial-scale=1">\n' +
  '  <link rel="stylesheet" href="/style.css">\n' +
  '  <title>Users</title>\n' +
  '</head>\n' +

[Killed] ConditionalExpression
lib/view.js:60:7
   this.name = name;
   this.root = opts.root;
 
-  if (!this.ext && !this.defaultEngine) {
+  if (true) {
     throw new Error('No default engine was specified and no extension was provided.');
   }
killedBy: auth GET /login should render login form
statusReason: expected 200 "OK", got 500 "Internal Server Error"

[Timeout] StringLiteral
lib/view.js:61:21
   this.root = opts.root;
 
   if (!this.ext && !this.defaultEngine) {
-    throw new Error('No default engine was specified and no extension was provided.');
+    throw new Error("");
   }
 

[Killed] BlockStatement
lib/view.js:66:18
 
   var fileName = name;
 
-  if (!this.ext) {
-    // get extension from default engine name
-    this.ext = this.defaultEngine[0] !== '.'
-      ? '.' + this.defaultEngine
-      : this.defaultEngine;
-
-    fileName += this.ext;
-  }
+  if (!this.ext) {}
 
   if (!opts.engines[this.ext]) {
killedBy: auth GET /login should render login form
statusReason: expected 200 "OK", got 500 "Internal Server Error"

[Killed] ConditionalExpression
lib/view.js:66:7
 
   var fileName = name;
 
-  if (!this.ext) {
+  if (false) {
     // get extension from default engine name
     this.ext = this.defaultEngine[0] !== '.'
killedBy: auth GET /login should render login form
statusReason: expected 200 "OK", got 500 "Internal Server Error"

[Killed] EqualityOperator
lib/view.js:68:16
 
   if (!this.ext) {
     // get extension from default engine name
-    this.ext = this.defaultEngine[0] !== '.'
+    this.ext = this.defaultEngine[0] === '.'
       ? '.' + this.defaultEngine
       : this.defaultEngine;
killedBy: auth GET /login should render login form
statusReason: expected 200 "OK", got 500 "Internal Server Error"

[Killed] ConditionalExpression
lib/view.js:68:16
 
   if (!this.ext) {
     // get extension from default engine name
-    this.ext = this.defaultEngine[0] !== '.'
+    this.ext = false
       ? '.' + this.defaultEngine
       : this.defaultEngine;
killedBy: auth GET /login should render login form
statusReason: expected 200 "OK", got 500 "Internal Server Error"

[Timeout] AssignmentOperator
lib/view.js:72:5
       ? '.' + this.defaultEngine
       : this.defaultEngine;
 
-    fileName += this.ext;
+    fileName -= this.ext;
   }
 

[Killed] ConditionalExpression
lib/view.js:75:7
     fileName += this.ext;
   }
 
-  if (!opts.engines[this.ext]) {
+  if (false) {
     // load engine
     var mod = this.ext.slice(1)
killedBy: mvc GET /users should display a list of users
statusReason: expected body '<!DOCTYPE html>\n' +
  '<html>\n' +
  '<head>\n' +
  '  <meta charset="utf-8">\n' +
  '  <meta name="viewport" content="width=device-width,initial-scale=1">\n' +
  '  <link rel="stylesheet" href="/style.css">\n' +
  '  <title>Users</title>\n' +
  '</head>\n' +

[Killed] BooleanLiteral
lib/view.js:75:7
     fileName += this.ext;
   }
 
-  if (!opts.engines[this.ext]) {
+  if (opts.engines[this.ext]) {
     // load engine
     var mod = this.ext.slice(1)
killedBy: ejs GET / should respond with html
statusReason: expected body '<!DOCTYPE html>\n' +
  '<html lang="en">\n' +
  '<head>\n' +
  '<meta charset="utf-8">\n' +
  '<title>Error</title>\n' +
  '</head>\n' +
  '<body>\n' +

[Timeout] MethodExpression
lib/view.js:77:15
 
   if (!opts.engines[this.ext]) {
     // load engine
-    var mod = this.ext.slice(1)
+    var mod = this.ext
     debug('require "%s"', mod)
 

[Killed] ConditionalExpression
lib/view.js:83:9
     // default engine export
     var fn = require(mod).__express
 
-    if (typeof fn !== 'function') {
+    if (true) {
       throw new Error('Module "' + mod + '" does not provide a view engine.')
     }
killedBy: mvc GET /users should display a list of users
statusReason: expected body '<!DOCTYPE html>\n' +
  '<html>\n' +
  '<head>\n' +
  '  <meta charset="utf-8">\n' +
  '  <meta name="viewport" content="width=device-width,initial-scale=1">\n' +
  '  <link rel="stylesheet" href="/style.css">\n' +
  '  <title>Users</title>\n' +
  '</head>\n' +

[Killed] EqualityOperator
lib/view.js:83:9
     // default engine export
     var fn = require(mod).__express
 
-    if (typeof fn !== 'function') {
+    if (typeof fn === 'function') {
       throw new Error('Module "' + mod + '" does not provide a view engine.')
     }
killedBy: mvc GET /users should display a list of users
statusReason: expected body '<!DOCTYPE html>\n' +
  '<html>\n' +
  '<head>\n' +
  '  <meta charset="utf-8">\n' +
  '  <meta name="viewport" content="width=device-width,initial-scale=1">\n' +
  '  <link rel="stylesheet" href="/style.css">\n' +
  '  <title>Users</title>\n' +
  '</head>\n' +

[Killed] BlockStatement
lib/view.js:104:47
  * @private
  */
 
-View.prototype.lookup = function lookup(name) {
-  var path;
-  var roots = [].concat(this.root);
-
-  debug('lookup "%s"', name);
-
-  for (var i = 0; i < roots.length && !path; i++) {
-    var root = roots[i];
-
-    // resolve the path
-    var loc = resolve(root, name);
-    var dir = dirname(loc);
-    var file = basename(loc);
-
-    // resolve the file
-    path = this.resolve(dir, file);
-  }
-
-  return path;
-};
+View.prototype.lookup = function lookup(name) {};
 
 /**
killedBy: auth GET /login should render login form
statusReason: expected 200 "OK", got 500 "Internal Server Error"

[Killed] ArrayDeclaration
lib/view.js:106:15
 
 View.prototype.lookup = function lookup(name) {
   var path;
-  var roots = [].concat(this.root);
+  var roots = ["Stryker was here"].concat(this.root);
 
   debug('lookup "%s"', name);
killedBy: mvc GET /users should display a list of users
statusReason: expected body '<!DOCTYPE html>\n' +
  '<html>\n' +
  '<head>\n' +
  '  <meta charset="utf-8">\n' +
  '  <meta name="viewport" content="width=device-width,initial-scale=1">\n' +
  '  <link rel="stylesheet" href="/style.css">\n' +
  '  <title>Users</title>\n' +
  '</head>\n' +

[Killed] UpdateOperator
lib/view.js:110:46
 
   debug('lookup "%s"', name);
 
-  for (var i = 0; i < roots.length && !path; i++) {
+  for (var i = 0; i < roots.length && !path; i--) {
     var root = roots[i];
 
killedBy: mvc GET /users should display a list of users
statusReason: expected body '<!DOCTYPE html>\n' +
  '<html>\n' +
  '<head>\n' +
  '  <meta charset="utf-8">\n' +
  '  <meta name="viewport" content="width=device-width,initial-scale=1">\n' +
  '  <link rel="stylesheet" href="/style.css">\n' +
  '  <title>Users</title>\n' +
  '</head>\n' +

[Killed] LogicalOperator
lib/view.js:110:19
 
   debug('lookup "%s"', name);
 
-  for (var i = 0; i < roots.length && !path; i++) {
+  for (var i = 0; i < roots.length || !path; i++) {
     var root = roots[i];
 
killedBy: mvc GET /users should display a list of users
statusReason: expected body '<!DOCTYPE html>\n' +
  '<html>\n' +
  '<head>\n' +
  '  <meta charset="utf-8">\n' +
  '  <meta name="viewport" content="width=device-width,initial-scale=1">\n' +
  '  <link rel="stylesheet" href="/style.css">\n' +
  '  <title>Users</title>\n' +
  '</head>\n' +

[Timeout] BooleanLiteral
lib/view.js:134:14
  */
 
 View.prototype.render = function render(options, callback) {
-  var sync = true;
+  var sync = false;
 
   debug('render "%s"', this.path);

[Timeout] BlockStatement
lib/view.js:139:55
   debug('render "%s"', this.path);
 
   // render, normalizing sync callbacks
-  this.engine(this.path, options, function onRender() {
-    if (!sync) {
-      return callback.apply(this, arguments);
-    }
-
-    // copy arguments
-    var args = new Array(arguments.length);
-    var cntx = this;
-
-    for (var i = 0; i < arguments.length; i++) {
-      args[i] = arguments[i];
-    }
-
-    // force callback to be async
-    return process.nextTick(function renderTick() {
-      return callback.apply(cntx, args);
-    });
-  });
+  this.engine(this.path, options, function onRender() {});
 
   sync = false;

[Timeout] BlockStatement
lib/view.js:140:16
 
   // render, normalizing sync callbacks
   this.engine(this.path, options, function onRender() {
-    if (!sync) {
-      return callback.apply(this, arguments);
-    }
+    if (!sync) {}
 
     // copy arguments

[Timeout] BooleanLiteral
lib/view.js:140:9
 
   // render, normalizing sync callbacks
   this.engine(this.path, options, function onRender() {
-    if (!sync) {
+    if (sync) {
       return callback.apply(this, arguments);
     }

[Timeout] EqualityOperator
lib/view.js:148:21
     var args = new Array(arguments.length);
     var cntx = this;
 
-    for (var i = 0; i < arguments.length; i++) {
+    for (var i = 0; i >= arguments.length; i++) {
       args[i] = arguments[i];
     }

[Timeout] BlockStatement
lib/view.js:148:48
     var args = new Array(arguments.length);
     var cntx = this;
 
-    for (var i = 0; i < arguments.length; i++) {
-      args[i] = arguments[i];
-    }
+    for (var i = 0; i < arguments.length; i++) {}
 
     // force callback to be async

[Timeout] BlockStatement
lib/view.js:153:51
     }
 
     // force callback to be async
-    return process.nextTick(function renderTick() {
-      return callback.apply(cntx, args);
-    });
+    return process.nextTick(function renderTick() {});
   });
 

[Timeout] BooleanLiteral
lib/view.js:158:10
     });
   });
 
-  sync = false;
+  sync = true;
 };
 

[Timeout] BlockStatement
lib/view.js:169:54
  * @private
  */
 
-View.prototype.resolve = function resolve(dir, file) {
-  var ext = this.ext;
-
-  // <path>.<ext>
-  var path = join(dir, file);
-  var stat = tryStat(path);
-
-  if (stat && stat.isFile()) {
-    return path;
-  }
-
-  // <path>/index.<ext>
-  path = join(dir, basename(file, ext), 'index' + ext);
-  stat = tryStat(path);
-
-  if (stat && stat.isFile()) {
-    return path;
-  }
-};
+View.prototype.resolve = function resolve(dir, file) {};
 
 /**

[Timeout] LogicalOperator
lib/view.js:176:7
   var path = join(dir, file);
   var stat = tryStat(path);
 
-  if (stat && stat.isFile()) {
+  if (stat || stat.isFile()) {
     return path;
   }

[Timeout] BlockStatement
lib/view.js:176:30
   var path = join(dir, file);
   var stat = tryStat(path);
 
-  if (stat && stat.isFile()) {
-    return path;
-  }
+  if (stat && stat.isFile()) {}
 
   // <path>/index.<ext>

[Timeout] ConditionalExpression
lib/view.js:184:7
   path = join(dir, basename(file, ext), 'index' + ext);
   stat = tryStat(path);
 
-  if (stat && stat.isFile()) {
+  if (false) {
     return path;
   }

[Timeout] BlockStatement
lib/view.js:197:24
  * @private
  */
 
-function tryStat(path) {
-  debug('stat "%s"', path);
-
-  try {
-    return fs.statSync(path);
-  } catch (e) {
-    return undefined;
-  }
-}
+function tryStat(path) {}
 

[Timeout] BlockStatement
lib/view.js:200:7
 function tryStat(path) {
   debug('stat "%s"', path);
 
-  try {
-    return fs.statSync(path);
-  } catch (e) {
+  try {} catch (e) {
     return undefined;
   }

[Timeout] BlockStatement
lib/view.js:202:15
 
   try {
     return fs.statSync(path);
-  } catch (e) {
-    return undefined;
-  }
+  } catch (e) {}
 }
 
