[Killed] BlockStatement
lib/application.js:61:28
  * @private
  */
 
-app.init = function init() {
-  var router = null;
-
-  this.cache = Object.create(null);
-  this.engines = Object.create(null);
-  this.settings = Object.create(null);
-
-  this.defaultConfiguration();
-
-  // Setup getting to lazily add base router
-  Object.defineProperty(this, 'router', {
-    configurable: true,
-    enumerable: true,
-    get: function getrouter() {
-      if (router === null) {
-        router = new Router({
-          caseSensitive: this.enabled('case sensitive routing'),
-          strict: this.enabled('strict routing')
-        });
-      }
-
-      return router;
-    }
-  });
-};
+app.init = function init() {};
 
 /**
killedBy: app.all() should add a router per method
statusReason: Cannot read properties of undefined (reading 'route')

[Killed] BlockStatement
lib/application.js:74:31
   Object.defineProperty(this, 'router', {
     configurable: true,
     enumerable: true,
-    get: function getrouter() {
-      if (router === null) {
-        router = new Router({
-          caseSensitive: this.enabled('case sensitive routing'),
-          strict: this.enabled('strict routing')
-        });
-      }
-
-      return router;
-    }
+    get: function getrouter() {}
   });
 };
killedBy: app.all() should add a router per method
statusReason: Cannot read properties of undefined (reading 'route')

[Killed] EqualityOperator
lib/application.js:75:11
     configurable: true,
     enumerable: true,
     get: function getrouter() {
-      if (router === null) {
+      if (router !== null) {
         router = new Router({
           caseSensitive: this.enabled('case sensitive routing'),
killedBy: app.all() should add a router per method
statusReason: Cannot read properties of null (reading 'route')

[Killed] ConditionalExpression
lib/application.js:75:11
     configurable: true,
     enumerable: true,
     get: function getrouter() {
-      if (router === null) {
+      if (false) {
         router = new Router({
           caseSensitive: this.enabled('case sensitive routing'),
killedBy: app.all() should add a router per method
statusReason: Cannot read properties of null (reading 'route')

[NoCoverage] BlockStatement
lib/application.js:198:33
 
   // default path to '/'
   // disambiguate app.use([fn])
-  if (typeof fn !== 'function') {
-    var arg = fn;
-
-    while (Array.isArray(arg) && arg.length !== 0) {
-      arg = arg[0];
-    }
-
-    // first arg is the path
-    if (typeof arg !== 'function') {
-      offset = 1;
-      path = fn;
-    }
-  }
+  if (typeof fn !== 'function') {}
 
   var fns = flatten.call(slice.call(arguments, offset), Infinity);

[NoCoverage] EqualityOperator
lib/application.js:206:9
     }
 
     // first arg is the path
-    if (typeof arg !== 'function') {
+    if (typeof arg === 'function') {
       offset = 1;
       path = fn;

[NoCoverage] EqualityOperator
lib/application.js:214:7
 
   var fns = flatten.call(slice.call(arguments, offset), Infinity);
 
-  if (fns.length === 0) {
+  if (fns.length !== 0) {
     throw new TypeError('app.use() requires a middleware function')
   }

[NoCoverage] BooleanLiteral
lib/application.js:223:30
 
   fns.forEach(function (fn) {
     // non-express app
-    if (!fn || !fn.handle || !fn.set) {
+    if (!fn || !fn.handle || fn.set) {
       return router.use(path, fn);
     }

[Killed] BlockStatement
lib/application.js:258:34
  * @public
  */
 
-app.route = function route(path) {
-  return this.router.route(path);
-};
+app.route = function route(path) {};
 
 /**
killedBy: app.all() should add a router per method
statusReason: Cannot read properties of undefined (reading 'acl')

[NoCoverage] ConditionalExpression
lib/application.js:297:7
  */
 
 app.engine = function engine(ext, fn) {
-  if (typeof fn !== 'function') {
+  if (true) {
     throw new Error('callback function required');
   }

[NoCoverage] ConditionalExpression
lib/application.js:325:7
  */
 
 app.param = function param(name, fn) {
-  if (Array.isArray(name)) {
+  if (false) {
     for (var i = 0; i < name.length; i++) {
       this.param(name[i], fn);

[NoCoverage] BlockStatement
lib/application.js:325:28
  */
 
 app.param = function param(name, fn) {
-  if (Array.isArray(name)) {
-    for (var i = 0; i < name.length; i++) {
-      this.param(name[i], fn);
-    }
-
-    return this;
-  }
+  if (Array.isArray(name)) {}
 
   this.router.param(name, fn);

[Killed] ConditionalExpression
lib/application.js:366:5
 
   // trigger matched settings
   switch (setting) {
-    case 'etag':
-      this.set('etag fn', compileETag(val));
-      break;
+    case 'etag':
     case 'query parser':
       this.set('query parser fn', compileQueryParser(val));
killedBy: app.all() should add a router per method
statusReason: unknown value for query parser function: weak

[Killed] ConditionalExpression
lib/application.js:369:5
     case 'etag':
       this.set('etag fn', compileETag(val));
       break;
-    case 'query parser':
-      this.set('query parser fn', compileQueryParser(val));
-      break;
+    case 'query parser':
     case 'trust proxy':
       this.set('trust proxy fn', compileTrust(val));
killedBy: app.all() should add a router per method
statusReason: invalid IP address: simple

[Killed] ObjectLiteral
lib/application.js:376:69
       this.set('trust proxy fn', compileTrust(val));
 
       // trust proxy inherit back-compat
-      Object.defineProperty(this.settings, trustProxyDefaultSymbol, {
-        configurable: true,
-        value: false
-      });
+      Object.defineProperty(this.settings, trustProxyDefaultSymbol, {});
 
       break;
killedBy: app.all() should add a router per method
statusReason: Cannot redefine property: @@symbol:trust_proxy_default

[Killed] BlockStatement
lib/application.js:473:33
  * Delegate `.VERB(...)` calls to `router.VERB(...)`.
  */
 
-methods.forEach(function(method){
-  app[method] = function(path){
-    if (method === 'get' && arguments.length === 1) {
-      // app.get(setting)
-      return this.set(path);
-    }
-
-    var route = this.route(path);
-    route[method].apply(route, slice.call(arguments, 1));
-    return this;
-  };
-});
+methods.forEach(function(method){});
 
 /**
killedBy: app.all() should add a router per method
statusReason: this.get is not a function

[Killed] ConditionalExpression
lib/application.js:475:9
 
 methods.forEach(function(method){
   app[method] = function(path){
-    if (method === 'get' && arguments.length === 1) {
+    if (false) {
       // app.get(setting)
       return this.set(path);
killedBy: app.all() should add a router per method
statusReason: argument handler is required

[Killed] EqualityOperator
lib/application.js:475:9
 
 methods.forEach(function(method){
   app[method] = function(path){
-    if (method === 'get' && arguments.length === 1) {
+    if (method !== 'get' && arguments.length === 1) {
       // app.get(setting)
       return this.set(path);
killedBy: app.all() should add a router per method
statusReason: argument handler is required

[NoCoverage] ConditionalExpression
lib/application.js:542:7
   merge(renderOptions, this.locals);
 
   // merge options._locals
-  if (opts._locals) {
+  if (true) {
     merge(renderOptions, opts._locals);
   }

[NoCoverage] ConditionalExpression
lib/application.js:560:7
   }
 
   // view
-  if (!view) {
+  if (false) {
     var View = this.get('view');
 

[NoCoverage] ConditionalExpression
lib/application.js:570:46
     });
 
     if (!view.path) {
-      var dirs = Array.isArray(view.root) && view.root.length > 1
+      var dirs = Array.isArray(view.root) && true
         ? 'directories "' + view.root.slice(0, -1).join('", "') + '" or "' + view.root[view.root.length - 1] + '"'
         : 'directory "' + view.root + '"'

[NoCoverage] UnaryOperator
lib/application.js:571:48
 
     if (!view.path) {
       var dirs = Array.isArray(view.root) && view.root.length > 1
-        ? 'directories "' + view.root.slice(0, -1).join('", "') + '" or "' + view.root[view.root.length - 1] + '"'
+        ? 'directories "' + view.root.slice(0, +1).join('", "') + '" or "' + view.root[view.root.length - 1] + '"'
         : 'directory "' + view.root + '"'
       var err = new Error('Failed to lookup view "' + name + '" in views ' + dirs);

[NoCoverage] ConditionalExpression
lib/application.js:612:7
 app.listen = function listen () {
   var server = http.createServer(this)
   var args = Array.prototype.slice.call(arguments)
-  if (typeof args[args.length - 1] === 'function') {
+  if (true) {
     var done = args[args.length - 1] = once(args[args.length - 1])
     server.once('error', done)
