[NoCoverage] ConditionalExpression
lib/request.js:463:7
   var status = res.statusCode
 
   // GET or HEAD for weak freshness validation only
-  if ('GET' !== method && 'HEAD' !== method) return false;
+  if (true && 'HEAD' !== method) return false;
 
   // 2xx or 304 as per rfc2616 14.26

[NoCoverage] ConditionalExpression
lib/request.js:466:25
   if ('GET' !== method && 'HEAD' !== method) return false;
 
   // 2xx or 304 as per rfc2616 14.26
-  if ((status >= 200 && status < 300) || 304 === status) {
+  if ((status >= 200 && true) || 304 === status) {
     return fresh(this.headers, {
       'etag': res.get('ETag'),
