[NoCoverage] ConditionalExpression
lib/response.js:70:7
     throw new TypeError(`Invalid status code: ${JSON.stringify(code)}. Status code must be an integer.`);
   }
   // Check if the status code is outside of Node's valid range
-  if (code < 100 || code > 999) {
+  if (false) {
     throw new RangeError(`Invalid status code: ${JSON.stringify(code)}. Status code must be greater than 99 and less than 1000.`);
   }

[NoCoverage] ConditionalExpression
lib/response.js:70:7
     throw new TypeError(`Invalid status code: ${JSON.stringify(code)}. Status code must be an integer.`);
   }
   // Check if the status code is outside of Node's valid range
-  if (code < 100 || code > 999) {
+  if (false || code > 999) {
     throw new RangeError(`Invalid status code: ${JSON.stringify(code)}. Status code must be greater than 99 and less than 1000.`);
   }

[NoCoverage] BlockStatement
lib/response.js:136:40
       if (chunk === null) {
         chunk = '';
       } else if (Buffer.isBuffer(chunk)) {
-        if (!this.get('Content-Type')) {
-          this.type('bin');
-        }
+        if (!this.get('Content-Type')) {}
       } else {
         return this.json(chunk);

[NoCoverage] EqualityOperator
lib/response.js:146:7
   }
 
   // write strings in utf-8
-  if (typeof chunk === 'string') {
+  if (typeof chunk !== 'string') {
     encoding = 'utf8';
     type = this.get('Content-Type');

[NoCoverage] BlockStatement
lib/response.js:151:35
     type = this.get('Content-Type');
 
     // reflect this in content-type
-    if (typeof type === 'string') {
-      this.set('Content-Type', setCharset(type, 'utf-8'));
-    }
+    if (typeof type === 'string') {}
   }
 

[NoCoverage] ConditionalExpression
lib/response.js:158:22
 
   // determine if ETag should be generated
   var etagFn = app.get('etag fn')
-  var generateETag = !this.get('ETag') && typeof etagFn === 'function'
+  var generateETag = false
 
   // populate Content-Length

[NoCoverage] ConditionalExpression
lib/response.js:162:7
 
   // populate Content-Length
   var len
-  if (chunk !== undefined) {
+  if (true) {
     if (Buffer.isBuffer(chunk)) {
       // get length of Buffer

[NoCoverage] BlockStatement
lib/response.js:163:33
   // populate Content-Length
   var len
   if (chunk !== undefined) {
-    if (Buffer.isBuffer(chunk)) {
-      // get length of Buffer
-      len = chunk.length
-    } else if (!generateETag && chunk.length < 1000) {
+    if (Buffer.isBuffer(chunk)) {} else if (!generateETag && chunk.length < 1000) {
       // just calculate length when no ETag + small chunk
       len = Buffer.byteLength(chunk, encoding)

[NoCoverage] EqualityOperator
lib/response.js:166:33
     if (Buffer.isBuffer(chunk)) {
       // get length of Buffer
       len = chunk.length
-    } else if (!generateETag && chunk.length < 1000) {
+    } else if (!generateETag && chunk.length <= 1000) {
       // just calculate length when no ETag + small chunk
       len = Buffer.byteLength(chunk, encoding)

[NoCoverage] ConditionalExpression
lib/response.js:166:16
     if (Buffer.isBuffer(chunk)) {
       // get length of Buffer
       len = chunk.length
-    } else if (!generateETag && chunk.length < 1000) {
+    } else if (false) {
       // just calculate length when no ETag + small chunk
       len = Buffer.byteLength(chunk, encoding)

[NoCoverage] ConditionalExpression
lib/response.js:182:10
   // populate ETag
   var etag;
   if (generateETag && len !== undefined) {
-    if ((etag = etagFn(chunk, encoding))) {
+    if ((false)) {
       this.set('ETag', etag);
     }

[NoCoverage] ConditionalExpression
lib/response.js:374:7
   var next = req.next;
   var opts = options || {};
 
-  if (!path) {
+  if (false) {
     throw new TypeError('path argument is required to res.sendFile');
   }

[NoCoverage] ConditionalExpression
lib/response.js:378:7
     throw new TypeError('path argument is required to res.sendFile');
   }
 
-  if (typeof path !== 'string') {
+  if (false) {
     throw new TypeError('path must be a string to res.sendFile')
   }

[NoCoverage] ConditionalExpression
lib/response.js:383:7
   }
 
   // support function as second arg
-  if (typeof options === 'function') {
+  if (false) {
     done = options;
     opts = {};

[NoCoverage] BlockStatement
lib/response.js:383:38
   }
 
   // support function as second arg
-  if (typeof options === 'function') {
-    done = options;
-    opts = {};
-  }
+  if (typeof options === 'function') {}
 
   if (!opts.root && !pathIsAbsolute(path)) {

[NoCoverage] BlockStatement
lib/response.js:388:44
     opts = {};
   }
 
-  if (!opts.root && !pathIsAbsolute(path)) {
-    throw new TypeError('path must be absolute or specify root to res.sendFile');
-  }
+  if (!opts.root && !pathIsAbsolute(path)) {}
 
   // create file stream

[NoCoverage] ConditionalExpression
lib/response.js:443:39
 
   // support optional filename, where options may be in it's place
   if (typeof filename === 'object' &&
-    (typeof options === 'function' || options === undefined)) {
+    (typeof options === 'function' || false)) {
     name = null
     opts = filename

[NoCoverage] ConditionalExpression
lib/response.js:454:7
   };
 
   // merge user-provided headers
-  if (opts && opts.headers) {
+  if (false) {
     var keys = Object.keys(opts.headers)
     for (var i = 0; i < keys.length; i++) {

[NoCoverage] BlockStatement
lib/response.js:578:27
   if (key) {
     this.set('Content-Type', normalizeType(key).value);
     obj[key](req, this, next);
-  } else if (obj.default) {
-    obj.default(req, this, next)
-  } else {
+  } else if (obj.default) {} else {
     next(createError(406, {
       types: normalizeTypes(keys).map(function (o) { return o.value })

[NoCoverage] MethodExpression
lib/response.js:665:9
       : String(val);
 
     // add charset to content-type
-    if (field.toLowerCase() === 'content-type') {
+    if (field.toUpperCase() === 'content-type') {
       if (Array.isArray(value)) {
         throw new TypeError('Content-Type cannot be set to an Array');

[NoCoverage] BlockStatement
lib/response.js:752:28
     val = 's:' + sign(val, secret);
   }
 
-  if (opts.maxAge != null) {
-    var maxAge = opts.maxAge - 0
-
-    if (!isNaN(maxAge)) {
-      opts.expires = new Date(Date.now() + maxAge)
-      opts.maxAge = Math.floor(maxAge / 1000)
-    }
-  }
+  if (opts.maxAge != null) {}
 
   if (opts.path == null) {

[NoCoverage] ConditionalExpression
lib/response.js:839:7
   this.status(status);
   this.set('Content-Length', Buffer.byteLength(body));
 
-  if (this.req.method === 'HEAD') {
+  if (false) {
     this.end();
   } else {

[NoCoverage] BlockStatement
lib/response.js:891:38
   opts._locals = self.locals;
 
   // default callback to respond
-  done = done || function (err, str) {
-    if (err) return req.next(err);
-    self.send(str);
-  };
+  done = done || function (err, str) {};
 
   // render

[NoCoverage] ConditionalExpression
lib/response.js:974:7
   file.on('stream', onstream);
   onFinished(res, onfinish);
 
-  if (options.headers) {
+  if (true) {
     // set headers on successful transfer
     file.on('headers', function headers(res) {
