[NoCoverage] ConditionalExpression
lib/utils.js:70:19
 exports.normalizeTypes = function(types){
   var ret = [];
 
-  for (var i = 0; i < types.length; ++i) {
+  for (var i = 0; false; ++i) {
     ret.push(exports.normalizeType(types[i]));
   }

[NoCoverage] UpdateOperator
lib/utils.js:70:37
 exports.normalizeTypes = function(types){
   var ret = [];
 
-  for (var i = 0; i < types.length; ++i) {
+  for (var i = 0; i < types.length; --i) {
     ret.push(exports.normalizeType(types[i]));
   }

[Survived] ConditionalExpression
lib/utils.js:182:7
     return function(){ return true };
   }
 
-  if (typeof val === 'number') {
+  if (true) {
     // Support trusting hop count
     return function(a, i){ return i < val };

[Killed] ConditionalExpression
lib/utils.js:187:7
     return function(a, i){ return i < val };
   }
 
-  if (typeof val === 'string') {
+  if (true) {
     // Support comma-separated values
     val = val.split(',')
killedBy: app.all() should add a router per method
statusReason: val.split is not a function

[Killed] EqualityOperator
lib/utils.js:187:7
     return function(a, i){ return i < val };
   }
 
-  if (typeof val === 'string') {
+  if (typeof val !== 'string') {
     // Support comma-separated values
     val = val.split(',')
killedBy: app.all() should add a router per method
statusReason: val.split is not a function

[Killed] LogicalOperator
lib/utils.js:193:28
       .map(function (v) { return v.trim() })
   }
 
-  return proxyaddr.compile(val || []);
+  return proxyaddr.compile(val && []);
 }
 
killedBy: app.all() should add a router per method
statusReason: argument is required

[Killed] ConditionalExpression
lib/utils.js:193:28
       .map(function (v) { return v.trim() })
   }
 
-  return proxyaddr.compile(val || []);
+  return proxyaddr.compile(true);
 }
 
killedBy: app.all() should add a router per method
statusReason: unsupported trust argument

[NoCoverage] ConditionalExpression
lib/utils.js:206:7
  */
 
 exports.setCharset = function setCharset(type, charset) {
-  if (!type || !charset) {
+  if (false) {
     return type;
   }
