[NoCoverage] ConditionalExpression
lib/view.js:66:7
 
   var fileName = name;
 
-  if (!this.ext) {
+  if (true) {
     // get extension from default engine name
     this.ext = this.defaultEngine[0] !== '.'

[NoCoverage] ConditionalExpression
lib/view.js:75:7
     fileName += this.ext;
   }
 
-  if (!opts.engines[this.ext]) {
+  if (true) {
     // load engine
     var mod = this.ext.slice(1)
